Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:DCRDef edc:_addr="0x1FC55F9C" edc:access="----------------------------n-nn" edc:cname="FBCFG0" edc:default="0x9" edc:desc="FBCFG0" edc:factorydefault="0x8" edc:impl="0xb" edc:name="FBCFG0" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x8000000B">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BUHSWEN" edc:desc="Buck mode switching control" edc:mask="0x1" edc:name="BUHSWEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Buck mode is switched in HW at POR before CPU is allowed to boot" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Buck switching is disabled in HW at POR. Enable from SW" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PCSCMODE" edc:desc="PCache Single cache Mode" edc:mask="0x1" edc:name="PCSCMODE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SINGLE" edc:desc="PCHE ICache Only.CPU Instructions (code, data) go to PCHE ONLY." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DUAL" edc:desc="PCHE ICache and DCache. CPU opcodes go to PCEHE ICache port and data goes to PCHE" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="BOOTISA" edc:desc="Boot and exception code mode" edc:mask="0x1" edc:name="BOOTISA" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="MIPS32" edc:desc="Boot code and Exception code is MIPS32" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MICROMIPS" edc:desc="Boot code and Exception code is microMIPS" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1b"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:AltConfigFuseSector edc:beginaddr="0x1FC55E88" edc:endaddr="0x1FC55EB4" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="altConfig" edc:regionidref="config" edc:registerprefix="A">
      <edc:DCRDef edc:_addr="0x1FC55E88" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="AFUSERID" edc:default="0x0000FFFF" edc:desc="" edc:factorydefault="0x0000FFFF" edc:impl="0xffff" edc:name="AFUSERID" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x0000FFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="USERID" edc:desc="User ID" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="0x10"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC55E8C" edc:access="-n-nnnnnnnnnn-----------nnnnnnnn" edc:cname="ADEVCFG4" edc:default="0x04180000" edc:desc="" edc:factorydefault="0x4180000" edc:impl="0x5ff800ff" edc:name="ADEVCFG4" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x5FF800FF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SOSCCFG" edc:desc="SOSC Configuration Bits" edc:mask="0xff" edc:name="SOSCCFG" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:DCRFieldDef edc:cname="VBZPBOREN" edc:desc="VBAT Zero-Power BOR Enable bit" edc:mask="0x1" edc:name="VBZPBOREN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSZPBOREN" edc:desc="Deep Sleep Zero-Power BOR Enable bit" edc:mask="0x1" edc:name="DSZPBOREN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTPS" edc:desc="Deep Sleep Watchdog Timer Postscaler" edc:mask="0x1f" edc:name="DSWDTPS" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="DSPS1" edc:desc="1:2^5" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DSPS2" edc:desc="1:2^6" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DSPS3" edc:desc="1:2^7" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DSPS4" edc:desc="1:2^8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DSPS5" edc:desc="1:2^9" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DSPS6" edc:desc="1:2^10" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DSPS7" edc:desc="1:2^11" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DSPS8" edc:desc="1:2^12" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="DSPS9" edc:desc="1:2^13" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="DSPS10" edc:desc="1:2^14" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="DSPS11" edc:desc="1:2^15" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="DSPS12" edc:desc="1:2^16" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="DSPS13" edc:desc="1:2^17" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="DSPS14" edc:desc="1:2^18" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="DSPS15" edc:desc="1:2^19" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="DSPS16" edc:desc="1:2^20" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="DSPS17" edc:desc="1:2^21" edc:when="(field &amp; 0x1f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="DSPS18" edc:desc="1:2^22" edc:when="(field &amp; 0x1f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="DSPS19" edc:desc="1:2^23" edc:when="(field &amp; 0x1f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="DSPS20" edc:desc="1:2^24" edc:when="(field &amp; 0x1f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="DSPS21" edc:desc="1:2^25" edc:when="(field &amp; 0x1f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="DSPS22" edc:desc="1:2^26" edc:when="(field &amp; 0x1f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="DSPS23" edc:desc="1:2^27" edc:when="(field &amp; 0x1f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="DSPS24" edc:desc="1:2^28" edc:when="(field &amp; 0x1f) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="DSPS25" edc:desc="1:2^29" edc:when="(field &amp; 0x1f) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="DSPS26" edc:desc="1:2^30" edc:when="(field &amp; 0x1f) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="DSPS27" edc:desc="1:2^31" edc:when="(field &amp; 0x1f) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="DSPS28" edc:desc="1:2^32" edc:when="(field &amp; 0x1f) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="DSPS29" edc:desc="1:2^33" edc:when="(field &amp; 0x1f) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="DSPS30" edc:desc="1:2^34" edc:when="(field &amp; 0x1f) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="DSPS31" edc:desc="1:2^35" edc:when="(field &amp; 0x1f) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="DSPS32" edc:desc="1:2^36" edc:when="(field &amp; 0x1f) == 0x1f"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTOSC" edc:desc="Deep Sleep WDT Reference Clock Selection" edc:mask="0x1" edc:name="DSWDTOSC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Select SOSC as DSWDT Reference Clock" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Select LPRC as DSWDT Reference Clock" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTEN" edc:desc="Deep Sleep Watchdog Timer Enable" edc:mask="0x1" edc:name="DSWDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSEN" edc:desc="Deep Sleep Enable" edc:mask="0x1" edc:name="DSEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="SOSCEN" edc:desc="Secondary Oscillator Enable" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
