Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:DCRDef edc:_addr="0x1FC55E90" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn--nnn---" edc:cname="ADEVCFG2" edc:default="0x37FFE30" edc:desc="" edc:factorydefault="0x7F7FFF30" edc:impl="0xffffff38" edc:name="ADEVCFG2" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xFFFFFF38">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:DCRFieldDef edc:cname="DMTINTV" edc:desc="DMT Count Window Interval" edc:mask="0x7" edc:name="DMTINTV" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="WIN_0" edc:desc="Window/Interval value is zero" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WIN_1_2" edc:desc="Window/Interval value is 1/2 counter value" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WIN_3_4" edc:desc="Window/Interval value is 3/4 counter value" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WIN_7_8" edc:desc="Window/Interval value is 7/8 counter value" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WIN_15_16" edc:desc="Window/Interval value is 15/16 counter value" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WIN_31_32" edc:desc="Window/Interval value is 31/32 counter value" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WIN_63_64" edc:desc="Window/Interval value is 63/64 counter value" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WIN_127_128" edc:desc="Window/Interval value is 127/128 counter value" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:DCRFieldDef edc:cname="POSCMOD" edc:desc="Primary Oscillator Configuration" edc:mask="0x3" edc:name="POSCMOD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Primary oscillator disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS oscillator mode selected" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTRMCS" edc:desc="WDT Run mode clock selection" edc:mask="0x3" edc:name="WDTRMCS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="LPRC used as WDT run mode clock source" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PBCLK" edc:desc="Peripheral bus clock used as WDT run mode clock source" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SOSCSEL" edc:desc="Secondary Oscillator selection" edc:mask="0x1" edc:name="SOSCSEL" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="CRYSTAL" edc:desc="Crystal (SOSCI/SOSCO) mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIGITAL" edc:desc="Digital (SCLKI) mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WAKE2SPD" edc:desc="2 speed startup control for sleep mode" edc:mask="0x1" edc:name="WAKE2SPD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="the sys_clk will be from FRC until the selected clock is ready on wakeup" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="the sys_clk will be from the selected clock on wakeup" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CKSWEN" edc:desc="software clock switching enable" edc:mask="0x1" edc:name="CKSWEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Software Clock Switching Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Software Clock Switching Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FSCMEN" edc:desc="Fail safe clock monitor enabled" edc:mask="0x1" edc:name="FSCMEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="FSCM Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="FSCM Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTPS" edc:desc="Run mode watchdog timer postscaler" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PS65536" edc:desc="1:65536" edc:when="(field &amp; 0x17) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="PS131072" edc:desc="1:131072" edc:when="(field &amp; 0x17) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PS262144" edc:desc="1:262144" edc:when="(field &amp; 0x17) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="PS524288" edc:desc="1:524288" edc:when="(field &amp; 0x17) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="PS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x14) == 0x14"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTSPGM" edc:desc="Watchdog Timer Stop During Flash Programming" edc:mask="0x1" edc:name="WDTSPGM" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="RUN" edc:desc="WDT runs during Flash programming" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="STOP" edc:desc="WDT stops during Flash programming" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Watchdog Timer Window Mode" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="NORMAL" edc:desc="Watchdog Timer is in non-Window mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WINDOW" edc:desc="Watchdog Timer is in Window mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTEN" edc:desc="Watchdog Timer Enable bit" edc:mask="0x1" edc:name="WDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTWINSZ" edc:desc="Watchdog Timer Window Size" edc:mask="0x3" edc:name="WINSZ" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="WINSZ_25" edc:desc="Window size is 25%" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_37" edc:desc="Window size is 37.5%" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_50" edc:desc="Window size is 50%" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_75" edc:desc="Window size is 75%" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DMTCNT" edc:desc="Dead Man Timer Count Select bits" edc:mask="0x1f" edc:name="DMTCNT" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="DMT8" edc:desc="2^8 (256)" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DMT9" edc:desc="2^9 (512)" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DMT10" edc:desc="2^10 (1024)" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DMT11" edc:desc="2^11 (2048)" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DMT12" edc:desc="2^12 (4096)" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DMT13" edc:desc="2^13 (8192)" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DMT14" edc:desc="2^14 (16384)" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DMT15" edc:desc="2^15 (32768)" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="DMT16" edc:desc="2^16 (65536)" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="DMT17" edc:desc="2^17 (131072)" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="DMT18" edc:desc="2^18 (262144)" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="DMT19" edc:desc="2^19 (524288)" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="DMT20" edc:desc="2^20 (1048576)" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="DMT21" edc:desc="2^21 (2097152)" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="DMT22" edc:desc="2^22 (4194304)" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="DMT23" edc:desc="2^23 (8388608)" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="DMT24" edc:desc="2^24 (16777216)" edc:when="(field &amp; 0x1f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="DMT25" edc:desc="2^25 (33554432)" edc:when="(field &amp; 0x1f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="DMT26" edc:desc="2^26 (67108864)" edc:when="(field &amp; 0x1f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="DMT27" edc:desc="2^27 (134217728)" edc:when="(field &amp; 0x1f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="DMT28" edc:desc="2^28 (268435456)" edc:when="(field &amp; 0x1f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="DMT29" edc:desc="2^29 (536870912)" edc:when="(field &amp; 0x1f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="DMT30" edc:desc="2^30 (1073741824)" edc:when="(field &amp; 0x1f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="DMT31" edc:desc="2^31 (2147483648)" edc:when="(field &amp; 0x1f) == 0x17"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DMTEN" edc:desc="Deadman Timer Enable" edc:mask="0x1" edc:name="DMTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Deadman Timer is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Deadman Timer is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC55E94" edc:access="---nnnnnnnnnnnnnnnnnnnnn--nnn-nn" edc:cname="ADEVCFG1" edc:default="0x5C3B" edc:desc="" edc:factorydefault="0x1F005C3B" edc:impl="0x1fffff3b" edc:name="ADEVCFG1" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x1FFFFF3B">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Access Selection" edc:mask="0x3" edc:name="DEBUG" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="JTAG" edc:desc="4-wire JTAG I/F Enabled - EMUC/EMUD Disabled - ICD Module Disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="JTAG_ICD" edc:desc="4-wire JTAG I/F Enabled - EMUC/EMUD Disabled - ICD Module Enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="EMUC" edc:desc="EMUC/EMUD Enabled - 4-wire JTAG I/F Disabled - ICD Module Disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EMUC_ICD" edc:desc="EMUC/EMUD Enabled - 4-wire JTAG I/F Disabled - ICD Module Enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="ICESEL" edc:desc="EMUC/EMUD Communication Channel Select" edc:mask="0x3" edc:name="ICESEL" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="ICS_PGx1" edc:desc="ICE EMUC1/EMUD1 pins are shared with PGC1/PGD1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx2" edc:desc="ICE EMUC2/EMUD2 pins are shared with PGC2/PGD2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx3" edc:desc="ICE EMUC3/EMUD3 pins are shared with PGC3/PGD3" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx4" edc:desc="ICE EMUC4/EMUD4 pins are shared with PGC4/PGD4" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="TRCEN" edc:desc="Trace Enable" edc:mask="0x1" edc:name="TRCEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Trace features in the CPU are enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Trace features in the CPU are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:DCRFieldDef edc:cname="FMIIEN" edc:desc="Ethernet RMII/MII Enable" edc:mask="0x1" edc:name="FMIIEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RMII Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="MII Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ETHEXEREF" edc:desc="Exclusive Ethernet PYHY reference clock Enable" edc:mask="0x1" edc:name="ETHEXEREF" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PHY reference clock is made available on ETH EXCLK out" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="ETH CLK out will be used as PHY reference clock if needed" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CLASSBDIS" edc:desc="Disable CLASSB Device Functionality" edc:mask="0x1" edc:name="CLASSBDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ENABLE" edc:desc="CLASSB functions enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DISABLE" edc:desc="CLASSB functions disabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="USBIDIO" edc:desc="USB USBID Selection bit" edc:mask="0x1" edc:name="USBIDIO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USBID pin is controlled by the USB Module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USBID pin is controlled by the Port Function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="VBUSIO" edc:desc="USB VBUS_ON Selection bit" edc:mask="0x1" edc:name="VBUSIO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBUS_ON pin is controlled by the USB Module" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBUS_ON pin is controlled by the Port Function" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="HSSPIEN" edc:desc="SPI1 High Speed Mode Enable" edc:mask="0x1" edc:name="HSSPIEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="SPI1 is driven from/to dedicated pins, resulting in the highest interface speed" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="SPI1 is driven through PPS (I/O remap), resulting in a lower interface speed" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SMCLR" edc:desc="Selects CRU handling of MCLR Control" edc:mask="0x1" edc:name="SMCLR" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="MCLR_NORM" edc:desc="Legacy mode (system clear does not reset all state of device)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MCLR_POR" edc:desc="MCLR causes a faux POR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="HSUARTEN" edc:desc="UART1 High Speed Mode Enable" edc:mask="0x1" edc:name="HSUARTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="UART1 is driven from/to dedicated pins, resulting in the highest possible maximum baud rate" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="UART1 is driven through PPS (I/O remap), resulting in a lower maximum baud rate" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="USBDMTRIM" edc:desc="USB DM Rise/Fall Trim fuse bits" edc:mask="0xf" edc:name="USBDMTRIM" edc:nzwidth="0x4"/>
            <edc:DCRFieldDef edc:cname="USBDPTRIM" edc:desc="USB DP Rise/Fall Trim fuse bits" edc:mask="0xf" edc:name="USBDPTRIM" edc:nzwidth="0x4"/>
            <edc:DCRFieldDef edc:cname="WDTPSS" edc:desc="Watchdog Timer Post-scale Select Sleep bits" edc:mask="0x1f" edc:name="WDTPSS" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="PSS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x1f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="PSS524288" edc:desc="1:524288" edc:when="(field &amp; 0x1f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="PSS262144" edc:desc="1:262144" edc:when="(field &amp; 0x1f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="PSS131072" edc:desc="1:131072" edc:when="(field &amp; 0x1f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PSS65536" edc:desc="1:65536" edc:when="(field &amp; 0x1f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="PSS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PSS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PSS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PSS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PSS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PSS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PSS512" edc:desc="1:512" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PSS256" edc:desc="1:256" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PSS128" edc:desc="1:128" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PSS64" edc:desc="1:64" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PSS32" edc:desc="1:32" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PSS16" edc:desc="1:16" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PSS8" edc:desc="1:8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PSS4" edc:desc="1:4" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PSS2" edc:desc="1:2" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PSS1" edc:desc="1:1" edc:when="(field &amp; 0x1f) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
