Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:DCRDef edc:_addr="0x1FC55E98" edc:access="nnnnnnnnn-nn--nnnnnnnn-nnnn-nn-n" edc:cname="ADEVCFG0" edc:default="0x20800009" edc:desc="" edc:factorydefault="0x30800019" edc:impl="0xffb3fded" edc:name="ADEVCFG0" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffb3fdfd">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="TDOEN" edc:desc="TDO control for 2 wire JTAG protocol" edc:mask="0x1" edc:name="TDOEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="2-wire JTAG protocol uses TDO" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="2-wire JTAG protocol does not use TDO" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="TROEN" edc:desc="Trace clock control bit" edc:mask="0x1" edc:name="TROEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Start Trace Clock and enable Trace Outputs (Trace Probe must be present)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Stop Trace Clock and disable Trace Outputs" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG control bit" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG port enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG port disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FCPRI" edc:desc="Flash controller RAMa ccess priority" edc:mask="0x1" edc:name="FCPRI" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="HIGH" edc:desc="flash gets higher priority access to RAM" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LRSA" edc:desc="flash gets least recently used arbitration to RAM" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DMAPRI" edc:desc="DMA RAM access priority" edc:mask="0x1" edc:name="DMAPRI" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="HIGH" edc:desc="DMA gets High Priority access to SRAM" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LRSA" edc:desc="DMA gets least recently used arbitration to RAM" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EXLPRI" edc:desc="CPU RAM access priority" edc:mask="0x1" edc:name="EXLPRI" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="HIGH" edc:desc="CPU gets high priority access to RAM" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LRSA" edc:desc="CPU gets least recently used arbitration to RAM" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="USBSSEN" edc:desc="USB Suspend Sleep Enable" edc:mask="0x1" edc:name="USBSSEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USB FREF clock is shut down when suspend mode is active" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USB FREF clock continues to run when suspend mode is active" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="PMULOCK" edc:desc="PMU Controller Register LOCK" edc:mask="0x1" edc:name="PMULOCK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PMU SFR bits are locked and cannot be modified" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PMU SFR bits are not locked and can be modified" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PGLOCK" edc:desc="Permission Group LOCK" edc:mask="0x1" edc:name="PGLOCK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="CFGPG SFR bits are locked and cannot be modified" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="CFGPG SFR bits are not locked and can be modified" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PMDLOCK" edc:desc="Peripheral Module Disable (PMD) LOCK" edc:mask="0x1" edc:name="PMDLOCK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PMDx SFR bits are locked and cannot be modified" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PMDx SFR bits are not locked and can be modified" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOLOCK" edc:desc="IO LOCK" edc:mask="0x1" edc:name="IOLOCK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="IO Remap SFR bits are locked and cannot be modified" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="IO Remap SFR are not locked and can be modified" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CFGLOCK" edc:desc="Configuration Register Lock" edc:mask="0x3" edc:name="CFGLOCK" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="All NVR memory self-writes, BCFG0 and System Config registers, are not locked and can be written - CFGLOCK value can be changed" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON_W" edc:desc="All NVR memory self-writes, BCFG0 and System Config registers, are locked and can not be written - CFGLOCK value can be changed" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="All NVR memory self-writes, BCFG0 and System Config registers, are locked and can not be written - CFGLOCK value can not be changed" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OC_ACLK" edc:desc="OCMP Alternate Clock Selection" edc:mask="0x1" edc:name="OC_ACLK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OCMP_ALT_TMR" edc:desc="OCMP module use an alternative TMR pair as their timebase clock" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OCMP_TMR2_TMR3" edc:desc="All OCMP Modules use TMR2/TMR3 as their timebase clock" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IC_ACLK" edc:desc="ICAP Alternate Clock Selection" edc:mask="0x1" edc:name="IC_ACLK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ICAP_ALT_TMR" edc:desc="ICAP module use an alternative TMR pair as their timebase clock" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ICAP_TMR2_TMR3" edc:desc="All ICAP Modules use TMR2/TMR3 as their timebase clock" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:DCRFieldDef edc:cname="CANFDDIV" edc:desc="CAN-FD divider control" edc:mask="0x3" edc:name="CANFDDIV" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="PCM" edc:desc="P-Cache cache-ability control" edc:mask="0x1" edc:name="PCM" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="CPU" edc:desc="PCHE cache-ability is controlled by CPU" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="SFR" edc:desc="PCHE cache-ability is controled by SFR" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="UPLLHWMD" edc:desc="UPLL HW Control Mode for power down and RESET" edc:mask="0x1" edc:name="UPLLHWMD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="UPLL PWDN and RESET are generated by HW" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="UPLL PWDN and RESET are generated by SW using corresponding PLLCON register bits" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SPLLHWMD" edc:desc="SPLL HW Control Mode for power down and RESET" edc:mask="0x1" edc:name="SPLLHWMD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="SPLL PWDN and RESET are generated by HW" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="SPLL PWDN and RESET are generated by SW using corresponding PLLCON register bits" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BTPLLHWMD" edc:desc="BTPLL HW Control Mode for power down and RESET" edc:mask="0x1" edc:name="BTPLLHWMD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="BTPLL PWDN and RESET are generated by HW" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="BTPLL PWDN and RESET are generated by SW using corresponding PLLCON register bits" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ETHPLLHWMD" edc:desc="Ethernet PLL HW Control Mode for power down and RESET" edc:mask="0x1" edc:name="ETHPLLHWMD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="ETHPLL PWDN and RESET are generated by HW" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="ETHPLL PWDN and RESET are generated by SW using corresponding PLLCON register bits" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FECCCON" edc:desc="Dynamic Flash ECC Configuration" edc:mask="0x3" edc:name="FECCCON" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Flash ECC is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DYNAMIC" edc:desc="Dynamic Flash ECC is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="ECC and Dynamic ECC are disabled" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ETHTPSF" edc:desc="Ethernet Tx SOF control for CTR measurements" edc:mask="0x1" edc:name="ETHTPSF" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="TPSF" edc:desc="TPSF is enabled in CTR measurement" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="RPSF" edc:desc="RPSF is enabled in CTR measurement" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="EPGMCLK" edc:desc="External Programming Clock enable" edc:mask="0x1" edc:name="EPGMCLK" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="TSTFRC" edc:desc="In ICSP (TMOD0) mode, enable the FRC clock to be driven by the TSTFRC Pin Function" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="In ICSP (TMOD0) mode, the FRC clock is always driven by the FRC oscillator" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
