Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:DCRDef edc:_addr="0x1FC55E9C" edc:access="----------------------------n-nn" edc:cname="AFBCFG0" edc:default="0x9" edc:desc="FBCFG0" edc:factorydefault="0x8" edc:impl="0xb" edc:name="AFBCFG0" edc:nzwidth="32" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x8000000B">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BUHSWEN" edc:desc="Buck mode switching control" edc:mask="0x1" edc:name="BUHSWEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Buck mode is switched in HW at POR before CPU is allowed to boot" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Buck switching is disabled in HW at POR. Enable from SW" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PCSCMODE" edc:desc="PCache Single cache Mode" edc:mask="0x1" edc:name="PCSCMODE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SINGLE" edc:desc="PCHE ICache Only.CPU Instructions (code, data) go to PCHE ONLY." edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DUAL" edc:desc="PCHE ICache and DCache. CPU opcodes go to PCEHE ICache port and data goes to PCHE" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="BOOTISA" edc:desc="Boot and exception code mode" edc:mask="0x1" edc:name="BOOTISA" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="MIPS32" edc:desc="Boot code and Exception code is MIPS32" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MICROMIPS" edc:desc="Boot code and Exception code is microMIPS" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x1b"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:AltConfigFuseSector>
    <edc:BootConfigSector edc:beginaddr="0x1FC16000" edc:endaddr="0x1FC17000" edc:isotp="true" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="1" edc:regionid="otpmemory"/>
    <edc:SFRDataSector edc:beginaddr="0x1F800000" edc:endaddr="0x1F800070" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="configSfr0">
      <edc:SFRDef edc:_addr="0x1F800000" edc:access="nnnnnnnnn-nn--nnnnnnnn-nnnn-nn-n" edc:cname="CFGCON0" edc:desc="" edc:impl="0xffb3fded" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqqqqq-qq--qqqqqqqq-qqqq-qq-q" edc:name="CFGCON0" edc:nzwidth="32" edc:por="qqqqqqqqq-qq--qqqqqqqq-qqqq-qq-q" edc:portals="- - -">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TDOEN" edc:desc="TDO control for 2 wire JTAG protocol" edc:mask="0x1" edc:name="TDOEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TROEN" edc:desc="Trace clock control bit" edc:mask="0x1" edc:name="TROEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="JTAGEN" edc:desc="JTAG control bit" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FCPRI" edc:mask="0x1" edc:name="FCPRI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAPRI" edc:mask="0x1" edc:name="DMAPRI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXLPRI" edc:mask="0x1" edc:name="EXLPRI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBSSEN" edc:mask="0x1" edc:name="USBSSEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PMULOCK" edc:mask="0x1" edc:name="PMULOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGLOCK" edc:mask="0x1" edc:name="PGLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMDLOCK" edc:mask="0x1" edc:name="PMDLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IOLOCK" edc:mask="0x1" edc:name="IOLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGLOCK" edc:mask="0x3" edc:name="CFGLOCK" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="OC_ACLK" edc:mask="0x1" edc:name="OC_ACLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC_ACLK" edc:mask="0x1" edc:name="IC_ACLK" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CANFDDIV" edc:desc="CAN-FD divider control" edc:mask="0x3" edc:name="CANFDDIV" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PCM" edc:mask="0x1" edc:name="PCM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPLLHWMD" edc:mask="0x1" edc:name="UPLLHWMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLHWMD" edc:mask="0x1" edc:name="SPLLHWMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTPLLHWMD" edc:mask="0x1" edc:name="BTPLLHWMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETHPLLHWMD" edc:mask="0x1" edc:name="ETHPLLHWMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FECCCON" edc:mask="0x3" edc:name="FECCCON" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ETHTPSF" edc:mask="0x1" edc:name="ETHTPSF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPGMCLK" edc:mask="0x1" edc:name="EPGMCLK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800010" edc:access="---nnnnnnnnnnnnnnnnnnnnn--nnn-nn" edc:cname="CFGCON1" edc:desc="" edc:impl="0x1fffff3b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---qqqqqqqqqqqqqqqqqqqqq--qqq-qq" edc:name="CFGCON1" edc:nzwidth="32" edc:por="---qqqqqqqqqqqqqqqqqqqqq--qqq-qq" edc:portals="- - -">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEBUG" edc:mask="0x3" edc:name="DEBUG" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICESEL" edc:mask="0x3" edc:name="ICESEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRCEN" edc:mask="0x1" edc:name="TRCEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FMIIEN" edc:mask="0x1" edc:name="FMIIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETHEXEREF" edc:mask="0x1" edc:name="ETHEXEREF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLASSBDIS" edc:mask="0x1" edc:name="CLASSBDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBIDIO" edc:mask="0x1" edc:name="USBIDIO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VBUSIO" edc:mask="0x1" edc:name="VBUSIO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSSPIEN" edc:mask="0x1" edc:name="HSSPIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMCLR" edc:mask="0x1" edc:name="SMCLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSUARTEN" edc:mask="0x1" edc:name="HSUARTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBDMTRIM" edc:mask="0xf" edc:name="USBDMTRIM" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="USBDPTRIM" edc:mask="0xf" edc:name="USBDPTRIM" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="WDTPS" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800020" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn--nnn---" edc:cname="CFGCON2" edc:desc="" edc:impl="0xffffff38" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqqqqqqqqqqqqqqqqqqqq--qqq---" edc:name="CFGCON2" edc:nzwidth="32" edc:por="qqqqqqqqqqqqqqqqqqqqqqqq--qqq---" edc:portals="- - -">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMTINTV" edc:mask="0x7" edc:name="DMTINTV" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="POSCMOD" edc:mask="0x3" edc:name="POSCMOD" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTRMCS" edc:mask="0x3" edc:name="WDTRMCS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SOSCSEL" edc:mask="0x1" edc:name="SOSCSEL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKE2SPD" edc:mask="0x1" edc:name="WAKE2SPD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKSWEN" edc:mask="0x1" edc:name="CKSWEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSCMEN" edc:mask="0x1" edc:name="FSCMEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTPS" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="WDTSPGM" edc:mask="0x1" edc:name="WDTSPGM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINDIS" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTEN" edc:mask="0x1" edc:name="WDTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTWINSZ" edc:mask="0x3" edc:name="WDTWINSZ" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DMTCNT" edc:mask="0x1f" edc:name="DMTCNT" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="DMTEN" edc:mask="0x1" edc:name="DMTEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800030" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:cname="CFGCON3" edc:desc="" edc:impl="0x3ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------qqqqqqqqqqqqqqqqqq" edc:name="CFGCON3" edc:nzwidth="32" edc:por="--------------qqqqqqqqqqqqqqqqqq" edc:portals="- - -">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ETHPLLPOSTDIV2" edc:mask="0x3f" edc:name="ETHPLLPOSTDIV2" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SPLLPOSTDIV2" edc:mask="0x3f" edc:name="SPLLPOSTDIV2" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="BTPLLPOSTDIV2" edc:mask="0x3f" edc:name="BTPLLPOSTDIV2" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
