Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F800040" edc:access="-n-nnnnnnnnnn-----------nnnnnnnn" edc:cname="CFGCON4" edc:desc="" edc:impl="0x5ff800ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-q-qqqqqqqqqq-----------qqqqqqqq" edc:name="CFGCON4" edc:nzwidth="32" edc:por="-q-qqqqqqqqqq-----------qqqqqqqq" edc:portals="- - -">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SOSCCFG" edc:mask="0xff" edc:name="SOSCCFG" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="VBZPBOREN" edc:mask="0x1" edc:name="VBZPBOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSZPBOREN" edc:mask="0x1" edc:name="DSZPBOREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSWDTPS" edc:mask="0x1f" edc:name="DSWDTPS" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="DSWDTOSC" edc:mask="0x1" edc:name="DSWDTOSC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSWDTEN" edc:mask="0x1" edc:name="DSWDTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSEN" edc:mask="0x1" edc:name="DSEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SOSCEN" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800050" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFGPG" edc:desc="" edc:impl="0xffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------qqqqqqqqqqqqqqqqqqqqqqqq" edc:name="CFGPG" edc:nzwidth="32" edc:por="--------qqqqqqqqqqqqqqqqqqqqqqqq" edc:portals="- - -">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CPUPG" edc:mask="0x3" edc:name="CPUPG" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FCPG" edc:mask="0x3" edc:name="FCPG" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DMAPG" edc:mask="0x3" edc:name="DMAPG" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ICDJPG" edc:mask="0x3" edc:name="ICDJPG" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="WIFIPG" edc:mask="0x3" edc:name="WIFIPG" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADCPG" edc:mask="0x3" edc:name="ADCPG" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CAN1PG" edc:mask="0x3" edc:name="CAN1PG" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CAN2PG" edc:mask="0x3" edc:name="CAN2PG" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CRY1PG" edc:mask="0x3" edc:name="CRY1PG" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ETHPG" edc:mask="0x3" edc:name="ETHPG" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SQIPG" edc:mask="0x3" edc:name="SQIPG" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="USBPG" edc:mask="0x3" edc:name="USBPG" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800060" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVID" edc:desc="" edc:impl="0xfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq" edc:name="DEVID" edc:nzwidth="32" edc:por="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq" edc:portals="- - -">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEVID" edc:mask="0xfffffff" edc:name="DEVID" edc:nzwidth="0x1c"/>
            <edc:SFRFieldDef edc:cname="VER" edc:desc="" edc:mask="0xf" edc:name="VER" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1F800070" edc:endaddr="0x1F800500" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="configSfr1">
      <edc:SFRDef edc:_addr="0x1F800070" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="USERID" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------uuuuuuuuuuuuuuuu" edc:name="USERID" edc:nzwidth="32" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="- - -">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USERID" edc:desc="USER ID" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800080" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SYSKEY" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="SYSKEY" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SYSKEY" edc:mask="0xffffffff" edc:name="SYSKEY" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800090" edc:access="--n--n-nn---n--nn---n--nn------n" edc:cname="PMD1" edc:desc="" edc:impl="0x25898981" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u--u-uu---u--uu---u--uu------u" edc:name="PMD1" edc:nzwidth="32" edc:por="--x--x-xx---x--xx---x--xx------x" edc:portals="- - -">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCSAR0MD" edc:mask="0x1" edc:name="ADCSAR0MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCSARSHRMD" edc:mask="0x1" edc:name="ADCSARSHRMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1MD" edc:mask="0x1" edc:name="ADC1MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PTGMD" edc:mask="0x1" edc:name="PTGMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CVD1MD" edc:mask="0x1" edc:name="CVD1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCC1MD" edc:mask="0x1" edc:name="RTCC1MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DMA1MD" edc:mask="0x1" edc:name="DMA1MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BA414MD" edc:mask="0x1" edc:name="BA414MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRYPT1MD" edc:mask="0x1" edc:name="CRYPT1MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RNG1MD" edc:mask="0x1" edc:name="RNG1MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SQI1MD" edc:mask="0x1" edc:name="SQI1MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8000A0" edc:access="nnnn-----nnnnnnn----nnnn----nnnn" edc:cname="PMD2" edc:desc="" edc:impl="0xf07f0f0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu-----uuuuuuu----uuuu----uuuu" edc:name="PMD2" edc:nzwidth="32" edc:por="xxxx-----xxxxxxx----xxxx----xxxx" edc:portals="- - -">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC1MD" edc:mask="0x1" edc:name="IC1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC2MD" edc:mask="0x1" edc:name="IC2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC3MD" edc:mask="0x1" edc:name="IC3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC4MD" edc:mask="0x1" edc:name="IC4MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="OC1MD" edc:mask="0x1" edc:name="OC1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC2MD" edc:mask="0x1" edc:name="OC2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC3MD" edc:mask="0x1" edc:name="OC3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC4MD" edc:mask="0x1" edc:name="OC4MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="T1MD" edc:mask="0x1" edc:name="T1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T2MD" edc:mask="0x1" edc:name="T2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T3MD" edc:mask="0x1" edc:name="T3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T4MD" edc:mask="0x1" edc:name="T4MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T5MD" edc:mask="0x1" edc:name="T5MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T6MD" edc:mask="0x1" edc:name="T6MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="T7MD" edc:mask="0x1" edc:name="T7MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="REFO1MD" edc:mask="0x1" edc:name="REFO1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFO2MD" edc:mask="0x1" edc:name="REFO2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFO3MD" edc:mask="0x1" edc:name="REFO3MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFO4MD" edc:mask="0x1" edc:name="REFO4MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8000B0" edc:access="---nn--n------nn---n--nn---n-nnn" edc:cname="PMD3" edc:desc="" edc:impl="0x19031317" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uu--u------uu---u--uu---u-uuu" edc:name="PMD3" edc:nzwidth="32" edc:por="---xx--x------xx---x--xx---x-xxx" edc:portals="- - -">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1MD" edc:mask="0x1" edc:name="U1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2MD" edc:mask="0x1" edc:name="U2MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3MD" edc:mask="0x1" edc:name="U3MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ETH1MD" edc:mask="0x1" edc:name="ETH1MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SPI1MD" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI2MD" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="W24GMD" edc:mask="0x1" edc:name="W24GMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="I2C1MD" edc:mask="0x1" edc:name="I2C1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2MD" edc:mask="0x1" edc:name="I2C2MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="USB1MD" edc:mask="0x1" edc:name="USB1MD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CAN1MD" edc:mask="0x1" edc:name="CAN1MD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN2MD" edc:mask="0x1" edc:name="CAN2MD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
