Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:AdjustPoint edc:_addr="0x1F8000C0" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x1F800100" edc:access="r-rr------------------------r-rr" edc:cname="BCFG0" edc:desc="" edc:impl="0xb000000b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="q-qq------------------------q-qq" edc:name="BCFG0" edc:nzwidth="32" edc:por="q-qq------------------------q-qq">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BUHSW" edc:mask="0x1" edc:name="BUHSW" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PCSCMODE" edc:mask="0x1" edc:name="PCSCMODE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BOOTISA" edc:mask="0x1" edc:name="BOOTISA" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="CP" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIGN" edc:mask="0x1" edc:name="SIGN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BINFOVALID0" edc:mask="0x1" edc:name="BINFOVALID0" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1F800500" edc:endaddr="0x1F803000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb1a">
      <edc:AdjustPoint edc:_addr="0x1F800500" edc:offset="0x100"/>
      <edc:SFRDef edc:_addr="0x1F800600" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="----------------nnnn---n----nnnn" edc:cname="NVMCON" edc:desc="" edc:grp="NVM" edc:impl="0xfffff73f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000---0----0000" edc:name="NVMCON" edc:nzwidth="0x20" edc:por="----------------0000---0----0000" edc:portals="CLR SET INV" ltx:baseofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMOP" edc:desc="" edc:mask="0xf" edc:name="NVMOP" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="HTDPGM" edc:mask="0x1" edc:name="HTDPGM" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LVDERR" edc:desc="" edc:mask="0x1" edc:name="LVDERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800610" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="nnnn-------nnnnn-nnn--nnnn-----n" edc:cname="NVMCON2" edc:desc="" edc:impl="0xf01f73c1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-------11111-x00--0000-----0" edc:name="NVMCON2" edc:nzwidth="32" edc:por="0000-------11111-x00--0000-----0" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PREPG" edc:mask="0x1" edc:name="PREPG" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWAPLK" edc:mask="0x3" edc:name="SWAPLK" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RETRY" edc:mask="0x3" edc:name="RETRY" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREAD1" edc:mask="0x1" edc:name="VREAD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CREAD1" edc:mask="0x1" edc:name="CREAD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEMP" edc:mask="0x1" edc:name="TEMP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="WS" edc:mask="0x1f" edc:name="WS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SLEEP" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ERS" edc:mask="0xf" edc:name="ERS" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800620" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="NVMKEY" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMKEY" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMKEY" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMKEY" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800630" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMADDR" edc:desc="" edc:grp="NVM" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMADDR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMADDR" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMADDR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800640" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA0" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA0" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA0" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800650" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA1" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA1" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
