Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F800660" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA2" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA2" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA2" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800670" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA3" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA3" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA3" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA3" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800680" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA4" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA4" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA4" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800690" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA5" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA5" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA5" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA5" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8006A0" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA6" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA6" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA6" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA6" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8006B0" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA7" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA7" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA7" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA7" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8006C0" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMSRCADDR" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMSRCADDR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMSRCADDR" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMSRCADDR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8006D0" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="r-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWPLT" edc:desc="" edc:impl="0x80ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------000000000000000000000000" edc:name="NVMPWPLT" edc:nzwidth="32" edc:por="1-------000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PWPLT" edc:desc="" edc:mask="0xffffff" edc:name="PWPLT" edc:nzwidth="24"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:desc="" edc:mask="0x1" edc:name="ULOCK" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8006E0" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="r-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMPWPGTE" edc:desc="" edc:impl="0x80ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------111111111111111111111111" edc:name="NVMPWPGTE" edc:nzwidth="32" edc:por="1-------111111111111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PWPGTE" edc:desc="" edc:mask="0xffffff" edc:name="PWPGTE" edc:nzwidth="24"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:desc="" edc:mask="0x1" edc:name="ULOCK" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
