Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8006F0" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="r-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMLBWP" edc:desc="" edc:impl="0x80ffff8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------111111111111111111111111" edc:name="NVMLBWP" edc:nzwidth="32" edc:por="1-------111111111111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LBWP0" edc:mask="0x1" edc:name="LBWP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP1" edc:mask="0x1" edc:name="LBWP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP2" edc:mask="0x1" edc:name="LBWP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP3" edc:mask="0x1" edc:name="LBWP3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP4" edc:mask="0x1" edc:name="LBWP4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP5" edc:mask="0x1" edc:name="LBWP5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP6" edc:mask="0x1" edc:name="LBWP6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP7" edc:mask="0x1" edc:name="LBWP7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP8" edc:mask="0x1" edc:name="LBWP8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP9" edc:mask="0x1" edc:name="LBWP9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP10" edc:mask="0x1" edc:name="LBWP10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP11" edc:mask="0x1" edc:name="LBWP11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP12" edc:mask="0x1" edc:name="LBWP12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP13" edc:mask="0x1" edc:name="LBWP13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP14" edc:mask="0x1" edc:name="LBWP14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP15" edc:mask="0x1" edc:name="LBWP15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP16" edc:mask="0x1" edc:name="LBWP16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP17" edc:mask="0x1" edc:name="LBWP17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP18" edc:mask="0x1" edc:name="LBWP18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP19" edc:mask="0x1" edc:name="LBWP19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP20" edc:mask="0x1" edc:name="LBWP20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP21" edc:mask="0x1" edc:name="LBWP21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP22" edc:mask="0x1" edc:name="LBWP22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LBWP23" edc:mask="0x1" edc:name="LBWP23" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:mask="0x1" edc:name="ULOCK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800700" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03140_pfm_ctrl_32bit_upb_v4.Module.Module" edc:_refcount="1" edc:access="r-------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMUBWP" edc:desc="" edc:impl="0x80ffff8f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------111111111111111111111111" edc:name="NVMUBWP" edc:nzwidth="32" edc:por="1-------111111111111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UBWP0" edc:mask="0x1" edc:name="UBWP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP1" edc:mask="0x1" edc:name="UBWP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP2" edc:mask="0x1" edc:name="UBWP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP3" edc:mask="0x1" edc:name="UBWP3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP4" edc:mask="0x1" edc:name="UBWP4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP5" edc:mask="0x1" edc:name="UBWP5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP6" edc:mask="0x1" edc:name="UBWP6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP7" edc:mask="0x1" edc:name="UBWP7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP8" edc:mask="0x1" edc:name="UBWP8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP9" edc:mask="0x1" edc:name="UBWP9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP10" edc:mask="0x1" edc:name="UBWP10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP11" edc:mask="0x1" edc:name="UBWP11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP12" edc:mask="0x1" edc:name="UBWP12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP13" edc:mask="0x1" edc:name="UBWP13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP14" edc:mask="0x1" edc:name="UBWP14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP15" edc:mask="0x1" edc:name="UBWP15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP16" edc:mask="0x1" edc:name="UBWP16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP17" edc:mask="0x1" edc:name="UBWP17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP18" edc:mask="0x1" edc:name="UBWP18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP19" edc:mask="0x1" edc:name="UBWP19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP20" edc:mask="0x1" edc:name="UBWP20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP21" edc:mask="0x1" edc:name="UBWP21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP22" edc:mask="0x1" edc:name="UBWP22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UBWP23" edc:mask="0x1" edc:name="UBWP23" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:mask="0x1" edc:name="ULOCK" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800710" edc:offset="0xf0"/>
      <edc:SFRDef edc:_addr="0x1F800800" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-02674_wdt_upb_v1_32bit.Module" edc:_refcount="1" edc:access="wwwwwwwwwwwwwwwwn--rrrrrrrrrrrrn" edc:cname="WDTCON" edc:desc="" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000x--xxxxxxxxxxxx0" edc:name="WDTCON" edc:nzwidth="32" edc:por="0000000000000000x--xxxxxxxxxxxx0" edc:portals="CLR SET INV" ltx:baseofperipheral="WDT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDTWINEN" edc:desc="" edc:mask="0x1" edc:name="WDTWINEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPDIV" edc:desc="" edc:mask="0x1f" edc:name="SLPDIV" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x3" edc:name="CLKSEL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RUNDIV" edc:desc="" edc:mask="0x1f" edc:name="RUNDIV" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTCLRKEY" edc:desc="" edc:mask="0xffff" edc:name="WDTCLRKEY" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800810" edc:offset="0x1f0"/>
      <edc:SFRDef edc:_addr="0x1F800A00" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:access="----------------n---------------" edc:cname="DMTCON" edc:desc="" edc:impl="0x8000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---------------" edc:name="DMTCON" edc:nzwidth="32" edc:por="----------------0---------------" edc:portals="- - -" ltx:baseofperipheral="DMT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="15"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A10" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnn--------" edc:cname="DMTPRECLR" edc:desc="" edc:impl="0xff00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00000000--------" edc:name="DMTPRECLR" edc:nzwidth="32" edc:por="----------------00000000--------" edc:portals="- - -" ltx:memberofperipheral="DMT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="STEP1" edc:desc="" edc:mask="0xff" edc:name="STEP1" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A20" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="DMTCLR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="DMTCLR" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="- - -" ltx:memberofperipheral="DMT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP2" edc:desc="" edc:mask="0xff" edc:name="STEP2" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
