Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F800A30" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:access="------------------------rrr----r" edc:cname="DMTSTAT" edc:desc="" edc:impl="0xe1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------000----0" edc:name="DMTSTAT" edc:nzwidth="32" edc:por="------------------------000----0" edc:portals="- - -" ltx:memberofperipheral="DMT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WINOPN" edc:desc="" edc:mask="0x1" edc:name="WINOPN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DMTEVENT" edc:desc="" edc:mask="0x1" edc:name="DMTEVENT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BAD" edc:desc="" edc:mask="0x3" edc:name="BAD" edc:nzwidth="2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="BAD2" edc:desc="" edc:mask="0x1" edc:name="BAD2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BAD1" edc:desc="" edc:mask="0x1" edc:name="BAD1" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A40" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DMTCNT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DMTCNT" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="- - -" ltx:memberofperipheral="DMT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COUNTER" edc:desc="" edc:mask="0xffffffff" edc:name="COUNTER" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A50" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="DMTHOLDREG" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DMTHOLDREG" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="- - -" ltx:memberofperipheral="DMT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UPRCNT" edc:desc="" edc:mask="0xffff" edc:name="UPRCNT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A60" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DMTPSCNT" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DMTPSCNT" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="DMT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PSCNT" edc:desc="" edc:mask="0xffffffff" edc:name="PSCNT" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A70" edc:_begin="0x0" edc:_end="0x80" edc:_modsrc="DOS-01520_wdt_dmt_upb_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DMTPSINTV" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DMTPSINTV" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="DMT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PSINTV" edc:desc="" edc:mask="0xffffffff" edc:name="PSINTV" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800A80" edc:offset="0x780"/>
      <edc:SFRDef edc:_addr="0x1F801200" edc:access="-----nnnn-n-----rrrrnnnnn--nnnnn" edc:cname="OSCCON" edc:desc="" edc:impl="0x7a0ff9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0000-u-----0000xxxx0--000x0" edc:name="OSCCON" edc:nzwidth="32" edc:por="-----0000-x-----0000xxxx0--000x0" edc:portals="CLR SET INV" ltx:baseofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OSWEN" edc:desc="" edc:mask="0x1" edc:name="OSWEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SOSCEN" edc:desc="" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UFRCEN" edc:desc="" edc:mask="0x1" edc:name="UFRCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="" edc:mask="0x1" edc:name="SLPEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="CLKLOCK" edc:desc="" edc:mask="0x1" edc:name="CLKLOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="NOSC" edc:desc="" edc:mask="0xf" edc:name="NOSC" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="COSC" edc:desc="" edc:mask="0xf" edc:name="COSC" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="WAKE2SPD" edc:mask="0x1" edc:name="WAKE2SPD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DRMEN" edc:desc="" edc:mask="0x1" edc:name="DRMEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRCDIV" edc:desc="" edc:mask="0x7" edc:name="FRCDIV" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801210" edc:access="--------------------------nnnnnn" edc:cname="OSCTUN" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000000" edc:name="OSCTUN" edc:nzwidth="32" edc:por="--------------------------000000" edc:portals="CLR SET INV" ltx:baseofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TUN" edc:desc="" edc:mask="0x3f" edc:name="TUN" edc:nzwidth="6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801220" edc:access="nnn-nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPLLCON" edc:desc="" edc:impl="0xefffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-uuuuuuuuuuuuuuuuuuuuuuuuuxxx" edc:name="SPLLCON" edc:nzwidth="32" edc:por="xxx-xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPLLBSWSEL" edc:desc="" edc:mask="0x7" edc:name="SPLLBSWSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="SPLLPWDN" edc:mask="0x1" edc:name="SPLLPWDN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLPOSTDIV1" edc:mask="0x3f" edc:name="SPLLPOSTDIV1" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SPLLFLOCK" edc:mask="0x1" edc:name="SPLLFLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLRST" edc:mask="0x1" edc:name="SPLLRST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLFBDIV" edc:mask="0x3ff" edc:name="SPLLFBDIV" edc:nzwidth="0xa"/>
            <edc:SFRFieldDef edc:cname="SPLLREFDIV" edc:mask="0x3f" edc:name="SPLLREFDIV" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLOCK" edc:mask="0x1" edc:name="SLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLICLK" edc:mask="0x1" edc:name="SPLLICLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLL_BYP" edc:mask="0x1" edc:name="SPLL_BYP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
