Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F801230" edc:access="n-n-nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="UPLLCON" edc:desc="" edc:impl="0xafffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u-u-uuuuuuuuuuuuuuuuuuuuuuuuuxxx" edc:name="UPLLCON" edc:nzwidth="32" edc:por="x-x-xxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UPLLBSWSEL" edc:desc="" edc:mask="0x7" edc:name="UPLLBSWSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="UPLLPWDN" edc:mask="0x1" edc:name="UPLLPWDN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPLLPOSTDIV1" edc:mask="0x3f" edc:name="UPLLPOSTDIV1" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="UPLLFLOCK" edc:mask="0x1" edc:name="UPLLFLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPLLRST" edc:mask="0x1" edc:name="UPLLRST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPLLFBDIV" edc:mask="0x3ff" edc:name="UPLLFBDIV" edc:nzwidth="0xa"/>
            <edc:SFRFieldDef edc:cname="UPLLREFDIV" edc:mask="0x3f" edc:name="UPLLREFDIV" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ULOCK" edc:mask="0x1" edc:name="ULOCK" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="UPLL_BYP" edc:mask="0x1" edc:name="UPLL_BYP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801240" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BTPLLCON" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuxxx" edc:name="BTPLLCON" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BTPLLBSWSEL" edc:desc="" edc:mask="0x7" edc:name="BTPLLBSWSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="BTPLLPWDN" edc:mask="0x1" edc:name="BTPLLPWDN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTPLLPOSTDIV1" edc:mask="0x3f" edc:name="BTPLLPOSTDIV1" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="BTPLLFLOCK" edc:mask="0x1" edc:name="BTPLLFLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTPLLRST" edc:mask="0x1" edc:name="BTPLLRST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTPLLFBDIV" edc:mask="0x3ff" edc:name="BTPLLFBDIV" edc:nzwidth="0xa"/>
            <edc:SFRFieldDef edc:cname="BTPLLREFDIV" edc:mask="0x3f" edc:name="BTPLLREFDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="BTCLKOUTEN" edc:mask="0x1" edc:name="BTCLKOUTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTLOCK" edc:mask="0x1" edc:name="BTLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTPLLCLK" edc:mask="0x1" edc:name="BTPLLCLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTPLL_BYP" edc:mask="0x1" edc:name="BTPLL_BYP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801250" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="EWPLLCON" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuxxx" edc:name="EWPLLCON" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EWPLLBSWSEL" edc:desc="" edc:mask="0x7" edc:name="EWPLLBSWSEL" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="EWPLLPWDN" edc:mask="0x1" edc:name="EWPLLPWDN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWPLLPOSTDIV1" edc:mask="0x3f" edc:name="EWPLLPOSTDIV1" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="EWPLLFLOCK" edc:mask="0x1" edc:name="EWPLLFLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWPLLRST" edc:mask="0x1" edc:name="EWPLLRST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWPLLFBDIV" edc:mask="0x3ff" edc:name="EWPLLFBDIV" edc:nzwidth="0xa"/>
            <edc:SFRFieldDef edc:cname="EWPLLREFDIV" edc:mask="0x3f" edc:name="EWPLLREFDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="ETHCLKOUTEN" edc:mask="0x1" edc:name="ETHCLKOUTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWLOCK" edc:mask="0x1" edc:name="EWLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWPLLICLK" edc:mask="0x1" edc:name="EWPLLICLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWPLL_BYP" edc:mask="0x1" edc:name="EWPLL_BYP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801260" edc:access="nn--nnnn-------------nn-nnnnnnnn" edc:cname="RCON" edc:desc="" edc:impl="0xcf0006ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--00u0-------------u0-00000000" edc:name="RCON" edc:nzwidth="32" edc:por="00--00x0-------------x0-00000011" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BOR" edc:desc="" edc:mask="0x1" edc:name="BOR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMTO" edc:desc="" edc:mask="0x1" edc:name="DMTO" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CMR" edc:desc="" edc:mask="0x1" edc:name="CMR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DPSLP" edc:mask="0x1" edc:name="DPSLP" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="VBAT" edc:desc="" edc:mask="0x1" edc:name="VBAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="VBPOR" edc:mask="0x1" edc:name="VBPOR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="NVMEOL" edc:mask="0x1" edc:name="NVMEOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMLTA" edc:mask="0x1" edc:name="NVMLTA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BCFGFAIL" edc:desc="" edc:mask="0x1" edc:name="BCFGFAIL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BCFGERR" edc:desc="" edc:mask="0x1" edc:name="BCFGERR" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="PORCORE" edc:mask="0x1" edc:name="PORCORE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORIO" edc:mask="0x1" edc:name="PORIO" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801270" edc:access="-------------------------------w" edc:cname="RSWRST" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="RSWRST" edc:nzwidth="32" edc:por="-------------------------------0" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="" edc:mask="0x1" edc:name="SWRST" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801280" edc:access="------nnn---n-nnnnnnnnnnnnnnnnnn" edc:cname="RNMICON" edc:desc="" edc:impl="0x38bffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------000---0-000000000000000000" edc:name="RNMICON" edc:nzwidth="32" edc:por="------000---0-000000000000000000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NMICNT" edc:desc="" edc:mask="0xffff" edc:name="NMICNT" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="WDTS" edc:desc="" edc:mask="0x1" edc:name="WDTS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LVD" edc:desc="" edc:mask="0x1" edc:name="LVD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GNMI" edc:mask="0x1" edc:name="GNMI" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SWNMI" edc:desc="" edc:mask="0x1" edc:name="SWNMI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTR" edc:desc="" edc:mask="0x1" edc:name="WDTR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMTO" edc:desc="" edc:mask="0x1" edc:name="DMTO" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
