Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F801290" edc:access="------------------------nnnn---n" edc:cname="PWRCON" edc:desc="" edc:impl="0xf1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------0000---0" edc:name="PWRCON" edc:nzwidth="32" edc:por="------------------------0000---0" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREGS" edc:desc="" edc:mask="0x1" edc:name="VREGS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="VRGSLP" edc:mask="0x3" edc:name="VRGSLP" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="VRGRUN" edc:mask="0x3" edc:name="VRGRUN" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8012A0" edc:access="-nnnnnnnnnnnnnnnnnnnn-nr----nnnn" edc:cname="REFO1CON" edc:desc="" edc:impl="0x7ffffb0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000-00----0000" edc:name="REFO1CON" edc:nzwidth="32" edc:por="-00000000000000000000-00----0000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0xf" edc:name="ROSEL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="" edc:mask="0x1" edc:name="DIVSWEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="" edc:mask="0x1" edc:name="RSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0x7fff" edc:name="RODIV" edc:nzwidth="15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REFERENCE CLOCK 1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8012B0" edc:access="nnnnnnnnn-----------------------" edc:cname="REFO1TRIM" edc:desc="" edc:impl="0xff800000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-----------------------" edc:name="REFO1TRIM" edc:nzwidth="32" edc:por="000000000-----------------------" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="23"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="" edc:mask="0x1ff" edc:name="ROTRIM" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8012C0" edc:access="-nnnnnnnnnnnnnnnnnnnn-nr----nnnn" edc:cname="REFO2CON" edc:desc="" edc:impl="0x7ffffb0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000-00----0000" edc:name="REFO2CON" edc:nzwidth="32" edc:por="-00000000000000000000-00----0000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0xf" edc:name="ROSEL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="" edc:mask="0x1" edc:name="DIVSWEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="" edc:mask="0x1" edc:name="RSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0x7fff" edc:name="RODIV" edc:nzwidth="15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REFERENCE CLOCK 1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8012D0" edc:access="nnnnnnnnn-----------------------" edc:cname="REFO2TRIM" edc:desc="" edc:impl="0xff800000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-----------------------" edc:name="REFO2TRIM" edc:nzwidth="32" edc:por="000000000-----------------------" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="23"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="" edc:mask="0x1ff" edc:name="ROTRIM" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8012E0" edc:access="-nnnnnnnnnnnnnnnnnnnn-nr----nnnn" edc:cname="REFO3CON" edc:desc="" edc:impl="0x7ffffb0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000-00----0000" edc:name="REFO3CON" edc:nzwidth="32" edc:por="-00000000000000000000-00----0000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0xf" edc:name="ROSEL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="" edc:mask="0x1" edc:name="DIVSWEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="" edc:mask="0x1" edc:name="RSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0x7fff" edc:name="RODIV" edc:nzwidth="15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REFERENCE CLOCK 1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8012F0" edc:access="nnnnnnnnn-----------------------" edc:cname="REFO3TRIM" edc:desc="" edc:impl="0xff800000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-----------------------" edc:name="REFO3TRIM" edc:nzwidth="32" edc:por="000000000-----------------------" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="23"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="" edc:mask="0x1ff" edc:name="ROTRIM" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801300" edc:access="-nnnnnnnnnnnnnnnnnnnn-nr----nnnn" edc:cname="REFO4CON" edc:desc="" edc:impl="0x7ffffb0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000-00----0000" edc:name="REFO4CON" edc:nzwidth="32" edc:por="-00000000000000000000-00----0000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ROSEL" edc:desc="" edc:mask="0xf" edc:name="ROSEL" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DIVSWEN" edc:desc="" edc:mask="0x1" edc:name="DIVSWEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RSLP" edc:desc="" edc:mask="0x1" edc:name="RSLP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x1" edc:name="OE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RODIV" edc:desc="" edc:mask="0x7fff" edc:name="RODIV" edc:nzwidth="15"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REFERENCE CLOCK 1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801310" edc:access="nnnnnnnnn-----------------------" edc:cname="REFO4TRIM" edc:desc="" edc:impl="0xff800000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000-----------------------" edc:name="REFO4TRIM" edc:nzwidth="32" edc:por="000000000-----------------------" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="23"/>
            <edc:SFRFieldDef edc:cname="ROTRIM" edc:desc="" edc:mask="0x1ff" edc:name="ROTRIM" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801320" edc:access="----------------n---r----nnnnnnn" edc:cname="PB1DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB1DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PB1DIVON" edc:desc="" edc:mask="0x1" edc:name="PB1DIVON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801330" edc:access="----------------n---r----nnnnnnn" edc:cname="PB2DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB2DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PB2DIVON" edc:desc="" edc:mask="0x1" edc:name="PB2DIVON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801340" edc:access="----------------n---r----nnnnnnn" edc:cname="PB3DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB3DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PB3DIVON" edc:desc="" edc:mask="0x1" edc:name="PB3DIVON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
