Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F801350" edc:access="----------------n---r----nnnnnnn" edc:cname="PB4DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB4DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PB4DIVON" edc:desc="" edc:mask="0x1" edc:name="PB4DIVON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801360" edc:access="----------------n---r----nnnnnnn" edc:cname="PB5DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB5DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PB5DIVON" edc:desc="" edc:mask="0x1" edc:name="PB5DIVON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801370" edc:access="----------------n---r----nnnnnnn" edc:cname="PB6DIV" edc:desc="" edc:impl="0x887f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1---1----xxxxxxx" edc:name="PB6DIV" edc:nzwidth="32" edc:por="----------------1---1----xxxxxxx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PBDIV" edc:desc="" edc:mask="0x7f" edc:name="PBDIV" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="PBDIVRDY" edc:desc="" edc:mask="0x1" edc:name="PBDIVRDY" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PB6DIVON" edc:desc="" edc:mask="0x1" edc:name="PB6DIVON" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801380" edc:access="----nnnn----nnnn-----nnn-----nnn" edc:cname="SLEWCON" edc:desc="" edc:impl="0xf0f0707" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu----0000-----000-----000" edc:name="SLEWCON" edc:nzwidth="32" edc:por="----xxxx----0000-----000-----000" edc:portals="CLR SET INV" ltx:baseofperipheral="CRU">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DNEN" edc:desc="" edc:mask="0x1" edc:name="DNEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UPEN" edc:desc="" edc:mask="0x1" edc:name="UPEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SLWDIV" edc:mask="0x7" edc:name="SLWDIV" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SYSDIV" edc:mask="0xf" edc:name="SYSDIV" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SLWDLY" edc:mask="0xf" edc:name="SLWDLY" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801390" edc:access="--------------------nnnnrnrrrrnr" edc:cname="CLKSTAT" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------uuuuuuuuuuuu" edc:name="CLKSTAT" edc:nzwidth="32" edc:por="--------------------xxxx0x0000x0" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FRCRDY" edc:mask="0x1" edc:name="FRCRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLRDY" edc:mask="0x1" edc:name="SPLLRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSCRDY" edc:mask="0x1" edc:name="POSCRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPLLRDY" edc:mask="0x1" edc:name="UPLLRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SOSCRDY" edc:mask="0x1" edc:name="SOSCRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPRCRDY" edc:mask="0x1" edc:name="LPRCRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BTPLLRDY" edc:mask="0x1" edc:name="BTPLLRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETHPLLRDY" edc:mask="0x1" edc:name="ETHPLLRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WIFICLKRDY" edc:mask="0x1" edc:name="WIFICLKRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPLLALTRDY" edc:mask="0x1" edc:name="SPLLALTRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PB1CLKRDY" edc:mask="0x1" edc:name="PB1CLKRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYSCLKRDY" edc:mask="0x1" edc:name="SYSCLKRDY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
