Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F801610" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnrrnnnrrrcr" edc:cname="U3STA" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000100010000" edc:name="U3STA" edc:nzwidth="0x20" edc:por="00000000000000000000000100010000" edc:portals="CLR SET INV" ltx:memberofperipheral="UART3">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="URXDA" edc:desc="" edc:mask="0x1" edc:name="URXDA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERR" edc:desc="" edc:mask="0x1" edc:name="PERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RIDLE" edc:desc="" edc:mask="0x1" edc:name="RIDLE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="URXISEL" edc:desc="" edc:mask="0x3" edc:name="URXISEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXBF" edc:desc="" edc:mask="0x1" edc:name="UTXBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXEN" edc:desc="" edc:mask="0x1" edc:name="UTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXBRK" edc:desc="" edc:mask="0x1" edc:name="UTXBRK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="URXEN" edc:desc="" edc:mask="0x1" edc:name="URXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXINV" edc:desc="" edc:mask="0x1" edc:name="UTXINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXISEL" edc:desc="" edc:mask="0x3" edc:name="UTXISEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="" edc:mask="0xff" edc:name="ADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="" edc:mask="0xff" edc:name="MASK" edc:nzwidth="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="URXISEL0" edc:desc="" edc:mask="0x1" edc:name="URXISEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="URXISEL1" edc:desc="" edc:mask="0x1" edc:name="URXISEL1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UTXISEL0" edc:desc="" edc:mask="0x1" edc:name="UTXISEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UTXISEL1" edc:desc="" edc:mask="0x1" edc:name="UTXISEL1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xe"/>
            <edc:SFRFieldDef edc:cname="UTXSEL" edc:desc="" edc:mask="0x1" edc:name="UTXSEL" edc:nzwidth="0x2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801620" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="1" edc:access="-----------------------nnnnnnnnn" edc:cname="U3TXREG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="U3TXREG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="- - -" ltx:memberofperipheral="UART3">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3TXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U3TXREG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801630" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="1" edc:access="-----------------------rrrrrrrrr" edc:cname="U3RXREG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="U3RXREG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="- - -" ltx:memberofperipheral="UART3">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3RXREG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="U3RXREG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="rp" edc:stimscl="rb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801640" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="1" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="U3BRG" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="U3BRG" edc:nzwidth="0x20" edc:por="------------00000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="UART3">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BRG" edc:desc="" edc:mask="0xfffff" edc:name="BRG" edc:nzwidth="20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801650" edc:offset="0x1b0"/>
      <edc:SFRDef edc:_addr="0x1F801800" edc:access="----------------------------nnnn" edc:cname="INT0R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="INT0R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT0R" edc:mask="0xf" edc:name="INT0R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801804" edc:access="----------------------------nnnn" edc:cname="INT1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="INT1R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT1R" edc:mask="0xf" edc:name="INT1R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
