Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F801808" edc:access="----------------------------nnnn" edc:cname="INT2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="INT2R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT2R" edc:mask="0xf" edc:name="INT2R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80180C" edc:access="----------------------------nnnn" edc:cname="INT3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="INT3R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT3R" edc:mask="0xf" edc:name="INT3R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801810" edc:access="----------------------------nnnn" edc:cname="INT4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="INT4R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT4R" edc:mask="0xf" edc:name="INT4R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801814" edc:access="----------------------------nnnn" edc:cname="T1CKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="T1CKR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T1CKR" edc:mask="0xf" edc:name="T1CKR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801818" edc:access="----------------------------nnnn" edc:cname="T2CKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="T2CKR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T2CKR" edc:mask="0xf" edc:name="T2CKR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80181C" edc:access="----------------------------nnnn" edc:cname="T3CKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="T3CKR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T3CKR" edc:mask="0xf" edc:name="T3CKR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801820" edc:access="----------------------------nnnn" edc:cname="T4CKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="T4CKR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T4CKR" edc:mask="0xf" edc:name="T4CKR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801824" edc:access="----------------------------nnnn" edc:cname="T5CKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="T5CKR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T5CKR" edc:mask="0xf" edc:name="T5CKR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801828" edc:access="----------------------------nnnn" edc:cname="T6CKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="T6CKR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T6CKR" edc:mask="0xf" edc:name="T6CKR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80182C" edc:access="----------------------------nnnn" edc:cname="T7CKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="T7CKR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T7CKR" edc:mask="0xf" edc:name="T7CKR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801830" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x1F801838" edc:access="----------------------------nnnn" edc:cname="IC1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="IC1R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC1R" edc:mask="0xf" edc:name="IC1R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80183C" edc:access="----------------------------nnnn" edc:cname="IC2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="IC2R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC2R" edc:mask="0xf" edc:name="IC2R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
