Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F801840" edc:access="----------------------------nnnn" edc:cname="IC3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="IC3R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC3R" edc:mask="0xf" edc:name="IC3R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801844" edc:access="----------------------------nnnn" edc:cname="IC4R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="IC4R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC4R" edc:mask="0xf" edc:name="IC4R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801848" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x1F80185C" edc:access="----------------------------nnnn" edc:cname="OCFAR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="OCFAR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OCFAR" edc:mask="0xf" edc:name="OCFAR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801860" edc:access="----------------------------nnnn" edc:cname="OCFBR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="OCFBR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OCFBR" edc:mask="0xf" edc:name="OCFBR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801864" edc:access="----------------------------nnnn" edc:cname="OCFCR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="OCFCR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OCFCR" edc:mask="0xf" edc:name="OCFCR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801868" edc:access="----------------------------nnnn" edc:cname="OCFDR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="OCFDR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OCFDR" edc:mask="0xf" edc:name="OCFDR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80186C" edc:access="----------------------------nnnn" edc:cname="U1RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="U1RXR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1RXR" edc:mask="0xf" edc:name="U1RXR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801870" edc:access="----------------------------nnnn" edc:cname="U1CTSR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="U1CTSR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1CTSR" edc:mask="0xf" edc:name="U1CTSR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801874" edc:access="----------------------------nnnn" edc:cname="U2RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="U2RXR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2RXR" edc:mask="0xf" edc:name="U2RXR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801878" edc:access="----------------------------nnnn" edc:cname="U2CTSR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="U2CTSR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2CTSR" edc:mask="0xf" edc:name="U2CTSR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80187C" edc:access="----------------------------nnnn" edc:cname="U3RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="U3RXR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3RXR" edc:mask="0xf" edc:name="U3RXR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801880" edc:access="----------------------------nnnn" edc:cname="U3CTSR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="U3CTSR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3CTSR" edc:mask="0xf" edc:name="U3CTSR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801884" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x1F80188C" edc:access="----------------------------nnnn" edc:cname="PTG30R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="PTG30R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTG30R" edc:mask="0xf" edc:name="PTG30R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801890" edc:access="----------------------------nnnn" edc:cname="PTG31R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="PTG31R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTG31R" edc:mask="0xf" edc:name="PTG31R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801894" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F801898" edc:access="----------------------------nnnn" edc:cname="SDI1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="SDI1R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI1R" edc:mask="0xf" edc:name="SDI1R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80189C" edc:access="----------------------------nnnn" edc:cname="SS1INR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="SS1INR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS1INR" edc:mask="0xf" edc:name="SS1INR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
