Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:AdjustPoint edc:_addr="0x1F8018A0" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F8018A4" edc:access="----------------------------nnnn" edc:cname="SDI2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="SDI2R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI2R" edc:mask="0xf" edc:name="SDI2R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8018A8" edc:access="----------------------------nnnn" edc:cname="SS2INR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="SS2INR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS2INR" edc:mask="0xf" edc:name="SS2INR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8018AC" edc:offset="0x18"/>
      <edc:SFRDef edc:_addr="0x1F8018C4" edc:access="----------------------------nnnn" edc:cname="C1RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="C1RXR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C1RXR" edc:mask="0xf" edc:name="C1RXR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8018C8" edc:access="----------------------------nnnn" edc:cname="C2RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="C2RXR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="C2RXR" edc:mask="0xf" edc:name="C2RXR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8018CC" edc:access="----------------------------nnnn" edc:cname="REFIR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="REFIR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REFIR" edc:mask="0xf" edc:name="REFIR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8018D0" edc:offset="0xA4"/>
      <edc:SFRDef edc:_addr="0x1F801974" edc:access="----------------------------nnnn" edc:cname="ECOLR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="ECOLR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ECOLR" edc:mask="0xf" edc:name="ECOLR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801978" edc:access="----------------------------nnnn" edc:cname="ECRSR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="ECRSR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ECRSR" edc:mask="0xf" edc:name="ECRSR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80197C" edc:access="----------------------------nnnn" edc:cname="ETXCLKR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="ETXCLKR" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ETXCLKR" edc:mask="0xf" edc:name="ETXCLKR" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801980" edc:access="----------------------------nnnn" edc:cname="ERXD3R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="ERXD3R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ERXD3R" edc:mask="0xf" edc:name="ERXD3R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801984" edc:access="----------------------------nnnn" edc:cname="ERXD2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="ERXD2R" edc:nzwidth="32" edc:por="----------------------------xxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ERXD2R" edc:mask="0xf" edc:name="ERXD2R" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801988" edc:offset="0x78"/>
      <edc:SFRDef edc:_addr="0x1F801A00" edc:access="---------------------------nnnnn" edc:cname="RPA0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPA0R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA0R" edc:mask="0x1f" edc:name="RPA0R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A04" edc:access="---------------------------nnnnn" edc:cname="RPA1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPA1R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA1R" edc:mask="0x1f" edc:name="RPA1R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A08" edc:access="---------------------------nnnnn" edc:cname="RPA2R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPA2R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPA2R" edc:mask="0x1f" edc:name="RPA2R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
