Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F801A50" edc:access="---------------------------nnnnn" edc:cname="RPB4R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPB4R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB4R" edc:mask="0x1f" edc:name="RPB4R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A54" edc:access="---------------------------nnnnn" edc:cname="RPB5R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPB5R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB5R" edc:mask="0x1f" edc:name="RPB5R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A58" edc:access="---------------------------nnnnn" edc:cname="RPB6R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPB6R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB6R" edc:mask="0x1f" edc:name="RPB6R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A5C" edc:access="---------------------------nnnnn" edc:cname="RPB7R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPB7R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB7R" edc:mask="0x1f" edc:name="RPB7R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A60" edc:access="---------------------------nnnnn" edc:cname="RPB8R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPB8R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB8R" edc:mask="0x1f" edc:name="RPB8R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A64" edc:access="---------------------------nnnnn" edc:cname="RPB9R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPB9R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB9R" edc:mask="0x1f" edc:name="RPB9R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A68" edc:access="---------------------------nnnnn" edc:cname="RPB10R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPB10R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB10R" edc:mask="0x1f" edc:name="RPB10R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A6C" edc:access="---------------------------nnnnn" edc:cname="RPB11R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPB11R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB11R" edc:mask="0x1f" edc:name="RPB11R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A70" edc:access="---------------------------nnnnn" edc:cname="RPB12R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPB12R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB12R" edc:mask="0x1f" edc:name="RPB12R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A74" edc:access="---------------------------nnnnn" edc:cname="RPB13R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPB13R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB13R" edc:mask="0x1f" edc:name="RPB13R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A78" edc:access="---------------------------nnnnn" edc:cname="RPB14R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPB14R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPB14R" edc:mask="0x1f" edc:name="RPB14R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801A7C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F801A80" edc:access="---------------------------nnnnn" edc:cname="RPC0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC0R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC0R" edc:mask="0x1f" edc:name="RPC0R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A84" edc:access="---------------------------nnnnn" edc:cname="RPC1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC1R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC1R" edc:mask="0x1f" edc:name="RPC1R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A88" edc:access="---------------------------nnnnn" edc:cname="RPC2R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC2R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC2R" edc:mask="0x1f" edc:name="RPC2R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
