Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F801A8C" edc:access="---------------------------nnnnn" edc:cname="RPC3R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC3R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC3R" edc:mask="0x1f" edc:name="RPC3R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A90" edc:access="---------------------------nnnnn" edc:cname="RPC4R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC4R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC4R" edc:mask="0x1f" edc:name="RPC4R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A94" edc:access="---------------------------nnnnn" edc:cname="RPC5R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC5R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC5R" edc:mask="0x1f" edc:name="RPC5R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A98" edc:access="---------------------------nnnnn" edc:cname="RPC6R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC6R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC6R" edc:mask="0x1f" edc:name="RPC6R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801A9C" edc:access="---------------------------nnnnn" edc:cname="RPC7R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC7R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC7R" edc:mask="0x1f" edc:name="RPC7R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AA0" edc:access="---------------------------nnnnn" edc:cname="RPC8R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC8R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC8R" edc:mask="0x1f" edc:name="RPC8R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AA4" edc:access="---------------------------nnnnn" edc:cname="RPC9R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC9R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC9R" edc:mask="0x1f" edc:name="RPC9R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AA8" edc:access="---------------------------nnnnn" edc:cname="RPC10R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC10R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC10R" edc:mask="0x1f" edc:name="RPC10R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AAC" edc:access="---------------------------nnnnn" edc:cname="RPC11R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC11R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC11R" edc:mask="0x1f" edc:name="RPC11R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AB0" edc:access="---------------------------nnnnn" edc:cname="RPC12R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC12R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC12R" edc:mask="0x1f" edc:name="RPC12R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AB4" edc:access="---------------------------nnnnn" edc:cname="RPC13R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC13R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC13R" edc:mask="0x1f" edc:name="RPC13R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AB8" edc:access="---------------------------nnnnn" edc:cname="RPC14R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC14R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC14R" edc:mask="0x1f" edc:name="RPC14R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801ABC" edc:access="---------------------------nnnnn" edc:cname="RPC15R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPC15R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPC15R" edc:mask="0x1f" edc:name="RPC15R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AC0" edc:access="---------------------------nnnnn" edc:cname="RPK0R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK0R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK0R" edc:mask="0x1f" edc:name="RPK0R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AC4" edc:access="---------------------------nnnnn" edc:cname="RPK1R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK1R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK1R" edc:mask="0x1f" edc:name="RPK1R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AC8" edc:access="---------------------------nnnnn" edc:cname="RPK2R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK2R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK2R" edc:mask="0x1f" edc:name="RPK2R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801ACC" edc:access="---------------------------nnnnn" edc:cname="RPK3R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK3R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK3R" edc:mask="0x1f" edc:name="RPK3R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AD0" edc:access="---------------------------nnnnn" edc:cname="RPK4R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK4R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK4R" edc:mask="0x1f" edc:name="RPK4R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AD4" edc:access="---------------------------nnnnn" edc:cname="RPK5R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK5R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK5R" edc:mask="0x1f" edc:name="RPK5R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AD8" edc:access="---------------------------nnnnn" edc:cname="RPK6R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK6R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK6R" edc:mask="0x1f" edc:name="RPK6R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801ADC" edc:access="---------------------------nnnnn" edc:cname="RPK7R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK7R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK7R" edc:mask="0x1f" edc:name="RPK7R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
