Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F801AE0" edc:access="---------------------------nnnnn" edc:cname="RPK8R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK8R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK8R" edc:mask="0x1f" edc:name="RPK8R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AE4" edc:access="---------------------------nnnnn" edc:cname="RPK9R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK9R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK9R" edc:mask="0x1f" edc:name="RPK9R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AE8" edc:access="---------------------------nnnnn" edc:cname="RPK10R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK10R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK10R" edc:mask="0x1f" edc:name="RPK10R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AEC" edc:access="---------------------------nnnnn" edc:cname="RPK11R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK11R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK11R" edc:mask="0x1f" edc:name="RPK11R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AF0" edc:access="---------------------------nnnnn" edc:cname="RPK12R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK12R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK12R" edc:mask="0x1f" edc:name="RPK12R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AF4" edc:access="---------------------------nnnnn" edc:cname="RPK13R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK13R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK13R" edc:mask="0x1f" edc:name="RPK13R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801AF8" edc:access="---------------------------nnnnn" edc:cname="RPK14R" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="RPK14R" edc:nzwidth="32" edc:por="---------------------------xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RPK14R" edc:mask="0x1f" edc:name="RPK14R" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801AFC" edc:offset="0x104"/>
      <edc:SFRDef edc:_addr="0x1F801C00" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnn-nnnnnnn-nnnnrr---nn" edc:cname="PTGCON" edc:desc="" edc:grp="PTG" edc:impl="0xfffffff3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxx-xxxxxxxxxxxxxx---xx" edc:name="PTGCON" edc:nzwidth="0x20" edc:por="000000000000-0000000-000000---00" edc:portals="CLR SET INV" ltx:baseofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGITM" edc:mask="0x3" edc:name="PTGITM" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PTGBUSY" edc:mask="0x1" edc:name="PTGBUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGWDTO" edc:mask="0x1" edc:name="PTGWDTO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGSTRT" edc:mask="0x1" edc:name="PTGSTRT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGIVIS" edc:mask="0x1" edc:name="PTGIVIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGSSEN" edc:mask="0x1" edc:name="PTGSSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGSWT" edc:mask="0x1" edc:name="PTGSWT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RESERVED" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGTOGL" edc:mask="0x1" edc:name="PTGTOGL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGSIDL" edc:mask="0x1" edc:name="PTGSIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGFRZ" edc:mask="0x1" edc:name="PTGFRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGON" edc:mask="0x1" edc:name="PTGON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGWDT" edc:mask="0x7" edc:name="PTGWDT" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGPWD" edc:mask="0xf" edc:name="PTGPWD" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PTGDIV" edc:mask="0x1f" edc:name="PTGDIV" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PTGCLK" edc:mask="0x7" edc:name="PTGCLK" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801C10" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGBTE" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGBTE" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGBTE" edc:mask="0xffffffff" edc:name="PTGBTE" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
