Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F801C20" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGHOLD" edc:desc="" edc:grp="PTG" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGHOLD" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGHOLD" edc:mask="0xffff" edc:name="PTGHOLD" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801C30" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGT0LIM" edc:desc="" edc:grp="FLASH" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGT0LIM" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGT0LIM" edc:mask="0xffff" edc:name="PTGT0LIM" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801C40" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGT1LIM" edc:desc="" edc:grp="FLASH" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGT1LIM" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGT1LIM" edc:mask="0xffff" edc:name="PTGT1LIM" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801C50" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGSDLIM" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGSDLIM" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGSDLIM" edc:mask="0xffff" edc:name="PTGSDLIM" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801C60" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGC0LIM" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGC0LIM" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGC0LIM" edc:mask="0xffff" edc:name="PTGC0LIM" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801C70" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGC1LIM" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGC1LIM" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGC1LIM" edc:mask="0xffff" edc:name="PTGC1LIM" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801C80" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGADJ" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGADJ" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGADJ" edc:mask="0xffff" edc:name="PTGADJ" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801C90" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PTGL0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PTGL0" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGL0" edc:mask="0xffff" edc:name="PTGL0" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801CA0" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="PTGQPTR" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------xxxxx" edc:name="PTGQPTR" edc:nzwidth="32" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGQPTR" edc:mask="0x1f" edc:name="PTGQPTR" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801CB0" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F801CC0" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP0" edc:mask="0xff" edc:name="STEP0" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP1" edc:mask="0xff" edc:name="STEP1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP2" edc:mask="0xff" edc:name="STEP2" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP3" edc:mask="0xff" edc:name="STEP3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801CD0" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP4" edc:mask="0xff" edc:name="STEP4" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP5" edc:mask="0xff" edc:name="STEP5" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP6" edc:mask="0xff" edc:name="STEP6" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP7" edc:mask="0xff" edc:name="STEP7" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801CE0" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP8" edc:mask="0xff" edc:name="STEP8" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP9" edc:mask="0xff" edc:name="STEP9" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP10" edc:mask="0xff" edc:name="STEP10" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP11" edc:mask="0xff" edc:name="STEP11" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801CF0" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE3" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP12" edc:mask="0xff" edc:name="STEP12" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP13" edc:mask="0xff" edc:name="STEP13" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP14" edc:mask="0xff" edc:name="STEP14" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP15" edc:mask="0xff" edc:name="STEP15" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801D00" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE4" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP16" edc:mask="0xff" edc:name="STEP16" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP17" edc:mask="0xff" edc:name="STEP17" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP18" edc:mask="0xff" edc:name="STEP18" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP19" edc:mask="0xff" edc:name="STEP19" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801D10" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE5" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP20" edc:mask="0xff" edc:name="STEP20" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP21" edc:mask="0xff" edc:name="STEP21" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP22" edc:mask="0xff" edc:name="STEP22" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP23" edc:mask="0xff" edc:name="STEP23" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
