Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F801D20" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE6" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="false" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE6" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP24" edc:mask="0xff" edc:name="STEP24" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP25" edc:mask="0xff" edc:name="STEP25" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP26" edc:mask="0xff" edc:name="STEP26" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP27" edc:mask="0xff" edc:name="STEP27" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F801D30" edc:_begin="0x0" edc:_end="0x140" edc:_modsrc="DOS-01459_ptg_pc_upb_v1_PIC32WK.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PTGQUE7" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PTGQUE7" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PTG">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STEP28" edc:mask="0xff" edc:name="STEP28" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP29" edc:mask="0xff" edc:name="STEP29" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP30" edc:mask="0xff" edc:name="STEP30" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STEP31" edc:mask="0xff" edc:name="STEP31" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F801D40" edc:offset="0x2c0"/>
      <edc:SFRDef edc:_addr="0x1F802000" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-02141_tmr_classa_pb_v2.Module" edc:_refcount="1" edc:access="----------------n-nnn-nnn-nn-nn-" edc:cname="T1CON" edc:desc="" edc:grp="TMR1" edc:impl="0xffffffbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------00000-000-00-00-" edc:name="T1CON" edc:nzwidth="0x20" edc:por="----------------00000-000-00-00-" edc:portals="CLR SET INV" ltx:baseofperipheral="TMR1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSYNC" edc:desc="" edc:mask="0x1" edc:name="TSYNC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="" edc:mask="0x3" edc:name="TCKPS" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TGATE" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TECS" edc:desc="" edc:mask="0x3" edc:name="TECS" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TWIP" edc:desc="" edc:mask="0x1" edc:name="TWIP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TWDIS" edc:desc="" edc:mask="0x1" edc:name="TWDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TCKPS0" edc:desc="" edc:mask="0x1" edc:name="TCKPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS1" edc:desc="" edc:mask="0x1" edc:name="TCKPS1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="TECS0" edc:desc="" edc:mask="0x1" edc:name="TECS0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TECS1" edc:desc="" edc:mask="0x1" edc:name="TECS1" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="TSIDL" edc:desc="" edc:mask="0x1" edc:name="TSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TON" edc:desc="" edc:mask="0x1" edc:name="TON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="TIMER1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802010" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-02141_tmr_classa_pb_v2.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TMR1" edc:desc="" edc:grp="TMR1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TMR1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="TMR1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802020" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-02141_tmr_classa_pb_v2.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PR1" edc:desc="" edc:grp="TMR1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000001111111111111111" edc:name="PR1" edc:nzwidth="0x20" edc:por="00000000000000001111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="PR1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
