Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:AdjustPoint edc:_addr="0x1F802030" edc:offset="0x1d0"/>
      <edc:SFRDef edc:_addr="0x1F802200" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00745_tmr_classb_pb_v1.Module" edc:_refcount="1" edc:access="----------------n-n-----nnnnn-n-" edc:cname="T2CON" edc:desc="" edc:grp="TMR2" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-----00000-0-" edc:name="T2CON" edc:nzwidth="0x20" edc:por="----------------000-----00000-0-" edc:portals="CLR SET INV" ltx:baseofperipheral="TMR2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="T32" edc:desc="" edc:mask="0x1" edc:name="T32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="" edc:mask="0x7" edc:name="TCKPS" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TGATE" edc:desc="" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TCKPS0" edc:desc="" edc:mask="0x1" edc:name="TCKPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS1" edc:desc="" edc:mask="0x1" edc:name="TCKPS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS2" edc:desc="" edc:mask="0x1" edc:name="TCKPS2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="TSIDL" edc:desc="" edc:mask="0x1" edc:name="TSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TON" edc:desc="" edc:mask="0x1" edc:name="TON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="TIMER2" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802210" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00745_tmr_classb_pb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TMR2" edc:desc="" edc:grp="TMR2" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TMR2" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR2">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMR2" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="TMR2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802220" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00745_tmr_classb_pb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PR2" edc:desc="" edc:grp="PR2" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000001111111111111111" edc:name="PR2" edc:nzwidth="0x20" edc:por="00000000000000001111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR2">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PR2" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="PR2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802230" edc:offset="0x1d0"/>
      <edc:SFRDef edc:_addr="0x1F802400" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00745_tmr_classb_pb_v1.Module" edc:_refcount="2" edc:access="----------------n-n-----nnnn--n-" edc:cname="T3CON" edc:desc="" edc:grp="TMR3" edc:impl="0xfffffff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-----0000--0-" edc:name="T3CON" edc:nzwidth="0x20" edc:por="----------------000-----0000--0-" edc:portals="CLR SET INV" ltx:baseofperipheral="TMR3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="" edc:mask="0x7" edc:name="TCKPS" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TGATE" edc:desc="" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TCKPS0" edc:desc="" edc:mask="0x1" edc:name="TCKPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS1" edc:desc="" edc:mask="0x1" edc:name="TCKPS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS2" edc:desc="" edc:mask="0x1" edc:name="TCKPS2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="TSIDL" edc:desc="" edc:mask="0x1" edc:name="TSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TON" edc:desc="" edc:mask="0x1" edc:name="TON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="TIMER3" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802410" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00745_tmr_classb_pb_v1.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TMR3" edc:desc="" edc:grp="TMR3" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TMR3" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR3">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMR3" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="TMR3" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802420" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00745_tmr_classb_pb_v1.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PR3" edc:desc="" edc:grp="PR3" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000001111111111111111" edc:name="PR3" edc:nzwidth="0x20" edc:por="00000000000000001111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR3">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PR3" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="PR3" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802430" edc:offset="0x1d0"/>
      <edc:SFRDef edc:_addr="0x1F802600" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00745_tmr_classb_pb_v1.Module" edc:_refcount="3" edc:access="----------------n-n-----nnnnn-n-" edc:cname="T4CON" edc:desc="" edc:grp="TMR4" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-----00000-0-" edc:name="T4CON" edc:nzwidth="0x20" edc:por="----------------000-----00000-0-" edc:portals="CLR SET INV" ltx:baseofperipheral="TMR4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="T32" edc:desc="" edc:mask="0x1" edc:name="T32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="" edc:mask="0x7" edc:name="TCKPS" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TGATE" edc:desc="" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TCKPS0" edc:desc="" edc:mask="0x1" edc:name="TCKPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS1" edc:desc="" edc:mask="0x1" edc:name="TCKPS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS2" edc:desc="" edc:mask="0x1" edc:name="TCKPS2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="TSIDL" edc:desc="" edc:mask="0x1" edc:name="TSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TON" edc:desc="" edc:mask="0x1" edc:name="TON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="TIMER4" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802610" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00745_tmr_classb_pb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TMR4" edc:desc="" edc:grp="TMR4" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TMR4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR4">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMR4" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="TMR4" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F802620" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00745_tmr_classb_pb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PR4" edc:desc="" edc:grp="PR4" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000001111111111111111" edc:name="PR4" edc:nzwidth="0x20" edc:por="00000000000000001111111111111111" edc:portals="CLR SET INV" ltx:memberofperipheral="TMR4">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PR4" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="PR4" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F802630" edc:offset="0x1d0"/>
      <edc:SFRDef edc:_addr="0x1F802800" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00745_tmr_classb_pb_v1.Module" edc:_refcount="4" edc:access="----------------n-n-----nnnn--n-" edc:cname="T5CON" edc:desc="" edc:grp="TMR5" edc:impl="0xfffffff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-----0000--0-" edc:name="T5CON" edc:nzwidth="0x20" edc:por="----------------000-----0000--0-" edc:portals="CLR SET INV" ltx:baseofperipheral="TMR5">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCS" edc:desc="" edc:mask="0x1" edc:name="TCS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TCKPS" edc:desc="" edc:mask="0x7" edc:name="TCKPS" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TGATE" edc:desc="" edc:mask="0x1" edc:name="TGATE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TCKPS0" edc:desc="" edc:mask="0x1" edc:name="TCKPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS1" edc:desc="" edc:mask="0x1" edc:name="TCKPS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCKPS2" edc:desc="" edc:mask="0x1" edc:name="TCKPS2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="TSIDL" edc:desc="" edc:mask="0x1" edc:name="TSIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TON" edc:desc="" edc:mask="0x1" edc:name="TON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="TIMER5" edc:pos="14"/>
      </edc:SFRDef>
