Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:AdjustPoint edc:_addr="0x1F802C30" edc:offset="0x1d0"/>
    </edc:SFRDataSector>
    <edc:GPRDataSector edc:beginaddr="0x1f803000" edc:endaddr="0x1F805000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="wcmDataMem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f80fe00" edc:endaddr="0x1f814F00" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb1b">
      <edc:AdjustPoint edc:_addr="0x1F80FE00" edc:offset="0x200"/>
      <edc:SFRDef edc:_addr="0x1F810000" edc:access="wwwwwwww---------n-n-nnn---nnnnn" edc:cname="INTCON" edc:desc="" edc:impl="0xff00571f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---------x-0-000---00000" edc:name="INTCON" edc:nzwidth="32" edc:por="xxxxxxxx---------x-0-000---00000" edc:portals="CLR SET INV" ltx:baseofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT0EP" edc:desc="" edc:mask="0x1" edc:name="INT0EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1EP" edc:desc="" edc:mask="0x1" edc:name="INT1EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2EP" edc:desc="" edc:mask="0x1" edc:name="INT2EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3EP" edc:desc="" edc:mask="0x1" edc:name="INT3EP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4EP" edc:desc="" edc:mask="0x1" edc:name="INT4EP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="TPC" edc:desc="" edc:mask="0x7" edc:name="TPC" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MVEC" edc:desc="" edc:mask="0x1" edc:name="MVEC" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="NMIKEY" edc:mask="0xff" edc:name="NMIKEY" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="INTERRUPT CONTROL" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810010" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnn---n" edc:cname="PRISS" edc:desc="" edc:impl="0xfffffff1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000---0" edc:name="PRISS" edc:nzwidth="32" edc:por="0000000000000000000000000000---0" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS0" edc:desc="" edc:mask="0x1" edc:name="SS0" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI1SS" edc:desc="" edc:mask="0xf" edc:name="PRI1SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI2SS" edc:desc="" edc:mask="0xf" edc:name="PRI2SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI3SS" edc:desc="" edc:mask="0xf" edc:name="PRI3SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI4SS" edc:desc="" edc:mask="0xf" edc:name="PRI4SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI5SS" edc:desc="" edc:mask="0xf" edc:name="PRI5SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI6SS" edc:desc="" edc:mask="0xf" edc:name="PRI6SS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PRI7SS" edc:desc="" edc:mask="0xf" edc:name="PRI7SS" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810020" edc:access="---------------------rrrrrrrrrrr" edc:cname="INTSTAT" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------00000000000" edc:name="INTSTAT" edc:nzwidth="32" edc:por="---------------------00000000000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SIRQ" edc:desc="" edc:mask="0xff" edc:name="SIRQ" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="SRIPL" edc:desc="" edc:mask="0x7" edc:name="SRIPL" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810030" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IPTMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IPTMR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IPTMR" edc:desc="" edc:mask="0xffffffff" edc:name="IPTMR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810040" edc:access="nn-----nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS0" edc:desc="" edc:impl="0xc1ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-----0000000000000000000000000" edc:name="IFS0" edc:nzwidth="32" edc:por="00-----0000000000000000000000000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIF" edc:desc="" edc:mask="0x1" edc:name="CTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IF" edc:desc="" edc:mask="0x1" edc:name="CS0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IF" edc:desc="" edc:mask="0x1" edc:name="CS1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IF" edc:desc="" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1IF" edc:desc="" edc:mask="0x1" edc:name="T1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIF" edc:desc="" edc:mask="0x1" edc:name="IC1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1IF" edc:desc="" edc:mask="0x1" edc:name="IC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC1IF" edc:desc="" edc:mask="0x1" edc:name="OC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IF" edc:desc="" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IF" edc:desc="" edc:mask="0x1" edc:name="T2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIF" edc:desc="" edc:mask="0x1" edc:name="IC2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2IF" edc:desc="" edc:mask="0x1" edc:name="IC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2IF" edc:desc="" edc:mask="0x1" edc:name="OC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IF" edc:desc="" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IF" edc:desc="" edc:mask="0x1" edc:name="T3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIF" edc:desc="" edc:mask="0x1" edc:name="IC3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3IF" edc:desc="" edc:mask="0x1" edc:name="IC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IF" edc:desc="" edc:mask="0x1" edc:name="OC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IF" edc:desc="" edc:mask="0x1" edc:name="INT3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4IF" edc:desc="" edc:mask="0x1" edc:name="T4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4EIF" edc:desc="" edc:mask="0x1" edc:name="IC4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4IF" edc:desc="" edc:mask="0x1" edc:name="IC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IF" edc:desc="" edc:mask="0x1" edc:name="OC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IF" edc:desc="" edc:mask="0x1" edc:name="INT4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5IF" edc:desc="" edc:mask="0x1" edc:name="T5IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="FCEIF" edc:desc="" edc:mask="0x1" edc:name="FCEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PREIF" edc:desc="" edc:mask="0x1" edc:name="PREIF" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810050" edc:access="nnnnnnnnnnn-----nnnnnnnnnnnnnnnn" edc:cname="IFS1" edc:desc="" edc:impl="0xffe0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu000000000-----00000000000000u0" edc:name="IFS1" edc:nzwidth="32" edc:por="xx000000000-----00000000000000x0" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFWCRCIF" edc:desc="" edc:mask="0x1" edc:name="PFWCRCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RTCCIF" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBIF" edc:desc="" edc:mask="0x1" edc:name="USBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIF" edc:desc="" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIF" edc:desc="" edc:mask="0x1" edc:name="I2C1BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIF" edc:desc="" edc:mask="0x1" edc:name="I2C1SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIF" edc:desc="" edc:mask="0x1" edc:name="I2C1MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIF" edc:desc="" edc:mask="0x1" edc:name="CNAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIF" edc:mask="0x1" edc:name="CNBIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNCIF" edc:desc="" edc:mask="0x1" edc:name="CNCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNKIF" edc:desc="" edc:mask="0x1" edc:name="CNKIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SPI2EIF" edc:desc="" edc:mask="0x1" edc:name="SPI2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2EIF" edc:desc="" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIF" edc:desc="" edc:mask="0x1" edc:name="I2C2BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIF" edc:desc="" edc:mask="0x1" edc:name="I2C2SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIF" edc:desc="" edc:mask="0x1" edc:name="I2C2MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3EIF" edc:mask="0x1" edc:name="U3EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3RXIF" edc:mask="0x1" edc:name="U3RXIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
