Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F810060" edc:access="nnnnnnnnnnnnnnnn---nnnnnnnnn---n" edc:cname="IFS2" edc:desc="" edc:impl="0xffff1ff1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000u000---000000000---u" edc:name="IFS2" edc:nzwidth="32" edc:por="000000000000x000---000000000---x" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3TXIF" edc:mask="0x1" edc:name="U3TXIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMA0IF" edc:desc="" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IF" edc:desc="" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IF" edc:desc="" edc:mask="0x1" edc:name="DMA3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA4IF" edc:desc="" edc:mask="0x1" edc:name="DMA4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IF" edc:desc="" edc:mask="0x1" edc:name="DMA5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IF" edc:desc="" edc:mask="0x1" edc:name="DMA6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IF" edc:desc="" edc:mask="0x1" edc:name="DMA7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6IF" edc:desc="" edc:mask="0x1" edc:name="T6IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="T7IF" edc:desc="" edc:mask="0x1" edc:name="T7IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RFSMCIF" edc:mask="0x1" edc:name="RFSMCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFMACIF" edc:desc="" edc:mask="0x1" edc:name="RFMACIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTR1EVIF" edc:desc="" edc:mask="0x1" edc:name="CTR1EVIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM0IF" edc:desc="" edc:mask="0x1" edc:name="RFTM0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM1IF" edc:desc="" edc:mask="0x1" edc:name="RFTM1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM2IF" edc:desc="" edc:mask="0x1" edc:name="RFTM2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM3IF" edc:desc="" edc:mask="0x1" edc:name="RFTM3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTR1TRGIF" edc:desc="" edc:mask="0x1" edc:name="CTR1TRGIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFWCOEIF" edc:desc="" edc:mask="0x1" edc:name="RFWCOEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCIF" edc:desc="" edc:mask="0x1" edc:name="ADCIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC1IF" edc:desc="" edc:mask="0x1" edc:name="ADCDC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC2IF" edc:desc="" edc:mask="0x1" edc:name="ADCDC2IF" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810070" edc:access="nnnnnnnnnnnnnnnnnnn-nnnnnnnnnnnn" edc:cname="IFS3" edc:desc="" edc:impl="0xffffefff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu00000000000000000-000000000000" edc:name="IFS3" edc:nzwidth="32" edc:por="xx00000000000000000-000000000000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDF1IF" edc:desc="" edc:mask="0x1" edc:name="ADCDF1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF2IF" edc:desc="" edc:mask="0x1" edc:name="ADCDF2IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ADCFLTIF" edc:desc="" edc:mask="0x1" edc:name="ADCFLTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCEOSIF" edc:desc="" edc:mask="0x1" edc:name="ADCEOSIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCARDYIF" edc:desc="" edc:mask="0x1" edc:name="ADCARDYIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCURDYIF" edc:desc="" edc:mask="0x1" edc:name="ADCURDYIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCFCBTIF" edc:desc="" edc:mask="0x1" edc:name="ADCFCBTIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCD0IF" edc:desc="" edc:mask="0x1" edc:name="ADCD0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD1IF" edc:desc="" edc:mask="0x1" edc:name="ADCD1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD2IF" edc:desc="" edc:mask="0x1" edc:name="ADCD2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD3IF" edc:desc="" edc:mask="0x1" edc:name="ADCD3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD4IF" edc:desc="" edc:mask="0x1" edc:name="ADCD4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD5IF" edc:desc="" edc:mask="0x1" edc:name="ADCD5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD6IF" edc:desc="" edc:mask="0x1" edc:name="ADCD6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD7IF" edc:desc="" edc:mask="0x1" edc:name="ADCD7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD8IF" edc:desc="" edc:mask="0x1" edc:name="ADCD8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD9IF" edc:desc="" edc:mask="0x1" edc:name="ADCD9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD10IF" edc:desc="" edc:mask="0x1" edc:name="ADCD10IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD11IF" edc:desc="" edc:mask="0x1" edc:name="ADCD11IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD12IF" edc:desc="" edc:mask="0x1" edc:name="ADCD12IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD13IF" edc:desc="" edc:mask="0x1" edc:name="ADCD13IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD14IF" edc:desc="" edc:mask="0x1" edc:name="ADCD14IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD15IF" edc:desc="" edc:mask="0x1" edc:name="ADCD15IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD16IF" edc:desc="" edc:mask="0x1" edc:name="ADCD16IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD17IF" edc:desc="" edc:mask="0x1" edc:name="ADCD17IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD18IF" edc:desc="" edc:mask="0x1" edc:name="ADCD18IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD19IF" edc:desc="" edc:mask="0x1" edc:name="ADCD19IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD20IF" edc:mask="0x1" edc:name="ADCD20IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCD21IF" edc:mask="0x1" edc:name="ADCD21IF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810080" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000uuu0000000000000uu" edc:name="IFS4" edc:nzwidth="32" edc:por="00000000000000xxx0000000000000xx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD22IF" edc:mask="0x1" edc:name="ADCD22IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCD23IF" edc:mask="0x1" edc:name="ADCD23IF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xc"/>
            <edc:SFRFieldDef edc:cname="CAN1IF" edc:desc="" edc:mask="0x1" edc:name="CAN1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN2RXIF" edc:mask="0x1" edc:name="CAN2RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN2TXIF" edc:mask="0x1" edc:name="CAN2TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN2IF" edc:mask="0x1" edc:name="CAN2IF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SQIIF" edc:desc="" edc:mask="0x1" edc:name="SQIIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PTGSTEPIF" edc:desc="" edc:mask="0x1" edc:name="PTGSTEPIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTGWDTIF" edc:desc="" edc:mask="0x1" edc:name="PTGWDTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR0IF" edc:desc="" edc:mask="0x1" edc:name="PTG0TR0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR1IF" edc:desc="" edc:mask="0x1" edc:name="PTG0TR1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR2IF" edc:desc="" edc:mask="0x1" edc:name="PTG0TR2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR3IF" edc:desc="" edc:mask="0x1" edc:name="PTG0TR3IF" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810090" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS5" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000000uuuu0000" edc:name="IFS5" edc:nzwidth="32" edc:por="-00000000000000000000000xxxx0000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="MPUPCIF" edc:desc="" edc:mask="0x1" edc:name="MPUPCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FDCIF" edc:desc="" edc:mask="0x1" edc:name="FDCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CRPTIF" edc:mask="0x1" edc:name="CRPTIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETHIF" edc:mask="0x1" edc:name="ETHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRPT1IF" edc:mask="0x1" edc:name="CRPT1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRPT1EIF" edc:mask="0x1" edc:name="CRPT1EIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8100A0" edc:offset="32"/>
      <edc:SFRDef edc:_addr="0x1F8100C0" edc:access="nn-----nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC0" edc:desc="" edc:impl="0xc1ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00-----0000000000000000000000000" edc:name="IEC0" edc:nzwidth="32" edc:por="00-----0000000000000000000000000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIE" edc:desc="" edc:mask="0x1" edc:name="CTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IE" edc:desc="" edc:mask="0x1" edc:name="CS0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IE" edc:desc="" edc:mask="0x1" edc:name="CS1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IE" edc:desc="" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1IE" edc:desc="" edc:mask="0x1" edc:name="T1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIE" edc:desc="" edc:mask="0x1" edc:name="IC1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1IE" edc:desc="" edc:mask="0x1" edc:name="IC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC1IE" edc:desc="" edc:mask="0x1" edc:name="OC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IE" edc:desc="" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IE" edc:desc="" edc:mask="0x1" edc:name="T2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIE" edc:desc="" edc:mask="0x1" edc:name="IC2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2IE" edc:desc="" edc:mask="0x1" edc:name="IC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2IE" edc:desc="" edc:mask="0x1" edc:name="OC2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IE" edc:desc="" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IE" edc:desc="" edc:mask="0x1" edc:name="T3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIE" edc:desc="" edc:mask="0x1" edc:name="IC3EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3IE" edc:desc="" edc:mask="0x1" edc:name="IC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IE" edc:desc="" edc:mask="0x1" edc:name="OC3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IE" edc:desc="" edc:mask="0x1" edc:name="INT3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4IE" edc:desc="" edc:mask="0x1" edc:name="T4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4EIE" edc:desc="" edc:mask="0x1" edc:name="IC4EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4IE" edc:desc="" edc:mask="0x1" edc:name="IC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IE" edc:desc="" edc:mask="0x1" edc:name="OC4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IE" edc:desc="" edc:mask="0x1" edc:name="INT4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5IE" edc:desc="" edc:mask="0x1" edc:name="T5IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="FCEIE" edc:desc="" edc:mask="0x1" edc:name="FCEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PREIE" edc:desc="" edc:mask="0x1" edc:name="PREIE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100D0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu000u000000000000000000000000u0" edc:name="IEC1" edc:nzwidth="32" edc:por="xx000x000000000000000000000000x0" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFWCRCIE" edc:desc="" edc:mask="0x1" edc:name="PFWCRCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RTCCIE" edc:mask="0x1" edc:name="RTCCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBIE" edc:desc="" edc:mask="0x1" edc:name="USBIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIE" edc:desc="" edc:mask="0x1" edc:name="SPI1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIE" edc:desc="" edc:mask="0x1" edc:name="U1EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIE" edc:desc="" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIE" edc:desc="" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIE" edc:desc="" edc:mask="0x1" edc:name="I2C1BIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIE" edc:desc="" edc:mask="0x1" edc:name="I2C1SIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIE" edc:desc="" edc:mask="0x1" edc:name="I2C1MIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIE" edc:desc="" edc:mask="0x1" edc:name="CNAIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIE" edc:mask="0x1" edc:name="CNBIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNCIE" edc:desc="" edc:mask="0x1" edc:name="CNCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNKIE" edc:desc="" edc:mask="0x1" edc:name="CNKIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="SPI2EIE" edc:desc="" edc:mask="0x1" edc:name="SPI2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIE" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIE" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2EIE" edc:desc="" edc:mask="0x1" edc:name="U2EIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2RXIE" edc:desc="" edc:mask="0x1" edc:name="U2RXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2TXIE" edc:desc="" edc:mask="0x1" edc:name="U2TXIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIE" edc:desc="" edc:mask="0x1" edc:name="I2C2BIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIE" edc:desc="" edc:mask="0x1" edc:name="I2C2SIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIE" edc:desc="" edc:mask="0x1" edc:name="I2C2MIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3EIE" edc:mask="0x1" edc:name="U3EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3RXIE" edc:mask="0x1" edc:name="U3RXIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8100E0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000u000000000000000000u" edc:name="IEC2" edc:nzwidth="32" edc:por="000000000000x000000000000000000x" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3TXIE" edc:mask="0x1" edc:name="U3TXIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DMA0IE" edc:desc="" edc:mask="0x1" edc:name="DMA0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA1IE" edc:desc="" edc:mask="0x1" edc:name="DMA1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IE" edc:desc="" edc:mask="0x1" edc:name="DMA2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IE" edc:desc="" edc:mask="0x1" edc:name="DMA3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA4IE" edc:desc="" edc:mask="0x1" edc:name="DMA4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IE" edc:desc="" edc:mask="0x1" edc:name="DMA5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IE" edc:desc="" edc:mask="0x1" edc:name="DMA6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IE" edc:desc="" edc:mask="0x1" edc:name="DMA7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6IE" edc:desc="" edc:mask="0x1" edc:name="T6IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="T7IE" edc:desc="" edc:mask="0x1" edc:name="T7IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RFSMCIE" edc:mask="0x1" edc:name="RFSMCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFMACIE" edc:desc="" edc:mask="0x1" edc:name="RFMACIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTREVIE" edc:desc="" edc:mask="0x1" edc:name="CTREVIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM0IE" edc:desc="" edc:mask="0x1" edc:name="RFTM0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM1IE" edc:desc="" edc:mask="0x1" edc:name="RFTM1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM2IE" edc:desc="" edc:mask="0x1" edc:name="RFTM2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFTM3IE" edc:desc="" edc:mask="0x1" edc:name="RFTM3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTRTRGIE" edc:desc="" edc:mask="0x1" edc:name="CTRTRGIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RFWCOEIE" edc:desc="" edc:mask="0x1" edc:name="RFWCOEIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCIE" edc:desc="" edc:mask="0x1" edc:name="ADCIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC1IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDC2IE" edc:desc="" edc:mask="0x1" edc:name="ADCDC2IE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
