Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8100F0" edc:access="nnnnnnnnnnnnnnnnnnn-nnnnnnnnnnnn" edc:cname="IEC3" edc:desc="" edc:impl="0xffffefff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu00000000000000000-000000000000" edc:name="IEC3" edc:nzwidth="32" edc:por="xx00000000000000000-000000000000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDF1IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCDF2IE" edc:desc="" edc:mask="0x1" edc:name="ADCDF2IE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ADCFLTIE" edc:desc="" edc:mask="0x1" edc:name="ADCFLTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCEOSIE" edc:desc="" edc:mask="0x1" edc:name="ADCEOSIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCARDYIE" edc:desc="" edc:mask="0x1" edc:name="ADCARDYIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCURDYIE" edc:desc="" edc:mask="0x1" edc:name="ADCURDYIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCFCBTIE" edc:desc="" edc:mask="0x1" edc:name="ADCFCBTIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ADCD0IE" edc:desc="" edc:mask="0x1" edc:name="ADCD0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD1IE" edc:desc="" edc:mask="0x1" edc:name="ADCD1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD2IE" edc:desc="" edc:mask="0x1" edc:name="ADCD2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD3IE" edc:desc="" edc:mask="0x1" edc:name="ADCD3IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD4IE" edc:desc="" edc:mask="0x1" edc:name="ADCD4IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD5IE" edc:desc="" edc:mask="0x1" edc:name="ADCD5IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD6IE" edc:desc="" edc:mask="0x1" edc:name="ADCD6IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD7IE" edc:desc="" edc:mask="0x1" edc:name="ADCD7IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD8IE" edc:desc="" edc:mask="0x1" edc:name="ADCD8IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD9IE" edc:desc="" edc:mask="0x1" edc:name="ADCD9IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD10IE" edc:desc="" edc:mask="0x1" edc:name="ADCD10IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD11IE" edc:desc="" edc:mask="0x1" edc:name="ADCD11IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD12IE" edc:desc="" edc:mask="0x1" edc:name="ADCD12IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD13IE" edc:desc="" edc:mask="0x1" edc:name="ADCD13IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD14IE" edc:desc="" edc:mask="0x1" edc:name="ADCD14IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD15IE" edc:desc="" edc:mask="0x1" edc:name="ADCD15IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD16IE" edc:desc="" edc:mask="0x1" edc:name="ADCD16IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD17IE" edc:desc="" edc:mask="0x1" edc:name="ADCD17IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD18IE" edc:desc="" edc:mask="0x1" edc:name="ADCD18IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD19IE" edc:desc="" edc:mask="0x1" edc:name="ADCD19IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADCD20IE" edc:mask="0x1" edc:name="ADCD20IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCD21IE" edc:mask="0x1" edc:name="ADCD21IE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810100" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000uuu0000000000000uu" edc:name="IEC4" edc:nzwidth="32" edc:por="00000000000000xxx0000000000000xx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCD22IE" edc:mask="0x1" edc:name="ADCD22IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADCD23IE" edc:mask="0x1" edc:name="ADCD23IE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xc"/>
            <edc:SFRFieldDef edc:cname="CAN1IE" edc:desc="" edc:mask="0x1" edc:name="CAN1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CAN2RXIE" edc:mask="0x1" edc:name="CAN2RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN2TXIE" edc:mask="0x1" edc:name="CAN2TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN2IE" edc:mask="0x1" edc:name="CAN2IE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SQIIE" edc:desc="" edc:mask="0x1" edc:name="SQIIE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PTGSTEPIE" edc:desc="" edc:mask="0x1" edc:name="PTGSTEPIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTGWDTIE" edc:desc="" edc:mask="0x1" edc:name="PTGWDTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR0IE" edc:desc="" edc:mask="0x1" edc:name="PTG0TR0IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR1IE" edc:desc="" edc:mask="0x1" edc:name="PTG0TR1IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR2IE" edc:desc="" edc:mask="0x1" edc:name="PTG0TR2IE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR3IE" edc:desc="" edc:mask="0x1" edc:name="PTG0TR3IE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810110" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IEC5" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00000000000000000000000uuuu0000" edc:name="IEC5" edc:nzwidth="32" edc:por="-00000000000000000000000xxxx0000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="MPUPCIE" edc:desc="" edc:mask="0x1" edc:name="MPUPCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FDCIE" edc:desc="" edc:mask="0x1" edc:name="FDCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CRPTIE" edc:mask="0x1" edc:name="CRPTIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ETHIE" edc:mask="0x1" edc:name="ETHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRPT1IE" edc:mask="0x1" edc:name="CRPT1IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRPT1EIE" edc:mask="0x1" edc:name="CRPT1EIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
