Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:AdjustPoint edc:_addr="0x1F810120" edc:offset="32"/>
      <edc:SFRDef edc:_addr="0x1F810140" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC0" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIS" edc:desc="" edc:mask="0x3" edc:name="CTIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CTIP" edc:desc="" edc:mask="0x7" edc:name="CTIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CS0IS" edc:desc="" edc:mask="0x3" edc:name="CS0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CS0IP" edc:desc="" edc:mask="0x7" edc:name="CS0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CS1IS" edc:desc="" edc:mask="0x3" edc:name="CS1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CS1IP" edc:desc="" edc:mask="0x7" edc:name="CS1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT0IS" edc:desc="" edc:mask="0x3" edc:name="INT0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT0IP" edc:desc="" edc:mask="0x7" edc:name="INT0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810150" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC1" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T1IS" edc:desc="" edc:mask="0x3" edc:name="T1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T1IP" edc:desc="" edc:mask="0x7" edc:name="T1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC1EIS" edc:desc="" edc:mask="0x3" edc:name="IC1EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC1EIP" edc:desc="" edc:mask="0x7" edc:name="IC1EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC1IS" edc:desc="" edc:mask="0x3" edc:name="IC1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC1IP" edc:desc="" edc:mask="0x7" edc:name="IC1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC1IS" edc:desc="" edc:mask="0x3" edc:name="OC1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC1IP" edc:desc="" edc:mask="0x7" edc:name="OC1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810160" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC2" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="INT1IS" edc:desc="" edc:mask="0x3" edc:name="INT1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT1IP" edc:desc="" edc:mask="0x7" edc:name="INT1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="T2IS" edc:desc="" edc:mask="0x3" edc:name="T2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T2IP" edc:desc="" edc:mask="0x7" edc:name="T2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC2EIS" edc:desc="" edc:mask="0x3" edc:name="IC2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC2EIP" edc:desc="" edc:mask="0x7" edc:name="IC2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC2IS" edc:desc="" edc:mask="0x3" edc:name="IC2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC2IP" edc:desc="" edc:mask="0x7" edc:name="IC2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810170" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC3" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OC2IS" edc:desc="" edc:mask="0x3" edc:name="OC2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC2IP" edc:desc="" edc:mask="0x7" edc:name="OC2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT2IS" edc:desc="" edc:mask="0x3" edc:name="INT2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT2IP" edc:desc="" edc:mask="0x7" edc:name="INT2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="T3IS" edc:desc="" edc:mask="0x3" edc:name="T3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T3IP" edc:desc="" edc:mask="0x7" edc:name="T3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC3EIS" edc:desc="" edc:mask="0x3" edc:name="IC3EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC3EIP" edc:desc="" edc:mask="0x7" edc:name="IC3EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
