Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F810180" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC4" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC3IS" edc:desc="" edc:mask="0x3" edc:name="IC3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC3IP" edc:desc="" edc:mask="0x7" edc:name="IC3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC3IS" edc:desc="" edc:mask="0x3" edc:name="OC3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC3IP" edc:desc="" edc:mask="0x7" edc:name="OC3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT3IS" edc:desc="" edc:mask="0x3" edc:name="INT3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT3IP" edc:desc="" edc:mask="0x7" edc:name="INT3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="T4IS" edc:desc="" edc:mask="0x3" edc:name="T4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T4IP" edc:desc="" edc:mask="0x7" edc:name="T4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810190" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC5" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC4EIS" edc:desc="" edc:mask="0x3" edc:name="IC4EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC4EIP" edc:desc="" edc:mask="0x7" edc:name="IC4EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC4IS" edc:desc="" edc:mask="0x3" edc:name="IC4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC4IP" edc:desc="" edc:mask="0x7" edc:name="IC4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC4IS" edc:desc="" edc:mask="0x3" edc:name="OC4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC4IP" edc:desc="" edc:mask="0x7" edc:name="OC4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="INT4IS" edc:desc="" edc:mask="0x3" edc:name="INT4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="INT4IP" edc:desc="" edc:mask="0x7" edc:name="INT4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8101A0" edc:access="---------------------------nnnnn" edc:cname="IPC6" edc:desc="" edc:impl="0xe0e0e0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="IPC6" edc:nzwidth="32" edc:por="---------------------------00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T5IS" edc:desc="" edc:mask="0x3" edc:name="T5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T5IP" edc:desc="" edc:mask="0x7" edc:name="T5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="21"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8101B0" edc:access="---nnnnn---nnnnn----------------" edc:cname="IPC7" edc:desc="" edc:impl="0xffffe0e0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000----------------" edc:name="IPC7" edc:nzwidth="32" edc:por="---00000---00000----------------" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="FCEIS" edc:desc="" edc:mask="0x3" edc:name="FCEIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="FCEIP" edc:desc="" edc:mask="0x7" edc:name="FCEIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PREIS" edc:desc="" edc:mask="0x3" edc:name="PREIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PREIP" edc:desc="" edc:mask="0x7" edc:name="PREIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8101C0" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC8" edc:desc="" edc:impl="0xffffff1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---uuuuu" edc:name="IPC8" edc:nzwidth="32" edc:por="---00000---00000---00000---xxxxx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFWCRCIS" edc:mask="0x3" edc:name="PFWCRCIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PFWCRCIP" edc:mask="0x7" edc:name="PFWCRCIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RTCCIS" edc:desc="" edc:mask="0x3" edc:name="RTCCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RTCCIP" edc:desc="" edc:mask="0x7" edc:name="RTCCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="USBIS" edc:desc="" edc:mask="0x3" edc:name="USBIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="USBIP" edc:desc="" edc:mask="0x7" edc:name="USBIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI1EIS" edc:desc="" edc:mask="0x3" edc:name="SPI1EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI1EIP" edc:desc="" edc:mask="0x7" edc:name="SPI1EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8101D0" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC9" edc:desc="" edc:impl="0xffffff7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC9" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI1RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI1RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI1RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI1TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI1TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U1EIS" edc:desc="" edc:mask="0x3" edc:name="U1EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U1EIP" edc:desc="" edc:mask="0x7" edc:name="U1EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U1RXIS" edc:desc="" edc:mask="0x3" edc:name="U1RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U1RXIP" edc:desc="" edc:mask="0x7" edc:name="U1RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8101E0" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC10" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC10" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U1TXIS" edc:desc="" edc:mask="0x3" edc:name="U1TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U1TXIP" edc:desc="" edc:mask="0x7" edc:name="U1TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C1BIS" edc:desc="" edc:mask="0x3" edc:name="I2C1BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C1BIP" edc:desc="" edc:mask="0x7" edc:name="I2C1BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C1SIS" edc:desc="" edc:mask="0x3" edc:name="I2C1SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C1SIP" edc:desc="" edc:mask="0x7" edc:name="I2C1SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C1MIS" edc:desc="" edc:mask="0x3" edc:name="I2C1MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C1MIP" edc:desc="" edc:mask="0x7" edc:name="I2C1MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8101F0" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC11" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC11" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNAIS" edc:desc="" edc:mask="0x3" edc:name="CNAIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNAIP" edc:desc="" edc:mask="0x7" edc:name="CNAIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNBIS" edc:mask="0x3" edc:name="CNBIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CNBIP" edc:mask="0x7" edc:name="CNBIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNCIS" edc:desc="" edc:mask="0x3" edc:name="CNCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNCIP" edc:desc="" edc:mask="0x7" edc:name="CNCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CNKIS" edc:desc="" edc:mask="0x3" edc:name="CNKIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CNKIP" edc:desc="" edc:mask="0x7" edc:name="CNKIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F810200" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F810210" edc:access="---nnnnn---nnnnn---nnnnn--------" edc:cname="IPC13" edc:desc="" edc:impl="0xffffffe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000--------" edc:name="IPC13" edc:nzwidth="32" edc:por="---00000---00000---00000--------" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="SPI2EIS" edc:desc="" edc:mask="0x3" edc:name="SPI2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2EIP" edc:desc="" edc:mask="0x7" edc:name="SPI2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI2RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI2RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI2TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI2TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810220" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC14" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC14" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U2EIS" edc:desc="" edc:mask="0x3" edc:name="U2EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2EIP" edc:desc="" edc:mask="0x7" edc:name="U2EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U2RXIS" edc:desc="" edc:mask="0x3" edc:name="U2RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="U2RXIP" edc:desc="" edc:mask="0x7" edc:name="U2RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="U2TXIS" edc:mask="0x3" edc:name="U2TXIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="U2TXIP" edc:mask="0x7" edc:name="U2TXIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C2BIS" edc:desc="" edc:mask="0x3" edc:name="I2C2BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2BIP" edc:desc="" edc:mask="0x7" edc:name="I2C2BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810230" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC15" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu---00000---00000" edc:name="IPC15" edc:nzwidth="32" edc:por="---xxxxx---xxxxx---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C2SIS" edc:desc="" edc:mask="0x3" edc:name="I2C2SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2SIP" edc:desc="" edc:mask="0x7" edc:name="I2C2SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C2MIS" edc:desc="" edc:mask="0x3" edc:name="I2C2MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C2MIP" edc:desc="" edc:mask="0x7" edc:name="I2C2MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="U3EIS" edc:mask="0x3" edc:name="U3EIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="U3EIP" edc:mask="0x7" edc:name="U3EIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="U3RXIS" edc:mask="0x3" edc:name="U3RXIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="U3RXIP" edc:mask="0x7" edc:name="U3RXIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810240" edc:access="---------------------------nnnnn" edc:cname="IPC16" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="IPC16" edc:nzwidth="32" edc:por="---------------------------xxxxx" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3TXIS" edc:mask="0x3" edc:name="U3TXIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="U3TXIP" edc:mask="0x7" edc:name="U3TXIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810250" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC17" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC17" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA0IS" edc:desc="" edc:mask="0x3" edc:name="DMA0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA0IP" edc:desc="" edc:mask="0x7" edc:name="DMA0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA1IS" edc:desc="" edc:mask="0x3" edc:name="DMA1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA1IP" edc:desc="" edc:mask="0x7" edc:name="DMA1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA2IS" edc:desc="" edc:mask="0x3" edc:name="DMA2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA2IP" edc:desc="" edc:mask="0x7" edc:name="DMA2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA3IS" edc:desc="" edc:mask="0x3" edc:name="DMA3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA3IP" edc:desc="" edc:mask="0x7" edc:name="DMA3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810260" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC18" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC18" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA4IS" edc:desc="" edc:mask="0x3" edc:name="DMA4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA4IP" edc:desc="" edc:mask="0x7" edc:name="DMA4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA5IS" edc:desc="" edc:mask="0x3" edc:name="DMA5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA5IP" edc:desc="" edc:mask="0x7" edc:name="DMA5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA6IS" edc:desc="" edc:mask="0x3" edc:name="DMA6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA6IP" edc:desc="" edc:mask="0x7" edc:name="DMA6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA7IS" edc:desc="" edc:mask="0x3" edc:name="DMA7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA7IP" edc:desc="" edc:mask="0x7" edc:name="DMA7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810270" edc:access="---------------------------nnnnn" edc:cname="IPC19" edc:desc="" edc:impl="0xe0e0e0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="IPC19" edc:nzwidth="32" edc:por="---------------------------00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T6IS" edc:desc="" edc:mask="0x3" edc:name="T6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T6IP" edc:desc="" edc:mask="0x7" edc:name="T6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="21"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810280" edc:access="---nnnnn-------------------nnnnn" edc:cname="IPC20" edc:desc="" edc:impl="0xffe0e0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu-------------------00000" edc:name="IPC20" edc:nzwidth="32" edc:por="---xxxxx-------------------00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T7IS" edc:desc="" edc:mask="0x3" edc:name="T7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="T7IP" edc:desc="" edc:mask="0x7" edc:name="T7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x13"/>
            <edc:SFRFieldDef edc:cname="RFSMCIS" edc:mask="0x3" edc:name="RFSMCIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RFSMCIP" edc:mask="0x7" edc:name="RFSMCIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810290" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC21" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC21" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RFMACIS" edc:desc="" edc:mask="0x3" edc:name="RFMACIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RFMACIP" edc:desc="" edc:mask="0x7" edc:name="RFMACIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CTREVIS" edc:desc="" edc:mask="0x3" edc:name="CTREVIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CTREVIP" edc:desc="" edc:mask="0x7" edc:name="CTREVIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RFTM0IS" edc:desc="" edc:mask="0x3" edc:name="RFTM0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RFTM0IP" edc:desc="" edc:mask="0x7" edc:name="RFTM0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RFTM1IS" edc:desc="" edc:mask="0x3" edc:name="RFTM1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RFTM1IP" edc:desc="" edc:mask="0x7" edc:name="RFTM1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
