Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8102A0" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC22" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC22" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RFTM2IS" edc:desc="" edc:mask="0x3" edc:name="RFTM2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RFTM2IP" edc:desc="" edc:mask="0x7" edc:name="RFTM2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RFTM3IS" edc:desc="" edc:mask="0x3" edc:name="RFTM3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RFTM3IP" edc:desc="" edc:mask="0x7" edc:name="RFTM3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CTRTRGIS" edc:desc="" edc:mask="0x3" edc:name="CTRTRGIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CTRTRGIP" edc:desc="" edc:mask="0x7" edc:name="CTRTRGIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RFWCOEIS" edc:desc="" edc:mask="0x3" edc:name="RFWCOEIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RFWCOEIP" edc:desc="" edc:mask="0x7" edc:name="RFWCOEIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102B0" edc:access="---nnnnn---nnnnn-----------nnnnn" edc:cname="IPC23" edc:desc="" edc:impl="0xffffe0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000-----------00000" edc:name="IPC23" edc:nzwidth="32" edc:por="---00000---00000-----------00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1IS" edc:desc="" edc:mask="0x3" edc:name="AD1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1IP" edc:desc="" edc:mask="0x7" edc:name="AD1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:SFRFieldDef edc:cname="AD1DC1IS" edc:desc="" edc:mask="0x3" edc:name="AD1DC1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DC1IP" edc:desc="" edc:mask="0x7" edc:name="AD1DC1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DC2IS" edc:desc="" edc:mask="0x3" edc:name="AD1DC2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DC2IP" edc:desc="" edc:mask="0x7" edc:name="AD1DC2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102C0" edc:access="-------------------nnnnn---nnnnn" edc:cname="IPC24" edc:desc="" edc:impl="0xe0e0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00000---00000" edc:name="IPC24" edc:nzwidth="32" edc:por="-------------------00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1DF1IS" edc:desc="" edc:mask="0x3" edc:name="AD1DF1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DF1IP" edc:desc="" edc:mask="0x7" edc:name="AD1DF1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DF2IS" edc:desc="" edc:mask="0x3" edc:name="AD1DF2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DF2IP" edc:desc="" edc:mask="0x7" edc:name="AD1DF2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="13"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102D0" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC25" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC25" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1DFIIS" edc:desc="" edc:mask="0x3" edc:name="AD1DFIIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DFIIP" edc:desc="" edc:mask="0x7" edc:name="AD1DFIIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1EOSIS" edc:desc="" edc:mask="0x3" edc:name="AD1EOSIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1EOSIP" edc:desc="" edc:mask="0x7" edc:name="AD1EOSIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1ARIS" edc:desc="" edc:mask="0x3" edc:name="AD1ARIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1ARIP" edc:desc="" edc:mask="0x7" edc:name="AD1ARIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1RSIS" edc:desc="" edc:mask="0x3" edc:name="AD1RSIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1RSIP" edc:desc="" edc:mask="0x7" edc:name="AD1RSIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102E0" edc:access="---nnnnn---nnnnn-----------nnnnn" edc:cname="IPC26" edc:desc="" edc:impl="0xffffe0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000-----------00000" edc:name="IPC26" edc:nzwidth="32" edc:por="---00000---00000-----------00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1FCIS" edc:desc="" edc:mask="0x3" edc:name="AD1FCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1FCIP" edc:desc="" edc:mask="0x7" edc:name="AD1FCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:SFRFieldDef edc:cname="AD1I00IS" edc:desc="" edc:mask="0x3" edc:name="AD1I00IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I00IP" edc:desc="" edc:mask="0x7" edc:name="AD1I00IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I01IS" edc:desc="" edc:mask="0x3" edc:name="AD1I01IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I01IP" edc:desc="" edc:mask="0x7" edc:name="AD1I01IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8102F0" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC27" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---uuuuu" edc:name="IPC27" edc:nzwidth="32" edc:por="---00000---00000---00000---xxxxx" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1I02IS" edc:desc="" edc:mask="0x3" edc:name="AD1I02IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I02IP" edc:desc="" edc:mask="0x7" edc:name="AD1I02IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I03IS" edc:desc="" edc:mask="0x3" edc:name="AD1I03IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I03IP" edc:desc="" edc:mask="0x7" edc:name="AD1I03IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I04IS" edc:desc="" edc:mask="0x3" edc:name="AD1I04IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I04IP" edc:desc="" edc:mask="0x7" edc:name="AD1I04IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I05IS" edc:desc="" edc:mask="0x3" edc:name="AD1I05IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I05IP" edc:desc="" edc:mask="0x7" edc:name="AD1I05IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810300" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC28" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC28" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1I06IS" edc:desc="" edc:mask="0x3" edc:name="AD1I06IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I06IP" edc:desc="" edc:mask="0x7" edc:name="AD1I06IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I07IS" edc:desc="" edc:mask="0x3" edc:name="AD1I07IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I07IP" edc:desc="" edc:mask="0x7" edc:name="AD1I07IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I08IS" edc:desc="" edc:mask="0x3" edc:name="AD1I08IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I08IP" edc:desc="" edc:mask="0x7" edc:name="AD1I08IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I09IS" edc:desc="" edc:mask="0x3" edc:name="AD1I09IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I09IP" edc:desc="" edc:mask="0x7" edc:name="AD1I09IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810310" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC29" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC29" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1I10IS" edc:desc="" edc:mask="0x3" edc:name="AD1I10IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I10IP" edc:desc="" edc:mask="0x7" edc:name="AD1I10IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I11IS" edc:desc="" edc:mask="0x3" edc:name="AD1I11IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I11IP" edc:desc="" edc:mask="0x7" edc:name="AD1I11IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I12IS" edc:desc="" edc:mask="0x3" edc:name="AD1I12IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I12IP" edc:desc="" edc:mask="0x7" edc:name="AD1I12IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I13IS" edc:desc="" edc:mask="0x3" edc:name="AD1I13IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I13IP" edc:desc="" edc:mask="0x7" edc:name="AD1I13IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810320" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC30" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC30" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1I14IS" edc:desc="" edc:mask="0x3" edc:name="AD1I14IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I14IP" edc:desc="" edc:mask="0x7" edc:name="AD1I14IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I15IS" edc:desc="" edc:mask="0x3" edc:name="AD1I15IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I15IP" edc:desc="" edc:mask="0x7" edc:name="AD1I15IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I16IS" edc:desc="" edc:mask="0x3" edc:name="AD1I16IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I16IP" edc:desc="" edc:mask="0x7" edc:name="AD1I16IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I17IS" edc:desc="" edc:mask="0x3" edc:name="AD1I17IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I17IP" edc:desc="" edc:mask="0x7" edc:name="AD1I17IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810330" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC31" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu---00000---00000" edc:name="IPC31" edc:nzwidth="32" edc:por="---xxxxx---xxxxx---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1I18IS" edc:desc="" edc:mask="0x3" edc:name="AD1I18IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I18IP" edc:desc="" edc:mask="0x7" edc:name="AD1I18IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1I19IS" edc:desc="" edc:mask="0x3" edc:name="AD1I19IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1I19IP" edc:desc="" edc:mask="0x7" edc:name="AD1I19IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AD1I20IS" edc:mask="0x3" edc:name="AD1I20IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I20IP" edc:mask="0x7" edc:name="AD1I20IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AD1I21IS" edc:mask="0x3" edc:name="AD1I21IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I21IP" edc:mask="0x7" edc:name="AD1I21IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
