Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F810340" edc:access="-------------------nnnnn---nnnnn" edc:cname="IPC32" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------uuuuu---uuuuu" edc:name="IPC32" edc:nzwidth="32" edc:por="-------------------xxxxx---xxxxx" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1I22IS" edc:mask="0x3" edc:name="AD1I22IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I22IP" edc:mask="0x7" edc:name="AD1I22IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="AD1I23IS" edc:mask="0x3" edc:name="AD1I23IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="AD1I23IP" edc:mask="0x7" edc:name="AD1I23IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F810350" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F810370" edc:access="---nnnnn---nnnnn----------------" edc:cname="IPC35" edc:desc="" edc:impl="0xffffe0e0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---00000----------------" edc:name="IPC35" edc:nzwidth="32" edc:por="---xxxxx---00000----------------" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="CAN1IS" edc:desc="" edc:mask="0x3" edc:name="CAN1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN1IP" edc:desc="" edc:mask="0x7" edc:name="CAN1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CAN2RXIS" edc:mask="0x3" edc:name="CAN2RXIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CAN2RXIP" edc:mask="0x7" edc:name="CAN2RXIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810380" edc:access="-------------------nnnnn---nnnnn" edc:cname="IPC36" edc:desc="" edc:impl="0x1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------uuuuu---uuuuu" edc:name="IPC36" edc:nzwidth="32" edc:por="-------------------xxxxx---xxxxx" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAN2TXIS" edc:mask="0x3" edc:name="CAN2TXIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CAN2TXIP" edc:mask="0x7" edc:name="CAN2TXIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CAN2IS" edc:mask="0x3" edc:name="CAN2IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CAN2IP" edc:mask="0x7" edc:name="CAN2IP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810390" edc:access="-----------nnnnn----------------" edc:cname="IPC37" edc:desc="" edc:impl="0xe0ffe0e0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000----------------" edc:name="IPC37" edc:nzwidth="32" edc:por="-----------00000----------------" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="SQIIS" edc:desc="" edc:mask="0x3" edc:name="SQIIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SQIIP" edc:desc="" edc:mask="0x7" edc:name="SQIIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103A0" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC38" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC38" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGSTEPIS" edc:desc="" edc:mask="0x3" edc:name="PTGSTEPIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PTGSTEPIP" edc:desc="" edc:mask="0x7" edc:name="PTGSTEPIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PTGWDTIS" edc:desc="" edc:mask="0x3" edc:name="PTGWDTIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PTGWDTIP" edc:desc="" edc:mask="0x7" edc:name="PTGWDTIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PTGTR0IS" edc:desc="" edc:mask="0x3" edc:name="PTGTR0IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PTGTR0IP" edc:desc="" edc:mask="0x7" edc:name="PTGTR0IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PTGTR1IS" edc:desc="" edc:mask="0x3" edc:name="PTGTR1IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PTGTR1IP" edc:desc="" edc:mask="0x7" edc:name="PTGTR1IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103B0" edc:access="-------------------nnnnn---nnnnn" edc:cname="IPC39" edc:desc="" edc:impl="0xe0e0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------00000---00000" edc:name="IPC39" edc:nzwidth="32" edc:por="-------------------00000---00000" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGTR2IS" edc:desc="" edc:mask="0x3" edc:name="PTGTR2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PTGTR2IP" edc:desc="" edc:mask="0x7" edc:name="PTGTR2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PTGTR3IS" edc:desc="" edc:mask="0x3" edc:name="PTGTR3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="PTGTR3IP" edc:desc="" edc:mask="0x7" edc:name="PTGTR3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="13"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103C0" edc:access="---nnnnn---nnnnn----------------" edc:cname="IPC40" edc:desc="" edc:impl="0xffffe0e0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000----------------" edc:name="IPC40" edc:nzwidth="32" edc:por="---00000---00000----------------" edc:portals="CLR SET INV">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="MPUPCIS" edc:desc="" edc:mask="0x3" edc:name="MPUPCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="MPUPCIP" edc:desc="" edc:mask="0x7" edc:name="MPUPCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="FDCIS" edc:desc="" edc:mask="0x3" edc:name="FDCIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="FDCIP" edc:desc="" edc:mask="0x7" edc:name="FDCIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103D0" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC41" edc:desc="" edc:impl="0x1f1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu---uuuuu---uuuuu" edc:name="IPC41" edc:nzwidth="32" edc:por="---xxxxx---xxxxx---xxxxx---xxxxx" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CRPTIS" edc:mask="0x3" edc:name="CRPTIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CRPTIP" edc:mask="0x7" edc:name="CRPTIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ETHIS" edc:mask="0x3" edc:name="ETHIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ETHIP" edc:mask="0x7" edc:name="ETHIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CRPT1IS" edc:mask="0x3" edc:name="CRPT1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CRPT1IP" edc:mask="0x7" edc:name="CRPT1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CRPT1EIS" edc:mask="0x3" edc:name="CRPT1EIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CRPT1EIP" edc:mask="0x7" edc:name="CRPT1EIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8103E0" edc:access="---------------------------nnnnn" edc:cname="IPC42" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------uuuuu" edc:name="IPC42" edc:nzwidth="32" edc:por="---------------------------xxxxx" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CVDIS" edc:mask="0x3" edc:name="CVDIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CVDIP" edc:mask="0x7" edc:name="CVDIP" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
