Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:AdjustPoint edc:_addr="0x1F8103F0" edc:offset="0x150"/>
      <edc:SFRDef edc:_addr="0x1F810540" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF000" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF000" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810544" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF001" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF001" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810548" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF002" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF002" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F81054C" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF003" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF003" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810550" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF004" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF004" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810554" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF005" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF005" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810558" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF006" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF006" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F81055C" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF007" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF007" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
