Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F810630" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF060" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF060" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810634" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF061" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF061" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810638" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF062" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF062" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F81063C" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF063" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF063" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810640" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF064" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF064" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F810644" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810648" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F81064C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F810650" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF068" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF068" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810654" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF069" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF069" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810658" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF070" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF070" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F81065C" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF071" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF071" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810660" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF072" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF072" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810664" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF073" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF073" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
