Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F810668" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF074" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF074" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F81066C" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF075" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF075" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810670" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF076" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF076" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F810674" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810678" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F81067C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F810680" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF080" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF080" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F810684" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810688" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F81068C" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF083" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF083" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810690" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF084" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF084" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810694" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF085" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF085" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810698" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF086" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF086" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F81069C" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF087" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF087" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8106A0" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF088" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF088" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8106A4" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF089" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF089" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8106A8" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF090" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF090" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8106AC" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF091" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF091" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8106B0" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF092" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF092" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8106B4" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8106B8" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF094" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF094" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
