Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F810744" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF129" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF129" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F810748" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F81074C" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810750" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810754" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810758" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F81075C" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810760" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810764" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810768" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F81076C" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810770" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810774" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F810778" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF142" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF142" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F81077C" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF143" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF143" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810780" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF144" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF144" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810784" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF145" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF145" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F810788" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F81078C" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810790" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F810794" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F810798" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF150" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF150" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F81079C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8107A0" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF152" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF152" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8107A4" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF153" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF153" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8107A8" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF154" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF154" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8107AC" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF155" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF155" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
