Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8107B0" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF156" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF156" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8107B4" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF157" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF157" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8107B8" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F8107BC" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F8107C0" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F8107C4" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8107C8" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF162" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF162" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8107CC" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF163" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF163" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8107D0" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF164" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF164" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8107D4" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF165" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF165" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8107D8" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF166" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF166" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8107DC" edc:_begin="0x540" edc:_end="0x7e4" edc:_modsrc="DOS-02907_SG402_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------nnnnnnnnnnnnnnnnn-" edc:cname="OFF167" edc:desc="" edc:impl="0x3fffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00000000000000000-" edc:name="OFF167" edc:nzwidth="32" edc:por="--------------00000000000000000-" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="VOFF" edc:desc="" edc:mask="0x1ffff" edc:name="VOFF" edc:nzwidth="17"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
