Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F811610" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH7SPTR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DCH7SPTR" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHSPTR" edc:desc="" edc:mask="0xffff" edc:name="CHSPTR" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811620" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH7DPTR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DCH7DPTR" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHDPTR" edc:desc="" edc:mask="0xffff" edc:name="CHDPTR" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811630" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH7CSIZ" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH7CSIZ" edc:nzwidth="32" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHCSIZ" edc:desc="" edc:mask="0xffff" edc:name="CHCSIZ" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811640" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH7CPTR" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DCH7CPTR" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="DCS7CPTR"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHCPTR" edc:desc="" edc:mask="0xffff" edc:name="CHCPTR" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F811650" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-01500_dma_bvci_v2.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH7DAT" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH7DAT" edc:nzwidth="32" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHPDAT" edc:desc="" edc:mask="0xffff" edc:name="CHPDAT" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F811660" edc:offset="0x9A0"/>
      <edc:SFRDef edc:_addr="0x1F812000" edc:_begin="0x130" edc:_end="0x150" edc:_modsrc="DOS-02869_icd_jtag_bvci_upb_v2.Module" edc:_refcount="1" edc:access="-----------------n-------nnnnnnn" edc:cname="_ICDCON" edc:desc="" edc:impl="0x407f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------0-------0000000" edc:name="_ICDCON" edc:nzwidth="32" edc:por="-----------------0-------0000000" edc:portals="- - -">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CKSWBKEN" edc:desc="" edc:mask="0x1" edc:name="CKSWBKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPBKEN" edc:desc="" edc:mask="0x1" edc:name="SLPBKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTBKEN" edc:desc="" edc:mask="0x1" edc:name="WDTBKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="WDTEN" edc:desc="" edc:mask="0x1" edc:name="WDTEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RSTBUG" edc:desc="" edc:mask="0x1" edc:name="RSTBUG" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMTBKEN" edc:desc="" edc:mask="0x1" edc:name="DMTBKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMTEN" edc:desc="" edc:mask="0x1" edc:name="DMTEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F812010" edc:_begin="0x130" edc:_end="0x150" edc:_modsrc="DOS-02869_icd_jtag_bvci_upb_v2.Module" edc:_refcount="1" edc:access="--------------------------nnnnnn" edc:cname="_ICDSTAT" edc:desc="" edc:grp="_DDPSTAT" edc:impl="0xf9ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000000" edc:name="_ICDSTAT" edc:nzwidth="0x20" edc:por="--------------------------000000" edc:portals="- - -" ltx:baseofperipheral="_DDPSTAT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CKSWBF" edc:desc="" edc:mask="0x1" edc:name="CKSWBF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPBF" edc:desc="" edc:mask="0x1" edc:name="SLPBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTBF" edc:desc="" edc:mask="0x1" edc:name="WDTBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMTBF" edc:desc="" edc:mask="0x1" edc:name="DMTBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTRUNBF" edc:mask="0x1" edc:name="WDTRUNBF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTSLPBF" edc:mask="0x1" edc:name="WDTSLPBF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:AdjustPoint edc:offset="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F812020" edc:offset="0x3e0"/>
      <edc:SFRDef edc:_addr="0x1F812400" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-03088_pfm_cache_ocp_v2.Module" edc:_refcount="1" edc:access="-----nnn-nnn-nnn---n---nn-nnnnnn" edc:cname="PRECON" edc:desc="" edc:grp="PCACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111-000-000---0---1u-001111" edc:name="PRECON" edc:nzwidth="0x20" edc:por="-----111-000-000---0---1x-001111" edc:portals="CLR SET INV" ltx:baseofperipheral="PCACHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFMWS" edc:desc="" edc:mask="0xf" edc:name="PFMWS" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PREFEN" edc:desc="" edc:mask="0x3" edc:name="PREFEN" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PFMSECEN" edc:mask="0x1" edc:name="PFMSECEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFMAWSEN" edc:mask="0x1" edc:name="PFMAWSEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CHEPERFEN" edc:mask="0x1" edc:name="CHEPERFEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ICHECOH" edc:mask="0x1" edc:name="ICHECOH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCHECOH" edc:mask="0x1" edc:name="DCHECOH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERCHECOH" edc:mask="0x1" edc:name="PERCHECOH" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICHEINV" edc:mask="0x1" edc:name="ICHEINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCHEINV" edc:mask="0x1" edc:name="DCHEINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERCHEINV" edc:mask="0x1" edc:name="PERCHEINV" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICHEEN" edc:mask="0x1" edc:name="ICHEEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCHEEN" edc:mask="0x1" edc:name="DCHEEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PERCHEEN" edc:mask="0x1" edc:name="PERCHEEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
