Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F812410" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-03088_pfm_cache_ocp_v2.Module" edc:_refcount="1" edc:access="----nn------------------nnnnnnnn" edc:cname="PRESTAT" edc:desc="" edc:impl="0xc0000ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uu------------------uuuuuuuu" edc:name="PRESTAT" edc:nzwidth="32" edc:por="----xx------------------xxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="PCACHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFMSECCNT" edc:mask="0xff" edc:name="PFMSECCNT" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="PFMSEC" edc:mask="0x1" edc:name="PFMSEC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFMDED" edc:mask="0x1" edc:name="PFMDED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F812420" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-03088_pfm_cache_ocp_v2.Module" edc:_refcount="1" edc:access="cccccccccccccccccccccccccccccccc" edc:cname="PREHIT" edc:desc="" edc:grp="CACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PREHIT" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="PCACHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHEHIT" edc:desc="" edc:mask="0xffffffff" edc:name="CHEHIT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F812430" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-03088_pfm_cache_ocp_v2.Module" edc:_refcount="1" edc:access="cccccccccccccccccccccccccccccccc" edc:cname="PREMIS" edc:desc="" edc:grp="CACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="PREMIS" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="PCACHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHEMIS" edc:desc="" edc:mask="0xffffffff" edc:name="CHEMIS" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F812440" edc:offset="0x19c0"/>
      <edc:SFRDef edc:_addr="0x1F813E00" edc:access="nn-----nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMUSPICTRL" edc:desc="" edc:impl="0xc1ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-----uuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="PMUSPICTRL" edc:nzwidth="32" edc:por="xx-----xxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPIWDATA" edc:mask="0xffff" edc:name="SPIWDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:mask="0xff" edc:name="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x1" edc:name="CMD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PMUCRST" edc:mask="0x1" edc:name="PMUCRST" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIRST" edc:mask="0x1" edc:name="SPIRST" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E04" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn------n" edc:cname="PMUSPISTAT" edc:desc="" edc:impl="0xffffff81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuu------u" edc:name="PMUSPISTAT" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxx------x">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPIERR" edc:mask="0x1" edc:name="SPIERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SPIRDY" edc:mask="0x1" edc:name="SPIRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIRADDR" edc:mask="0xff" edc:name="SPIRADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIRDATA" edc:mask="0xffff" edc:name="SPIRDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E08" edc:access="nn-------------nnnnnnnnnnnnnnnnn" edc:cname="PMUCLKCTRL" edc:desc="" edc:impl="0xc001ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-------------uuuuuuuuuuuuuuuuu" edc:name="PMUCLKCTRL" edc:nzwidth="32" edc:por="xx-------------xxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPICLKDIV" edc:mask="0x3f" edc:name="SPICLKDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SPISRC" edc:mask="0x3" edc:name="SPISRC" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BUCKCLKDIV" edc:mask="0x3f" edc:name="BUCKCLKDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="BUCKSRC" edc:mask="0x3" edc:name="BUCKSRC" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BACWD" edc:mask="0x1" edc:name="BACWD" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="WLDOOFF" edc:mask="0x1" edc:name="WLDOOFF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WCMRET" edc:mask="0x1" edc:name="WCMRET" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E0C" edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:cname="PMUMODECTRL1" edc:desc="" edc:impl="0xff1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu---uuuuu---uuuuu" edc:name="PMUMODECTRL1" edc:nzwidth="32" edc:por="xxxxxxxx---xxxxx---xxxxx---xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:mask="0x1f" edc:name="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:mask="0x1f" edc:name="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:mask="0x1f" edc:name="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:mask="0x1f" edc:name="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:mask="0x1" edc:name="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:mask="0x1" edc:name="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:mask="0x1" edc:name="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E10" edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:cname="PMUMODECTRL2" edc:desc="" edc:impl="0xff1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu---uuuuu---uuuuu" edc:name="PMUMODECTRL2" edc:nzwidth="32" edc:por="xxxxxxxx---xxxxx---xxxxx---xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:mask="0x1f" edc:name="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:mask="0x1f" edc:name="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:mask="0x1f" edc:name="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:mask="0x1f" edc:name="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:mask="0x1" edc:name="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:mask="0x1" edc:name="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:mask="0x1" edc:name="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E14" edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:cname="PMUMODECTRL3" edc:desc="" edc:impl="0xff1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu---uuuuu---uuuuu" edc:name="PMUMODECTRL3" edc:nzwidth="32" edc:por="xxxxxxxx---xxxxx---xxxxx---xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:mask="0x1f" edc:name="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:mask="0x1f" edc:name="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:mask="0x1f" edc:name="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:mask="0x1f" edc:name="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:mask="0x1" edc:name="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:mask="0x1" edc:name="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:mask="0x1" edc:name="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
