Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F813E18" edc:access="nnnnnnnn---nnnnn---nnnnn---nnnnn" edc:cname="PMUMODECTRL4" edc:desc="" edc:impl="0xff1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu---uuuuu---uuuuu" edc:name="PMUMODECTRL4" edc:nzwidth="32" edc:por="xxxxxxxx---xxxxx---xxxxx---xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREG4CTRL" edc:mask="0x1f" edc:name="VREG4CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3CTRL" edc:mask="0x1f" edc:name="VREG3CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2CTRL" edc:mask="0x1f" edc:name="VREG2CTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG1CTRL" edc:mask="0x1f" edc:name="VREG1CTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="BUCKMODE" edc:mask="0x1" edc:name="BUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MLDOEN" edc:mask="0x1" edc:name="MLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUCKEN" edc:mask="0x1" edc:name="BUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E1C" edc:access="nnnnnnnnnn-nnnnn---nnnnn---nnnnn" edc:cname="PMUOVERCTRL" edc:desc="" edc:impl="0xffdf1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1000000001-00000---00000---00000" edc:name="PMUOVERCTRL" edc:nzwidth="32" edc:por="1000000001-00000---00000---00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="VREG4OCTRL" edc:mask="0x1f" edc:name="VREG4OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG3OCTRL" edc:mask="0x1f" edc:name="VREG3OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="VREG2OCTRL" edc:mask="0x1f" edc:name="VREG2OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PHWC" edc:mask="0x1" edc:name="PHWC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVEREN" edc:mask="0x1" edc:name="OVEREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VREG1OCTRL" edc:mask="0x1f" edc:name="VREG1OCTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="OBUCKMODE" edc:mask="0x1" edc:name="OBUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OMLDOEN" edc:mask="0x1" edc:name="OMLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OBUCKEN" edc:mask="0x1" edc:name="OBUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E20" edc:access="rrrrrrrr---rrrrr---rrrrr---rrrrr" edc:cname="PMUCMODE" edc:desc="" edc:impl="0xff1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01000000---00000---00000---00000" edc:name="PMUCMODE" edc:nzwidth="32" edc:por="01000000---00000---00000---00000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CVREG4OCTRL" edc:mask="0x1f" edc:name="CVREG4OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CVREG3OCTRL" edc:mask="0x1f" edc:name="CVREG3OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CVREG2OCTRL" edc:mask="0x1f" edc:name="CVREG2OCTRL" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CVREG1OCTRL" edc:mask="0x1f" edc:name="CVREG1OCTRL" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="CBUCKMODE" edc:mask="0x1" edc:name="CBUCKMODE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMLDOEN" edc:mask="0x1" edc:name="CMLDOEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CBUCKEN" edc:mask="0x1" edc:name="CBUCKEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E24" edc:access="rrrrrrrrrrrrrrrrrrrrrrrr--rrrrrr" edc:cname="PMUSTATUS" edc:desc="" edc:impl="0xffffff3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000000000000000--000000" edc:name="PMUSTATUS" edc:nzwidth="32" edc:por="000000000000000000000000--000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STATUS" edc:mask="0x1f" edc:name="STATUS" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="WCMRM" edc:mask="0x1" edc:name="WCMRM" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BSSEDATA" edc:mask="0xffff" edc:name="BSSEDATA" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="BSSENUM" edc:mask="0x7f" edc:name="BSSENUM" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BSSERR" edc:mask="0x1" edc:name="BSSERR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E28" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PMUSEQ0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq" edc:name="PMUSEQ0" edc:nzwidth="32" edc:por="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DELAY" edc:mask="0x3f" edc:name="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:mask="0x1" edc:name="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x1" edc:name="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:mask="0xff" edc:name="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:mask="0xffff" edc:name="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E2C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PMUSEQ1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq" edc:name="PMUSEQ1" edc:nzwidth="32" edc:por="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DELAY" edc:mask="0x3f" edc:name="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:mask="0x1" edc:name="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x1" edc:name="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:mask="0xff" edc:name="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:mask="0xffff" edc:name="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E30" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PMUSEQ2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq" edc:name="PMUSEQ2" edc:nzwidth="32" edc:por="qqqqqqqqqqqqqqqqqqqqqqqqqqqqqqqq">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DELAY" edc:mask="0x3f" edc:name="DELAY" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="CMPBVAL" edc:mask="0x1" edc:name="CMPBVAL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x1" edc:name="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPIADDR" edc:mask="0xff" edc:name="SPIADDR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SPIDATA" edc:mask="0xffff" edc:name="SPIDATA" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F813E34" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F813E38" edc:access="--------------------------rrrrrr" edc:cname="PMUCFG" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------uuuuuu" edc:name="PMUCFG" edc:nzwidth="32" edc:por="--------------------------xxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DELAY" edc:mask="0x3f" edc:name="DELAY" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E3C" edc:access="nn-r---------nnn-----nnnnnnnnnnn" edc:cname="PMUWCMCMD" edc:desc="" edc:impl="0xd00707ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-u---------uuu-----uuuuuuuuuuu" edc:name="PMUWCMCMD" edc:nzwidth="32" edc:por="xx-x---------xxx-----xxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WCMADDR" edc:mask="0x7ff" edc:name="WCMADDR" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="WCMCLKDIV" edc:mask="0x7" edc:name="WCMCLKDIV" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="WCMRDY" edc:mask="0x1" edc:name="WCMRDY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:mask="0x1" edc:name="CMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:mask="0x1" edc:name="MODE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F813E40" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMUWCMWDATA" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="PMUWCMWDATA" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDATA" edc:mask="0xffffffff" edc:name="WDATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
