Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F813E44" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PMUWCMRDATA" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="PMUWCMRDATA" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RDATA" edc:mask="0xffffffff" edc:name="RDATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F813E48" edc:offset="0x1"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1F820000" edc:endaddr="0x1F840000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb2">
      <edc:SFRDef edc:_addr="0x1F820000" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnn-n----------" edc:cname="ANSELA" edc:desc="" edc:grp="PORTA" edc:impl="0xfffff400" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111-1----------" edc:name="ANSELA" edc:nzwidth="0x20" edc:por="----------------1111-1----------" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA10" edc:desc="" edc:mask="0x1" edc:name="ANSA10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSA12" edc:desc="" edc:mask="0x1" edc:name="ANSA12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA13" edc:desc="" edc:mask="0x1" edc:name="ANSA13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA14" edc:desc="" edc:mask="0x1" edc:name="ANSA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSA15" edc:desc="" edc:mask="0x1" edc:name="ANSA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820010" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TRISA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111111111111111" edc:name="TRISA" edc:nzwidth="0x20" edc:por="----------------1111111111111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA3" edc:desc="" edc:mask="0x1" edc:name="TRISA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA5" edc:desc="" edc:mask="0x1" edc:name="TRISA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA6" edc:desc="" edc:mask="0x1" edc:name="TRISA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA7" edc:desc="" edc:mask="0x1" edc:name="TRISA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA8" edc:desc="" edc:mask="0x1" edc:name="TRISA8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISA9" edc:desc="" edc:mask="0x1" edc:name="TRISA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA10" edc:desc="" edc:mask="0x1" edc:name="TRISA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA11" edc:desc="" edc:mask="0x1" edc:name="TRISA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISA12" edc:desc="" edc:mask="0x1" edc:name="TRISA12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISA13" edc:desc="" edc:mask="0x1" edc:name="TRISA13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISA14" edc:desc="" edc:mask="0x1" edc:name="TRISA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISA15" edc:desc="" edc:mask="0x1" edc:name="TRISA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820020" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PORTA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PORTA" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA2" edc:desc="" edc:mask="0x1" edc:name="RA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA3" edc:desc="" edc:mask="0x1" edc:name="RA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA5" edc:desc="" edc:mask="0x1" edc:name="RA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA6" edc:desc="" edc:mask="0x1" edc:name="RA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA7" edc:desc="" edc:mask="0x1" edc:name="RA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA8" edc:desc="" edc:mask="0x1" edc:name="RA8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RA9" edc:desc="" edc:mask="0x1" edc:name="RA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA10" edc:desc="" edc:mask="0x1" edc:name="RA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA11" edc:desc="" edc:mask="0x1" edc:name="RA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RA12" edc:desc="" edc:mask="0x1" edc:name="RA12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RA13" edc:desc="" edc:mask="0x1" edc:name="RA13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RA14" edc:desc="" edc:mask="0x1" edc:name="RA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA15" edc:desc="" edc:mask="0x1" edc:name="RA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820030" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="LATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="LATA" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA3" edc:desc="" edc:mask="0x1" edc:name="LATA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA5" edc:desc="" edc:mask="0x1" edc:name="LATA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA6" edc:desc="" edc:mask="0x1" edc:name="LATA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA7" edc:desc="" edc:mask="0x1" edc:name="LATA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA8" edc:desc="" edc:mask="0x1" edc:name="LATA8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATA9" edc:desc="" edc:mask="0x1" edc:name="LATA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA10" edc:desc="" edc:mask="0x1" edc:name="LATA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA11" edc:desc="" edc:mask="0x1" edc:name="LATA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATA12" edc:desc="" edc:mask="0x1" edc:name="LATA12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATA13" edc:desc="" edc:mask="0x1" edc:name="LATA13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATA14" edc:desc="" edc:mask="0x1" edc:name="LATA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATA15" edc:desc="" edc:mask="0x1" edc:name="LATA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820040" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ODCA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ODCA" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCA0" edc:desc="" edc:mask="0x1" edc:name="ODCA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA1" edc:desc="" edc:mask="0x1" edc:name="ODCA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA2" edc:desc="" edc:mask="0x1" edc:name="ODCA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA3" edc:desc="" edc:mask="0x1" edc:name="ODCA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA4" edc:desc="" edc:mask="0x1" edc:name="ODCA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA5" edc:desc="" edc:mask="0x1" edc:name="ODCA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA6" edc:desc="" edc:mask="0x1" edc:name="ODCA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA7" edc:desc="" edc:mask="0x1" edc:name="ODCA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA8" edc:desc="" edc:mask="0x1" edc:name="ODCA8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCA9" edc:desc="" edc:mask="0x1" edc:name="ODCA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA10" edc:desc="" edc:mask="0x1" edc:name="ODCA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA11" edc:desc="" edc:mask="0x1" edc:name="ODCA11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCA12" edc:desc="" edc:mask="0x1" edc:name="ODCA12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCA13" edc:desc="" edc:mask="0x1" edc:name="ODCA13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCA14" edc:desc="" edc:mask="0x1" edc:name="ODCA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCA15" edc:desc="" edc:mask="0x1" edc:name="ODCA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
