Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F820050" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPUA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNPUA" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUA0" edc:desc="" edc:mask="0x1" edc:name="CNPUA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA1" edc:desc="" edc:mask="0x1" edc:name="CNPUA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA2" edc:desc="" edc:mask="0x1" edc:name="CNPUA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA3" edc:desc="" edc:mask="0x1" edc:name="CNPUA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA4" edc:desc="" edc:mask="0x1" edc:name="CNPUA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA5" edc:desc="" edc:mask="0x1" edc:name="CNPUA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA6" edc:desc="" edc:mask="0x1" edc:name="CNPUA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA7" edc:desc="" edc:mask="0x1" edc:name="CNPUA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA8" edc:desc="" edc:mask="0x1" edc:name="CNPUA8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA9" edc:desc="" edc:mask="0x1" edc:name="CNPUA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA10" edc:desc="" edc:mask="0x1" edc:name="CNPUA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA11" edc:desc="" edc:mask="0x1" edc:name="CNPUA11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA12" edc:desc="" edc:mask="0x1" edc:name="CNPUA12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA13" edc:desc="" edc:mask="0x1" edc:name="CNPUA13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA14" edc:desc="" edc:mask="0x1" edc:name="CNPUA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUA15" edc:desc="" edc:mask="0x1" edc:name="CNPUA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820060" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPDA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNPDA" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDA0" edc:desc="" edc:mask="0x1" edc:name="CNPDA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA1" edc:desc="" edc:mask="0x1" edc:name="CNPDA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA2" edc:desc="" edc:mask="0x1" edc:name="CNPDA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA3" edc:desc="" edc:mask="0x1" edc:name="CNPDA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA4" edc:desc="" edc:mask="0x1" edc:name="CNPDA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA5" edc:desc="" edc:mask="0x1" edc:name="CNPDA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA6" edc:desc="" edc:mask="0x1" edc:name="CNPDA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA7" edc:desc="" edc:mask="0x1" edc:name="CNPDA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA8" edc:desc="" edc:mask="0x1" edc:name="CNPDA8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA9" edc:desc="" edc:mask="0x1" edc:name="CNPDA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA10" edc:desc="" edc:mask="0x1" edc:name="CNPDA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA11" edc:desc="" edc:mask="0x1" edc:name="CNPDA11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA12" edc:desc="" edc:mask="0x1" edc:name="CNPDA12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA13" edc:desc="" edc:mask="0x1" edc:name="CNPDA13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA14" edc:desc="" edc:mask="0x1" edc:name="CNPDA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDA15" edc:desc="" edc:mask="0x1" edc:name="CNPDA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820070" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------n-n-n-----------" edc:cname="CNCONA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0-0-0-----------" edc:name="CNCONA" edc:nzwidth="0x20" edc:por="----------------0-0-0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE A" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820080" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNENA" edc:desc="" edc:grp="PORTA" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNENA" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEA0" edc:desc="" edc:mask="0x1" edc:name="CNIEA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA1" edc:desc="" edc:mask="0x1" edc:name="CNIEA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA2" edc:desc="" edc:mask="0x1" edc:name="CNIEA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA3" edc:desc="" edc:mask="0x1" edc:name="CNIEA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA4" edc:desc="" edc:mask="0x1" edc:name="CNIEA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA5" edc:desc="" edc:mask="0x1" edc:name="CNIEA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA6" edc:desc="" edc:mask="0x1" edc:name="CNIEA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA7" edc:desc="" edc:mask="0x1" edc:name="CNIEA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA8" edc:desc="" edc:mask="0x1" edc:name="CNIEA8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA9" edc:desc="" edc:mask="0x1" edc:name="CNIEA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA10" edc:desc="" edc:mask="0x1" edc:name="CNIEA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA11" edc:desc="" edc:mask="0x1" edc:name="CNIEA11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA12" edc:desc="" edc:mask="0x1" edc:name="CNIEA12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA13" edc:desc="" edc:mask="0x1" edc:name="CNIEA13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA14" edc:desc="" edc:mask="0x1" edc:name="CNIEA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEA15" edc:desc="" edc:mask="0x1" edc:name="CNIEA15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820090" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNSTATA" edc:desc="" edc:grp="PORTA" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNSTATA" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATA0" edc:desc="" edc:mask="0x1" edc:name="CNSTATA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA1" edc:desc="" edc:mask="0x1" edc:name="CNSTATA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA2" edc:desc="" edc:mask="0x1" edc:name="CNSTATA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA3" edc:desc="" edc:mask="0x1" edc:name="CNSTATA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA4" edc:desc="" edc:mask="0x1" edc:name="CNSTATA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA5" edc:desc="" edc:mask="0x1" edc:name="CNSTATA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA6" edc:desc="" edc:mask="0x1" edc:name="CNSTATA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA7" edc:desc="" edc:mask="0x1" edc:name="CNSTATA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA8" edc:desc="" edc:mask="0x1" edc:name="CNSTATA8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA9" edc:desc="" edc:mask="0x1" edc:name="CNSTATA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA10" edc:desc="" edc:mask="0x1" edc:name="CNSTATA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA11" edc:desc="" edc:mask="0x1" edc:name="CNSTATA11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA12" edc:desc="" edc:mask="0x1" edc:name="CNSTATA12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA13" edc:desc="" edc:mask="0x1" edc:name="CNSTATA13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA14" edc:desc="" edc:mask="0x1" edc:name="CNSTATA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATA15" edc:desc="" edc:mask="0x1" edc:name="CNSTATA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
