Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8200A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNNEA" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNNEA" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEA0" edc:mask="0x1" edc:name="CNNEA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA1" edc:mask="0x1" edc:name="CNNEA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA2" edc:mask="0x1" edc:name="CNNEA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA3" edc:mask="0x1" edc:name="CNNEA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA4" edc:mask="0x1" edc:name="CNNEA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA5" edc:mask="0x1" edc:name="CNNEA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA6" edc:mask="0x1" edc:name="CNNEA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA7" edc:mask="0x1" edc:name="CNNEA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA8" edc:mask="0x1" edc:name="CNNEA8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA9" edc:mask="0x1" edc:name="CNNEA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA10" edc:mask="0x1" edc:name="CNNEA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA11" edc:mask="0x1" edc:name="CNNEA11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA12" edc:mask="0x1" edc:name="CNNEA12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA13" edc:mask="0x1" edc:name="CNNEA13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA14" edc:mask="0x1" edc:name="CNNEA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEA15" edc:mask="0x1" edc:name="CNNEA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8200B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNFA" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNFA" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFA0" edc:mask="0x1" edc:name="CNFA0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA1" edc:mask="0x1" edc:name="CNFA1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA2" edc:mask="0x1" edc:name="CNFA2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA3" edc:mask="0x1" edc:name="CNFA3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA4" edc:mask="0x1" edc:name="CNFA4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA5" edc:mask="0x1" edc:name="CNFA5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA6" edc:mask="0x1" edc:name="CNFA6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA7" edc:mask="0x1" edc:name="CNFA7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA8" edc:mask="0x1" edc:name="CNFA8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA9" edc:mask="0x1" edc:name="CNFA9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA10" edc:mask="0x1" edc:name="CNFA10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA11" edc:mask="0x1" edc:name="CNFA11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA12" edc:mask="0x1" edc:name="CNFA12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA13" edc:mask="0x1" edc:name="CNFA13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA14" edc:mask="0x1" edc:name="CNFA14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFA15" edc:mask="0x1" edc:name="CNFA15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8200C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="-------------------------------n" edc:cname="SRCON0A" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SRCON0A" edc:nzwidth="32" edc:por="-------------------------------0" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0A0" edc:mask="0x1" edc:name="SR0A0" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8200D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="1" edc:access="-------------------------------n" edc:cname="SRCON1A" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SRCON1A" edc:nzwidth="32" edc:por="-------------------------------0" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTA">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1A0" edc:mask="0x1" edc:name="SR1A0" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8200E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F820100" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="ANSELB" edc:desc="" edc:grp="PORTB" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------111111111111111" edc:name="ANSELB" edc:nzwidth="0x20" edc:por="-----------------111111111111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANSB0" edc:desc="" edc:mask="0x1" edc:name="ANSB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB1" edc:desc="" edc:mask="0x1" edc:name="ANSB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB2" edc:desc="" edc:mask="0x1" edc:name="ANSB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB3" edc:desc="" edc:mask="0x1" edc:name="ANSB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB4" edc:desc="" edc:mask="0x1" edc:name="ANSB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB5" edc:desc="" edc:mask="0x1" edc:name="ANSB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB6" edc:desc="" edc:mask="0x1" edc:name="ANSB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB7" edc:desc="" edc:mask="0x1" edc:name="ANSB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB8" edc:desc="" edc:mask="0x1" edc:name="ANSB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB9" edc:desc="" edc:mask="0x1" edc:name="ANSB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB10" edc:desc="" edc:mask="0x1" edc:name="ANSB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB11" edc:desc="" edc:mask="0x1" edc:name="ANSB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB12" edc:desc="" edc:mask="0x1" edc:name="ANSB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB13" edc:desc="" edc:mask="0x1" edc:name="ANSB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSB14" edc:desc="" edc:mask="0x1" edc:name="ANSB14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820110" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="TRISB" edc:desc="" edc:grp="PORTB" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------111111111111111" edc:name="TRISB" edc:nzwidth="0x20" edc:por="-----------------111111111111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISB0" edc:desc="" edc:mask="0x1" edc:name="TRISB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB1" edc:desc="" edc:mask="0x1" edc:name="TRISB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB2" edc:desc="" edc:mask="0x1" edc:name="TRISB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB3" edc:desc="" edc:mask="0x1" edc:name="TRISB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB8" edc:desc="" edc:mask="0x1" edc:name="TRISB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISB9" edc:desc="" edc:mask="0x1" edc:name="TRISB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB10" edc:desc="" edc:mask="0x1" edc:name="TRISB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISB11" edc:desc="" edc:mask="0x1" edc:name="TRISB11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISB12" edc:desc="" edc:mask="0x1" edc:name="TRISB12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISB13" edc:desc="" edc:mask="0x1" edc:name="TRISB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISB14" edc:desc="" edc:mask="0x1" edc:name="TRISB14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820120" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="PORTB" edc:desc="" edc:grp="PORTB" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------xxxxxxxxxxxxxxx" edc:name="PORTB" edc:nzwidth="0x20" edc:por="-----------------xxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB6" edc:desc="" edc:mask="0x1" edc:name="RB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB8" edc:desc="" edc:mask="0x1" edc:name="RB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RB9" edc:desc="" edc:mask="0x1" edc:name="RB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB10" edc:desc="" edc:mask="0x1" edc:name="RB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RB11" edc:desc="" edc:mask="0x1" edc:name="RB11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RB12" edc:desc="" edc:mask="0x1" edc:name="RB12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RB13" edc:desc="" edc:mask="0x1" edc:name="RB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RB14" edc:desc="" edc:mask="0x1" edc:name="RB14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820130" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="LATB" edc:desc="" edc:grp="PORTB" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------xxxxxxxxxxxxxxx" edc:name="LATB" edc:nzwidth="0x20" edc:por="-----------------xxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB8" edc:desc="" edc:mask="0x1" edc:name="LATB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATB9" edc:desc="" edc:mask="0x1" edc:name="LATB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB10" edc:desc="" edc:mask="0x1" edc:name="LATB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATB11" edc:desc="" edc:mask="0x1" edc:name="LATB11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATB12" edc:desc="" edc:mask="0x1" edc:name="LATB12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATB13" edc:desc="" edc:mask="0x1" edc:name="LATB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATB14" edc:desc="" edc:mask="0x1" edc:name="LATB14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
