Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F820140" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="ODCB" edc:desc="" edc:grp="PORTB" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="ODCB" edc:nzwidth="0x20" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCB0" edc:desc="" edc:mask="0x1" edc:name="ODCB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB1" edc:desc="" edc:mask="0x1" edc:name="ODCB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB2" edc:desc="" edc:mask="0x1" edc:name="ODCB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB3" edc:desc="" edc:mask="0x1" edc:name="ODCB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB4" edc:desc="" edc:mask="0x1" edc:name="ODCB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB5" edc:desc="" edc:mask="0x1" edc:name="ODCB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB6" edc:desc="" edc:mask="0x1" edc:name="ODCB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB7" edc:desc="" edc:mask="0x1" edc:name="ODCB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB8" edc:desc="" edc:mask="0x1" edc:name="ODCB8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCB9" edc:desc="" edc:mask="0x1" edc:name="ODCB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB10" edc:desc="" edc:mask="0x1" edc:name="ODCB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCB11" edc:desc="" edc:mask="0x1" edc:name="ODCB11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCB12" edc:desc="" edc:mask="0x1" edc:name="ODCB12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCB13" edc:desc="" edc:mask="0x1" edc:name="ODCB13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCB14" edc:desc="" edc:mask="0x1" edc:name="ODCB14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820150" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNPUB" edc:desc="" edc:grp="PORTB" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNPUB" edc:nzwidth="0x20" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUB0" edc:desc="" edc:mask="0x1" edc:name="CNPUB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB1" edc:desc="" edc:mask="0x1" edc:name="CNPUB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB2" edc:desc="" edc:mask="0x1" edc:name="CNPUB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB3" edc:desc="" edc:mask="0x1" edc:name="CNPUB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB4" edc:desc="" edc:mask="0x1" edc:name="CNPUB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB5" edc:desc="" edc:mask="0x1" edc:name="CNPUB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB6" edc:desc="" edc:mask="0x1" edc:name="CNPUB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB7" edc:desc="" edc:mask="0x1" edc:name="CNPUB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB8" edc:desc="" edc:mask="0x1" edc:name="CNPUB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB9" edc:desc="" edc:mask="0x1" edc:name="CNPUB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB10" edc:desc="" edc:mask="0x1" edc:name="CNPUB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB11" edc:desc="" edc:mask="0x1" edc:name="CNPUB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB12" edc:desc="" edc:mask="0x1" edc:name="CNPUB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB13" edc:desc="" edc:mask="0x1" edc:name="CNPUB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUB14" edc:desc="" edc:mask="0x1" edc:name="CNPUB14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820160" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNPDB" edc:desc="" edc:grp="PORTB" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNPDB" edc:nzwidth="0x20" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDB0" edc:desc="" edc:mask="0x1" edc:name="CNPDB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB1" edc:desc="" edc:mask="0x1" edc:name="CNPDB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB2" edc:desc="" edc:mask="0x1" edc:name="CNPDB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB3" edc:desc="" edc:mask="0x1" edc:name="CNPDB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB4" edc:desc="" edc:mask="0x1" edc:name="CNPDB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB5" edc:desc="" edc:mask="0x1" edc:name="CNPDB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB6" edc:desc="" edc:mask="0x1" edc:name="CNPDB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB7" edc:desc="" edc:mask="0x1" edc:name="CNPDB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB8" edc:desc="" edc:mask="0x1" edc:name="CNPDB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB9" edc:desc="" edc:mask="0x1" edc:name="CNPDB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB10" edc:desc="" edc:mask="0x1" edc:name="CNPDB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB11" edc:desc="" edc:mask="0x1" edc:name="CNPDB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB12" edc:desc="" edc:mask="0x1" edc:name="CNPDB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB13" edc:desc="" edc:mask="0x1" edc:name="CNPDB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDB14" edc:desc="" edc:mask="0x1" edc:name="CNPDB14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
