Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F820170" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="----------------n-n-n-----------" edc:cname="CNCONB" edc:desc="" edc:grp="PORTB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0-0-0-----------" edc:name="CNCONB" edc:nzwidth="0x20" edc:por="----------------0-0-0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE B" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820180" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNENB" edc:desc="" edc:grp="PORTB" edc:impl="0xffc07fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNENB" edc:nzwidth="0x20" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEB0" edc:desc="" edc:mask="0x1" edc:name="CNIEB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB1" edc:desc="" edc:mask="0x1" edc:name="CNIEB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB2" edc:desc="" edc:mask="0x1" edc:name="CNIEB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB3" edc:desc="" edc:mask="0x1" edc:name="CNIEB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB4" edc:desc="" edc:mask="0x1" edc:name="CNIEB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB5" edc:desc="" edc:mask="0x1" edc:name="CNIEB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB6" edc:desc="" edc:mask="0x1" edc:name="CNIEB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB7" edc:desc="" edc:mask="0x1" edc:name="CNIEB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB8" edc:desc="" edc:mask="0x1" edc:name="CNIEB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB9" edc:desc="" edc:mask="0x1" edc:name="CNIEB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB10" edc:desc="" edc:mask="0x1" edc:name="CNIEB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB11" edc:desc="" edc:mask="0x1" edc:name="CNIEB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB12" edc:desc="" edc:mask="0x1" edc:name="CNIEB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB13" edc:desc="" edc:mask="0x1" edc:name="CNIEB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEB14" edc:desc="" edc:mask="0x1" edc:name="CNIEB14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820190" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNSTATB" edc:desc="" edc:grp="PORTB" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNSTATB" edc:nzwidth="0x20" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATB0" edc:desc="" edc:mask="0x1" edc:name="CNSTATB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB1" edc:desc="" edc:mask="0x1" edc:name="CNSTATB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB2" edc:desc="" edc:mask="0x1" edc:name="CNSTATB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB3" edc:desc="" edc:mask="0x1" edc:name="CNSTATB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB4" edc:desc="" edc:mask="0x1" edc:name="CNSTATB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB5" edc:desc="" edc:mask="0x1" edc:name="CNSTATB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB6" edc:desc="" edc:mask="0x1" edc:name="CNSTATB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB7" edc:desc="" edc:mask="0x1" edc:name="CNSTATB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB8" edc:desc="" edc:mask="0x1" edc:name="CNSTATB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB9" edc:desc="" edc:mask="0x1" edc:name="CNSTATB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB10" edc:desc="" edc:mask="0x1" edc:name="CNSTATB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB11" edc:desc="" edc:mask="0x1" edc:name="CNSTATB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB12" edc:desc="" edc:mask="0x1" edc:name="CNSTATB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB13" edc:desc="" edc:mask="0x1" edc:name="CNSTATB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATB14" edc:desc="" edc:mask="0x1" edc:name="CNSTATB14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8201A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNNEB" edc:desc="" edc:impl="0x7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNNEB" edc:nzwidth="32" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEB0" edc:mask="0x1" edc:name="CNNEB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB1" edc:mask="0x1" edc:name="CNNEB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB2" edc:mask="0x1" edc:name="CNNEB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB3" edc:mask="0x1" edc:name="CNNEB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB4" edc:mask="0x1" edc:name="CNNEB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB5" edc:mask="0x1" edc:name="CNNEB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB6" edc:mask="0x1" edc:name="CNNEB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB7" edc:mask="0x1" edc:name="CNNEB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB8" edc:mask="0x1" edc:name="CNNEB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB9" edc:mask="0x1" edc:name="CNNEB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB10" edc:mask="0x1" edc:name="CNNEB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB11" edc:mask="0x1" edc:name="CNNEB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB12" edc:mask="0x1" edc:name="CNNEB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB13" edc:mask="0x1" edc:name="CNNEB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEB14" edc:mask="0x1" edc:name="CNNEB14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8201B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="2" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNFB" edc:desc="" edc:impl="0x7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNFB" edc:nzwidth="32" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFB0" edc:mask="0x1" edc:name="CNFB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB1" edc:mask="0x1" edc:name="CNFB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB2" edc:mask="0x1" edc:name="CNFB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB3" edc:mask="0x1" edc:name="CNFB3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB4" edc:mask="0x1" edc:name="CNFB4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB5" edc:mask="0x1" edc:name="CNFB5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB6" edc:mask="0x1" edc:name="CNFB6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB7" edc:mask="0x1" edc:name="CNFB7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB8" edc:mask="0x1" edc:name="CNFB8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB9" edc:mask="0x1" edc:name="CNFB9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB10" edc:mask="0x1" edc:name="CNFB10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB11" edc:mask="0x1" edc:name="CNFB11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB12" edc:mask="0x1" edc:name="CNFB12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB13" edc:mask="0x1" edc:name="CNFB13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFB14" edc:mask="0x1" edc:name="CNFB14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
