Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:AdjustPoint edc:_addr="0x1F8201C0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8201D0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8201E0" edc:offset="0x20"/>
      <edc:AdjustPoint edc:_addr="0x1F820200" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F820210" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TRISC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111111111111111" edc:name="TRISC" edc:nzwidth="0x20" edc:por="----------------1111111111111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISC0" edc:desc="" edc:mask="0x1" edc:name="TRISC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC1" edc:desc="" edc:mask="0x1" edc:name="TRISC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC2" edc:desc="" edc:mask="0x1" edc:name="TRISC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC3" edc:desc="" edc:mask="0x1" edc:name="TRISC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC4" edc:desc="" edc:mask="0x1" edc:name="TRISC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC5" edc:desc="" edc:mask="0x1" edc:name="TRISC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC6" edc:desc="" edc:mask="0x1" edc:name="TRISC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC7" edc:desc="" edc:mask="0x1" edc:name="TRISC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC8" edc:desc="" edc:mask="0x1" edc:name="TRISC8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISC9" edc:desc="" edc:mask="0x1" edc:name="TRISC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC10" edc:desc="" edc:mask="0x1" edc:name="TRISC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC11" edc:desc="" edc:mask="0x1" edc:name="TRISC11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISC12" edc:desc="" edc:mask="0x1" edc:name="TRISC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISC13" edc:desc="" edc:mask="0x1" edc:name="TRISC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISC14" edc:desc="" edc:mask="0x1" edc:name="TRISC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISC15" edc:desc="" edc:mask="0x1" edc:name="TRISC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820220" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PORTC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="PORTC" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RC0" edc:desc="" edc:mask="0x1" edc:name="RC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC1" edc:desc="" edc:mask="0x1" edc:name="RC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC2" edc:desc="" edc:mask="0x1" edc:name="RC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC3" edc:desc="" edc:mask="0x1" edc:name="RC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC4" edc:desc="" edc:mask="0x1" edc:name="RC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC5" edc:desc="" edc:mask="0x1" edc:name="RC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC6" edc:desc="" edc:mask="0x1" edc:name="RC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC7" edc:desc="" edc:mask="0x1" edc:name="RC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC8" edc:desc="" edc:mask="0x1" edc:name="RC8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RC9" edc:desc="" edc:mask="0x1" edc:name="RC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC10" edc:desc="" edc:mask="0x1" edc:name="RC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC11" edc:desc="" edc:mask="0x1" edc:name="RC11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RC12" edc:desc="" edc:mask="0x1" edc:name="RC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RC13" edc:desc="" edc:mask="0x1" edc:name="RC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RC14" edc:desc="" edc:mask="0x1" edc:name="RC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RC15" edc:desc="" edc:mask="0x1" edc:name="RC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820230" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="LATC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="LATC" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATC0" edc:desc="" edc:mask="0x1" edc:name="LATC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC2" edc:desc="" edc:mask="0x1" edc:name="LATC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC3" edc:desc="" edc:mask="0x1" edc:name="LATC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC4" edc:desc="" edc:mask="0x1" edc:name="LATC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC5" edc:desc="" edc:mask="0x1" edc:name="LATC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC6" edc:desc="" edc:mask="0x1" edc:name="LATC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC7" edc:desc="" edc:mask="0x1" edc:name="LATC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC8" edc:desc="" edc:mask="0x1" edc:name="LATC8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC9" edc:desc="" edc:mask="0x1" edc:name="LATC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC10" edc:desc="" edc:mask="0x1" edc:name="LATC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC11" edc:desc="" edc:mask="0x1" edc:name="LATC11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC12" edc:desc="" edc:mask="0x1" edc:name="LATC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC13" edc:desc="" edc:mask="0x1" edc:name="LATC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC14" edc:desc="" edc:mask="0x1" edc:name="LATC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC15" edc:desc="" edc:mask="0x1" edc:name="LATC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820240" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ODCC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ODCC" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCC0" edc:desc="" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC1" edc:desc="" edc:mask="0x1" edc:name="ODCC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC2" edc:desc="" edc:mask="0x1" edc:name="ODCC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC3" edc:desc="" edc:mask="0x1" edc:name="ODCC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC4" edc:desc="" edc:mask="0x1" edc:name="ODCC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC5" edc:desc="" edc:mask="0x1" edc:name="ODCC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC6" edc:desc="" edc:mask="0x1" edc:name="ODCC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC7" edc:desc="" edc:mask="0x1" edc:name="ODCC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC8" edc:desc="" edc:mask="0x1" edc:name="ODCC8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC9" edc:desc="" edc:mask="0x1" edc:name="ODCC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC10" edc:desc="" edc:mask="0x1" edc:name="ODCC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC11" edc:desc="" edc:mask="0x1" edc:name="ODCC11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC12" edc:desc="" edc:mask="0x1" edc:name="ODCC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC13" edc:desc="" edc:mask="0x1" edc:name="ODCC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC14" edc:desc="" edc:mask="0x1" edc:name="ODCC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC15" edc:desc="" edc:mask="0x1" edc:name="ODCC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
