Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F820250" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPUC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNPUC" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUC0" edc:desc="" edc:mask="0x1" edc:name="CNPUC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC1" edc:desc="" edc:mask="0x1" edc:name="CNPUC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC2" edc:desc="" edc:mask="0x1" edc:name="CNPUC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC3" edc:desc="" edc:mask="0x1" edc:name="CNPUC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC4" edc:desc="" edc:mask="0x1" edc:name="CNPUC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC5" edc:desc="" edc:mask="0x1" edc:name="CNPUC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC6" edc:desc="" edc:mask="0x1" edc:name="CNPUC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC7" edc:desc="" edc:mask="0x1" edc:name="CNPUC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC8" edc:desc="" edc:mask="0x1" edc:name="CNPUC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC9" edc:desc="" edc:mask="0x1" edc:name="CNPUC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC10" edc:desc="" edc:mask="0x1" edc:name="CNPUC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC11" edc:desc="" edc:mask="0x1" edc:name="CNPUC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC12" edc:desc="" edc:mask="0x1" edc:name="CNPUC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC13" edc:desc="" edc:mask="0x1" edc:name="CNPUC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC14" edc:desc="" edc:mask="0x1" edc:name="CNPUC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC15" edc:desc="" edc:mask="0x1" edc:name="CNPUC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820260" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPDC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNPDC" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDC0" edc:desc="" edc:mask="0x1" edc:name="CNPDC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC1" edc:desc="" edc:mask="0x1" edc:name="CNPDC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC2" edc:desc="" edc:mask="0x1" edc:name="CNPDC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC3" edc:desc="" edc:mask="0x1" edc:name="CNPDC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC4" edc:desc="" edc:mask="0x1" edc:name="CNPDC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC5" edc:desc="" edc:mask="0x1" edc:name="CNPDC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC6" edc:desc="" edc:mask="0x1" edc:name="CNPDC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC7" edc:desc="" edc:mask="0x1" edc:name="CNPDC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC8" edc:desc="" edc:mask="0x1" edc:name="CNPDC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC9" edc:desc="" edc:mask="0x1" edc:name="CNPDC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC10" edc:desc="" edc:mask="0x1" edc:name="CNPDC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC11" edc:desc="" edc:mask="0x1" edc:name="CNPDC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC12" edc:desc="" edc:mask="0x1" edc:name="CNPDC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC13" edc:desc="" edc:mask="0x1" edc:name="CNPDC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC14" edc:desc="" edc:mask="0x1" edc:name="CNPDC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC15" edc:desc="" edc:mask="0x1" edc:name="CNPDC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820270" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------n-n-n-----------" edc:cname="CNCONC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0-0-0-----------" edc:name="CNCONC" edc:nzwidth="0x20" edc:por="----------------0-0-0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE C" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820280" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNENC" edc:desc="" edc:grp="PORTC" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNENC" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEC0" edc:desc="" edc:mask="0x1" edc:name="CNIEC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC1" edc:desc="" edc:mask="0x1" edc:name="CNIEC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC2" edc:desc="" edc:mask="0x1" edc:name="CNIEC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC3" edc:desc="" edc:mask="0x1" edc:name="CNIEC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC4" edc:desc="" edc:mask="0x1" edc:name="CNIEC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC5" edc:desc="" edc:mask="0x1" edc:name="CNIEC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC6" edc:desc="" edc:mask="0x1" edc:name="CNIEC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC7" edc:desc="" edc:mask="0x1" edc:name="CNIEC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC8" edc:desc="" edc:mask="0x1" edc:name="CNIEC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC9" edc:desc="" edc:mask="0x1" edc:name="CNIEC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC10" edc:desc="" edc:mask="0x1" edc:name="CNIEC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC11" edc:desc="" edc:mask="0x1" edc:name="CNIEC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC12" edc:desc="" edc:mask="0x1" edc:name="CNIEC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC13" edc:desc="" edc:mask="0x1" edc:name="CNIEC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC14" edc:desc="" edc:mask="0x1" edc:name="CNIEC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEC15" edc:desc="" edc:mask="0x1" edc:name="CNIEC15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
