Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F820290" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNSTATC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNSTATC" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATC0" edc:desc="" edc:mask="0x1" edc:name="CNSTATC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC1" edc:desc="" edc:mask="0x1" edc:name="CNSTATC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC2" edc:desc="" edc:mask="0x1" edc:name="CNSTATC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC3" edc:desc="" edc:mask="0x1" edc:name="CNSTATC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC4" edc:desc="" edc:mask="0x1" edc:name="CNSTATC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC5" edc:desc="" edc:mask="0x1" edc:name="CNSTATC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC6" edc:desc="" edc:mask="0x1" edc:name="CNSTATC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC7" edc:desc="" edc:mask="0x1" edc:name="CNSTATC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC8" edc:desc="" edc:mask="0x1" edc:name="CNSTATC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC9" edc:desc="" edc:mask="0x1" edc:name="CNSTATC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC10" edc:desc="" edc:mask="0x1" edc:name="CNSTATC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC11" edc:desc="" edc:mask="0x1" edc:name="CNSTATC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC12" edc:desc="" edc:mask="0x1" edc:name="CNSTATC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC13" edc:desc="" edc:mask="0x1" edc:name="CNSTATC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC14" edc:desc="" edc:mask="0x1" edc:name="CNSTATC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATC15" edc:desc="" edc:mask="0x1" edc:name="CNSTATC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8202A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNNEC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNNEC" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEC0" edc:mask="0x1" edc:name="CNNEC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC1" edc:mask="0x1" edc:name="CNNEC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC2" edc:mask="0x1" edc:name="CNNEC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC3" edc:mask="0x1" edc:name="CNNEC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC4" edc:mask="0x1" edc:name="CNNEC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC5" edc:mask="0x1" edc:name="CNNEC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC6" edc:mask="0x1" edc:name="CNNEC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC7" edc:mask="0x1" edc:name="CNNEC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC8" edc:mask="0x1" edc:name="CNNEC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC9" edc:mask="0x1" edc:name="CNNEC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC10" edc:mask="0x1" edc:name="CNNEC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC11" edc:mask="0x1" edc:name="CNNEC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC12" edc:mask="0x1" edc:name="CNNEC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC13" edc:mask="0x1" edc:name="CNNEC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC14" edc:mask="0x1" edc:name="CNNEC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEC15" edc:mask="0x1" edc:name="CNNEC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8202B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNFC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNFC" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFC0" edc:mask="0x1" edc:name="CNFC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC1" edc:mask="0x1" edc:name="CNFC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC2" edc:mask="0x1" edc:name="CNFC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC3" edc:mask="0x1" edc:name="CNFC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC4" edc:mask="0x1" edc:name="CNFC4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC5" edc:mask="0x1" edc:name="CNFC5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC6" edc:mask="0x1" edc:name="CNFC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC7" edc:mask="0x1" edc:name="CNFC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC8" edc:mask="0x1" edc:name="CNFC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC9" edc:mask="0x1" edc:name="CNFC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC10" edc:mask="0x1" edc:name="CNFC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC11" edc:mask="0x1" edc:name="CNFC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC12" edc:mask="0x1" edc:name="CNFC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC13" edc:mask="0x1" edc:name="CNFC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC14" edc:mask="0x1" edc:name="CNFC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC15" edc:mask="0x1" edc:name="CNFC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8202C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnn-------nnnnnn" edc:cname="SRCON0C" edc:desc="" edc:impl="0xe03f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-------000000" edc:name="SRCON0C" edc:nzwidth="32" edc:por="----------------000-------000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0C0" edc:mask="0x1" edc:name="SR0C0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SR0C1" edc:mask="0x1" edc:name="SR0C1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C2" edc:mask="0x1" edc:name="SR0C2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C3" edc:mask="0x1" edc:name="SR0C3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C4" edc:mask="0x1" edc:name="SR0C4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C5" edc:mask="0x1" edc:name="SR0C5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0C13" edc:mask="0x1" edc:name="SR0C13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C14" edc:mask="0x1" edc:name="SR0C14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C15" edc:mask="0x1" edc:name="SR0C15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8202D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnn-------nnnnnn" edc:cname="SRCON1C" edc:desc="" edc:impl="0xe03f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-------000000" edc:name="SRCON1C" edc:nzwidth="32" edc:por="----------------000-------000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1C0" edc:mask="0x1" edc:name="SR1C0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C1" edc:mask="0x1" edc:name="SR1C1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C2" edc:mask="0x1" edc:name="SR1C2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C3" edc:mask="0x1" edc:name="SR1C3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C4" edc:mask="0x1" edc:name="SR1C4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C5" edc:mask="0x1" edc:name="SR1C5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1C13" edc:mask="0x1" edc:name="SR1C13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C14" edc:mask="0x1" edc:name="SR1C14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C15" edc:mask="0x1" edc:name="SR1C15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8202E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F820300" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------------------nn--" edc:cname="ANSELK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff000c" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------11--" edc:name="ANSELK" edc:nzwidth="0x20" edc:por="----------------------------11--" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSK2" edc:desc="" edc:mask="0x1" edc:name="ANSK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSK3" edc:desc="" edc:mask="0x1" edc:name="ANSK3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820310" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="TRISK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------111111111111111" edc:name="TRISK" edc:nzwidth="0x20" edc:por="-----------------111111111111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISK0" edc:desc="" edc:mask="0x1" edc:name="TRISK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK1" edc:desc="" edc:mask="0x1" edc:name="TRISK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK2" edc:desc="" edc:mask="0x1" edc:name="TRISK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK3" edc:desc="" edc:mask="0x1" edc:name="TRISK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK4" edc:desc="" edc:mask="0x1" edc:name="TRISK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK5" edc:desc="" edc:mask="0x1" edc:name="TRISK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK6" edc:desc="" edc:mask="0x1" edc:name="TRISK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK7" edc:desc="" edc:mask="0x1" edc:name="TRISK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK8" edc:desc="" edc:mask="0x1" edc:name="TRISK8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISK9" edc:desc="" edc:mask="0x1" edc:name="TRISK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK10" edc:desc="" edc:mask="0x1" edc:name="TRISK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISK11" edc:desc="" edc:mask="0x1" edc:name="TRISK11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISK12" edc:desc="" edc:mask="0x1" edc:name="TRISK12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISK13" edc:desc="" edc:mask="0x1" edc:name="TRISK13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISK14" edc:desc="" edc:mask="0x1" edc:name="TRISK14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820320" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="PORTK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------xxxxxxxxxxxxxxx" edc:name="PORTK" edc:nzwidth="0x20" edc:por="-----------------xxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RK0" edc:desc="" edc:mask="0x1" edc:name="RK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK1" edc:desc="" edc:mask="0x1" edc:name="RK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK2" edc:desc="" edc:mask="0x1" edc:name="RK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK3" edc:desc="" edc:mask="0x1" edc:name="RK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK4" edc:desc="" edc:mask="0x1" edc:name="RK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK5" edc:desc="" edc:mask="0x1" edc:name="RK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK6" edc:desc="" edc:mask="0x1" edc:name="RK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK7" edc:desc="" edc:mask="0x1" edc:name="RK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK8" edc:desc="" edc:mask="0x1" edc:name="RK8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RK9" edc:desc="" edc:mask="0x1" edc:name="RK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK10" edc:desc="" edc:mask="0x1" edc:name="RK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RK11" edc:desc="" edc:mask="0x1" edc:name="RK11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RK12" edc:desc="" edc:mask="0x1" edc:name="RK12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RK13" edc:desc="" edc:mask="0x1" edc:name="RK13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RK14" edc:desc="" edc:mask="0x1" edc:name="RK14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
