Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F820330" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="LATK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------xxxxxxxxxxxxxxx" edc:name="LATK" edc:nzwidth="0x20" edc:por="-----------------xxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATK0" edc:desc="" edc:mask="0x1" edc:name="LATK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK1" edc:desc="" edc:mask="0x1" edc:name="LATK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK2" edc:desc="" edc:mask="0x1" edc:name="LATK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK3" edc:desc="" edc:mask="0x1" edc:name="LATK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK4" edc:desc="" edc:mask="0x1" edc:name="LATK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK5" edc:desc="" edc:mask="0x1" edc:name="LATK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK6" edc:desc="" edc:mask="0x1" edc:name="LATK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK7" edc:desc="" edc:mask="0x1" edc:name="LATK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK8" edc:desc="" edc:mask="0x1" edc:name="LATK8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATK9" edc:desc="" edc:mask="0x1" edc:name="LATK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK10" edc:desc="" edc:mask="0x1" edc:name="LATK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATK11" edc:desc="" edc:mask="0x1" edc:name="LATK11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATK12" edc:desc="" edc:mask="0x1" edc:name="LATK12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATK13" edc:desc="" edc:mask="0x1" edc:name="LATK13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATK14" edc:desc="" edc:mask="0x1" edc:name="LATK14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820340" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="ODCK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="ODCK" edc:nzwidth="0x20" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCK0" edc:desc="" edc:mask="0x1" edc:name="ODCK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK1" edc:desc="" edc:mask="0x1" edc:name="ODCK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK2" edc:desc="" edc:mask="0x1" edc:name="ODCK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK3" edc:desc="" edc:mask="0x1" edc:name="ODCK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK4" edc:desc="" edc:mask="0x1" edc:name="ODCK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK5" edc:desc="" edc:mask="0x1" edc:name="ODCK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK6" edc:desc="" edc:mask="0x1" edc:name="ODCK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK7" edc:desc="" edc:mask="0x1" edc:name="ODCK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK8" edc:desc="" edc:mask="0x1" edc:name="ODCK8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCK9" edc:desc="" edc:mask="0x1" edc:name="ODCK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK10" edc:desc="" edc:mask="0x1" edc:name="ODCK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCK11" edc:desc="" edc:mask="0x1" edc:name="ODCK11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCK12" edc:desc="" edc:mask="0x1" edc:name="ODCK12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCK13" edc:desc="" edc:mask="0x1" edc:name="ODCK13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCK14" edc:desc="" edc:mask="0x1" edc:name="ODCK14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820350" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNPUK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNPUK" edc:nzwidth="0x20" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUK0" edc:desc="" edc:mask="0x1" edc:name="CNPUK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK1" edc:desc="" edc:mask="0x1" edc:name="CNPUK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK2" edc:desc="" edc:mask="0x1" edc:name="CNPUK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK3" edc:desc="" edc:mask="0x1" edc:name="CNPUK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK4" edc:desc="" edc:mask="0x1" edc:name="CNPUK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK5" edc:desc="" edc:mask="0x1" edc:name="CNPUK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK6" edc:desc="" edc:mask="0x1" edc:name="CNPUK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK7" edc:desc="" edc:mask="0x1" edc:name="CNPUK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK8" edc:desc="" edc:mask="0x1" edc:name="CNPUK8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK9" edc:desc="" edc:mask="0x1" edc:name="CNPUK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK10" edc:desc="" edc:mask="0x1" edc:name="CNPUK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK11" edc:desc="" edc:mask="0x1" edc:name="CNPUK11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK12" edc:desc="" edc:mask="0x1" edc:name="CNPUK12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK13" edc:desc="" edc:mask="0x1" edc:name="CNPUK13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUK14" edc:desc="" edc:mask="0x1" edc:name="CNPUK14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820360" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNPDK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNPDK" edc:nzwidth="0x20" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDK0" edc:desc="" edc:mask="0x1" edc:name="CNPDK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK1" edc:desc="" edc:mask="0x1" edc:name="CNPDK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK2" edc:desc="" edc:mask="0x1" edc:name="CNPDK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK3" edc:desc="" edc:mask="0x1" edc:name="CNPDK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK4" edc:desc="" edc:mask="0x1" edc:name="CNPDK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK5" edc:desc="" edc:mask="0x1" edc:name="CNPDK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK6" edc:desc="" edc:mask="0x1" edc:name="CNPDK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK7" edc:desc="" edc:mask="0x1" edc:name="CNPDK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK8" edc:desc="" edc:mask="0x1" edc:name="CNPDK8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK9" edc:desc="" edc:mask="0x1" edc:name="CNPDK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK10" edc:desc="" edc:mask="0x1" edc:name="CNPDK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK11" edc:desc="" edc:mask="0x1" edc:name="CNPDK11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK12" edc:desc="" edc:mask="0x1" edc:name="CNPDK12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK13" edc:desc="" edc:mask="0x1" edc:name="CNPDK13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDK14" edc:desc="" edc:mask="0x1" edc:name="CNPDK14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820370" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------n-n-n-----------" edc:cname="CNCONK" edc:desc="" edc:grp="PORTK" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0-0-0-----------" edc:name="CNCONK" edc:nzwidth="0x20" edc:por="----------------0-0-0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE K" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820380" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNENK" edc:desc="" edc:grp="PORTK" edc:impl="0xffc07fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNENK" edc:nzwidth="0x20" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEK0" edc:desc="" edc:mask="0x1" edc:name="CNIEK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK1" edc:desc="" edc:mask="0x1" edc:name="CNIEK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK2" edc:desc="" edc:mask="0x1" edc:name="CNIEK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK3" edc:desc="" edc:mask="0x1" edc:name="CNIEK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK4" edc:desc="" edc:mask="0x1" edc:name="CNIEK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK5" edc:desc="" edc:mask="0x1" edc:name="CNIEK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK6" edc:desc="" edc:mask="0x1" edc:name="CNIEK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK7" edc:desc="" edc:mask="0x1" edc:name="CNIEK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK8" edc:desc="" edc:mask="0x1" edc:name="CNIEK8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK9" edc:desc="" edc:mask="0x1" edc:name="CNIEK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK10" edc:desc="" edc:mask="0x1" edc:name="CNIEK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK11" edc:desc="" edc:mask="0x1" edc:name="CNIEK11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK12" edc:desc="" edc:mask="0x1" edc:name="CNIEK12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK13" edc:desc="" edc:mask="0x1" edc:name="CNIEK13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEK14" edc:desc="" edc:mask="0x1" edc:name="CNIEK14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820390" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNSTATK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNSTATK" edc:nzwidth="0x20" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATK0" edc:desc="" edc:mask="0x1" edc:name="CNSTATK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK1" edc:desc="" edc:mask="0x1" edc:name="CNSTATK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK2" edc:desc="" edc:mask="0x1" edc:name="CNSTATK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK3" edc:desc="" edc:mask="0x1" edc:name="CNSTATK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK4" edc:desc="" edc:mask="0x1" edc:name="CNSTATK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK5" edc:desc="" edc:mask="0x1" edc:name="CNSTATK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK6" edc:desc="" edc:mask="0x1" edc:name="CNSTATK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK7" edc:desc="" edc:mask="0x1" edc:name="CNSTATK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK8" edc:desc="" edc:mask="0x1" edc:name="CNSTATK8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK9" edc:desc="" edc:mask="0x1" edc:name="CNSTATK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK10" edc:desc="" edc:mask="0x1" edc:name="CNSTATK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK11" edc:desc="" edc:mask="0x1" edc:name="CNSTATK11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK12" edc:desc="" edc:mask="0x1" edc:name="CNSTATK12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK13" edc:desc="" edc:mask="0x1" edc:name="CNSTATK13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATK14" edc:desc="" edc:mask="0x1" edc:name="CNSTATK14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
