Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8203A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNNEK" edc:desc="" edc:impl="0x7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNNEK" edc:nzwidth="32" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEK0" edc:mask="0x1" edc:name="CNNEK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK1" edc:mask="0x1" edc:name="CNNEK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK2" edc:mask="0x1" edc:name="CNNEK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK3" edc:mask="0x1" edc:name="CNNEK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK4" edc:mask="0x1" edc:name="CNNEK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK5" edc:mask="0x1" edc:name="CNNEK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK6" edc:mask="0x1" edc:name="CNNEK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK7" edc:mask="0x1" edc:name="CNNEK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK8" edc:mask="0x1" edc:name="CNNEK8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK9" edc:mask="0x1" edc:name="CNNEK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK10" edc:mask="0x1" edc:name="CNNEK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK11" edc:mask="0x1" edc:name="CNNEK11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK12" edc:mask="0x1" edc:name="CNNEK12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK13" edc:mask="0x1" edc:name="CNNEK13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEK14" edc:mask="0x1" edc:name="CNNEK14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8203B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------nnnnnnnnnnnnnnn" edc:cname="CNFK" edc:desc="" edc:impl="0x7fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------000000000000000" edc:name="CNFK" edc:nzwidth="32" edc:por="-----------------000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFK0" edc:mask="0x1" edc:name="CNFK0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK1" edc:mask="0x1" edc:name="CNFK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK2" edc:mask="0x1" edc:name="CNFK2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK3" edc:mask="0x1" edc:name="CNFK3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK4" edc:mask="0x1" edc:name="CNFK4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK5" edc:mask="0x1" edc:name="CNFK5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK6" edc:mask="0x1" edc:name="CNFK6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK7" edc:mask="0x1" edc:name="CNFK7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK8" edc:mask="0x1" edc:name="CNFK8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK9" edc:mask="0x1" edc:name="CNFK9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK10" edc:mask="0x1" edc:name="CNFK10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK11" edc:mask="0x1" edc:name="CNFK11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK12" edc:mask="0x1" edc:name="CNFK12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK13" edc:mask="0x1" edc:name="CNFK13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFK14" edc:mask="0x1" edc:name="CNFK14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8203C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------nn-------------" edc:cname="SRCON0K" edc:desc="" edc:impl="0x6000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------00-------------" edc:name="SRCON0K" edc:nzwidth="32" edc:por="-----------------00-------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0K13" edc:mask="0x1" edc:name="SR0K13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0K14" edc:mask="0x1" edc:name="SR0K14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8203D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="-----------------nn-------------" edc:cname="SRCON1K" edc:desc="" edc:impl="0x6000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------00-------------" edc:name="SRCON1K" edc:nzwidth="32" edc:por="-----------------00-------------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1K13" edc:mask="0x1" edc:name="SR1K13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1K14" edc:mask="0x1" edc:name="SR1K14" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8203E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F820400" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:access="---------nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="I2C1CON" edc:desc="" edc:impl="0x7fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------00000000x01000000000000" edc:name="I2C1CON" edc:nzwidth="32" edc:por="---------00000000x01000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="I2C1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEN" edc:desc="" edc:mask="0x1" edc:name="SEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RSEN" edc:desc="" edc:mask="0x1" edc:name="RSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PEN" edc:desc="" edc:mask="0x1" edc:name="PEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RCEN" edc:desc="" edc:mask="0x1" edc:name="RCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACKEN" edc:desc="" edc:mask="0x1" edc:name="ACKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACKDT" edc:desc="" edc:mask="0x1" edc:name="ACKDT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="STREN" edc:desc="" edc:mask="0x1" edc:name="STREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GCEN" edc:desc="" edc:mask="0x1" edc:name="GCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:desc="" edc:mask="0x1" edc:name="SMEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DISSLW" edc:desc="" edc:mask="0x1" edc:name="DISSLW" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="A10M" edc:desc="" edc:mask="0x1" edc:name="A10M" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="STRICT" edc:desc="" edc:mask="0x1" edc:name="STRICT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCLREL" edc:desc="" edc:mask="0x1" edc:name="SCLREL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DHEN" edc:desc="" edc:mask="0x1" edc:name="DHEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AHEN" edc:desc="" edc:mask="0x1" edc:name="AHEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SBCDE" edc:desc="" edc:mask="0x1" edc:name="SBCDE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SDAHT" edc:desc="" edc:mask="0x1" edc:name="SDAHT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BOEN" edc:desc="" edc:mask="0x1" edc:name="BOEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCIE" edc:desc="" edc:mask="0x1" edc:name="SCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PCIE" edc:desc="" edc:mask="0x1" edc:name="PCIE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="11"/>
            <edc:SFRFieldDef edc:cname="IPMIEN" edc:desc="" edc:mask="0x1" edc:name="IPMIEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="I2CSIDL" edc:desc="" edc:mask="0x1" edc:name="I2CSIDL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="I2CEN" edc:desc="" edc:mask="0x1" edc:name="I2CEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="I2C 1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820410" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:access="----------------rrr--crrccrccrrr" edc:cname="I2C1STAT" edc:desc="" edc:impl="0xe7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000--00000000000" edc:name="I2C1STAT" edc:nzwidth="32" edc:por="----------------000--00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TBF" edc:desc="" edc:mask="0x1" edc:name="TBF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RBF" edc:desc="" edc:mask="0x1" edc:name="RBF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="R_W" edc:desc="" edc:mask="0x1" edc:name="R_W" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="P" edc:desc="" edc:mask="0x1" edc:name="P" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="D_A" edc:desc="" edc:mask="0x1" edc:name="D_A" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2COV" edc:desc="" edc:mask="0x1" edc:name="I2COV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IWCOL" edc:desc="" edc:mask="0x1" edc:name="IWCOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADD10" edc:desc="" edc:mask="0x1" edc:name="ADD10" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GCSTAT" edc:desc="" edc:mask="0x1" edc:name="GCSTAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BCL" edc:desc="" edc:mask="0x1" edc:name="BCL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ACKTIM" edc:desc="" edc:mask="0x1" edc:name="ACKTIM" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRSTAT" edc:desc="" edc:mask="0x1" edc:name="TRSTAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACKSTAT" edc:desc="" edc:mask="0x1" edc:name="ACKSTAT" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="I2CPOV" edc:desc="" edc:mask="0x1" edc:name="I2CPOV" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820420" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:access="----------------------nnnnnnnnnn" edc:cname="I2C1ADD" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="I2C1ADD" edc:nzwidth="32" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CADD" edc:desc="" edc:mask="0x3ff" edc:name="I2CADD" edc:nzwidth="10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820430" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:access="----------------------nnnnnnnnnn" edc:cname="I2C1MSK" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="I2C1MSK" edc:nzwidth="32" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CMSK" edc:desc="" edc:mask="0x3ff" edc:name="I2CMSK" edc:nzwidth="10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="AMSK" edc:desc="" edc:mask="0x3ff" edc:name="AMSK" edc:nzwidth="10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820440" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="I2C1BRG" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="I2C1BRG" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CBRG" edc:desc="" edc:mask="0xffff" edc:name="I2CBRG" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F820450" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:access="------------------------wwwwwwww" edc:cname="I2C1TRN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------11111111" edc:name="I2C1TRN" edc:nzwidth="32" edc:por="------------------------11111111" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CTRN" edc:desc="" edc:mask="0xff" edc:name="I2CTRN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
