Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F820460" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="1" edc:access="------------------------rrrrrrrr" edc:cname="I2C1RCV" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="I2C1RCV" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CRCV" edc:desc="" edc:mask="0xff" edc:name="I2CRCV" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F820470" edc:offset="0xb90"/>
      <edc:SFRDef edc:_addr="0x1F821000" edc:_begin="0x0" edc:_end="0x100" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:access="nrnnnnnnnnnnnnnnn-n-nnnn-nnnnnnn" edc:cname="ADCCON1" edc:desc="" edc:impl="0xffffaf7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000-0-0000-0000000" edc:name="ADCCON1" edc:nzwidth="32" edc:por="00000000000000000-0-0000-0000000" edc:portals="CLR SET INV" ltx:baseofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMABL" edc:mask="0x7" edc:name="DMABL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="STRGLVL" edc:mask="0x1" edc:name="STRGLVL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IRQVS" edc:mask="0x7" edc:name="IRQVS" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCANEN" edc:mask="0x1" edc:name="SCANEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSYUPB" edc:mask="0x1" edc:name="FSYUPB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSYDMA" edc:mask="0x1" edc:name="FSYDMA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDEN" edc:mask="0x1" edc:name="CVDEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGSRC" edc:mask="0x1f" edc:name="STRGSRC" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FRACT" edc:mask="0x1" edc:name="FRACT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRBSLV" edc:mask="0x7" edc:name="TRBSLV" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TRBMST" edc:mask="0x7" edc:name="TRBMST" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="TRBERR" edc:mask="0x1" edc:name="TRBERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRBEN" edc:mask="0x1" edc:name="TRBEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="ADC" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821010" edc:_begin="0x0" edc:_end="0x100" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:access="rrrnnnnnnnnnnnnnnnn-n----nnnnnnn" edc:cname="ADCCON2" edc:desc="" edc:impl="0xffffe87f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000-0----0000000" edc:name="ADCCON2" edc:nzwidth="32" edc:por="0000000000000000000-0----0000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ENXCNVRT" edc:mask="0x1" edc:name="ENXCNVRT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EOSIEN" edc:mask="0x1" edc:name="EOSIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFFLTIEN" edc:mask="0x1" edc:name="REFFLTIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BGVRIEN" edc:mask="0x1" edc:name="BGVRIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="10"/>
            <edc:SFRFieldDef edc:cname="CVDCPL" edc:mask="0x7" edc:name="CVDCPL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="EOSRDY" edc:mask="0x1" edc:name="EOSRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFFLT" edc:mask="0x1" edc:name="REFFLT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BGVRRDY" edc:mask="0x1" edc:name="BGVRRDY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821020" edc:_begin="0x0" edc:_end="0x100" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:access="nnnnnnnnr------rnnnnnnnnnnnnnnnn" edc:cname="ADCCON3" edc:desc="" edc:impl="0xff81ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000------00000000000000000" edc:name="ADCCON3" edc:nzwidth="32" edc:por="000000000------00000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADINSEL" edc:mask="0x3f" edc:name="ADINSEL" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="GSWTRG" edc:mask="0x1" edc:name="GSWTRG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GLSWTRG" edc:mask="0x1" edc:name="GLSWTRG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RQCNVRT" edc:mask="0x1" edc:name="RQCNVRT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMP" edc:mask="0x1" edc:name="SAMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPDRDY" edc:mask="0x1" edc:name="UPDRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UPDIEN" edc:mask="0x1" edc:name="UPDIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRGSUSP" edc:mask="0x1" edc:name="TRGSUSP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VREFSEL" edc:mask="0x7" edc:name="VREFSEL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="DIGEN0" edc:mask="0x1" edc:name="DIGEN0" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="DIGEN7" edc:mask="0x1" edc:name="DIGEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CONCLKDIV" edc:mask="0x3f" edc:name="CONCLKDIV" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCSEL" edc:mask="0x3" edc:name="ADCSEL" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821030" edc:_begin="0x0" edc:_end="0x100" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="1" edc:access="--------------nn-------n-------n" edc:cname="ADCTRGMODE" edc:desc="" edc:impl="0x30101" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------00-------0-------0" edc:name="ADCTRGMODE" edc:nzwidth="32" edc:por="--------------00-------0-------0" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SSAMPEN0" edc:mask="0x1" edc:name="SSAMPEN0" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="STRGEN0" edc:mask="0x1" edc:name="STRGEN0" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="SH0ALT" edc:mask="0x3" edc:name="SH0ALT" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
