Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:AdjustPoint edc:_addr="0x1F8212A0" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x1F8212E0" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="n------nnrr-----rrrrrrrrr----nnn" edc:cname="ADCFSTAT" edc:desc="" edc:impl="0x81e0ff87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0------0000-----000000000----000" edc:name="ADCFSTAT" edc:nzwidth="32" edc:por="0------0000-----000000000----000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCID" edc:mask="0x7" edc:name="ADCID" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FSIGN" edc:mask="0x1" edc:name="FSIGN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCNT" edc:mask="0xff" edc:name="FCNT" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="FWROVERR" edc:mask="0x1" edc:name="FWROVERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRDY" edc:mask="0x1" edc:name="FRDY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIEN" edc:mask="0x1" edc:name="FIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC0EN" edc:mask="0x1" edc:name="ADC0EN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="FEN" edc:mask="0x1" edc:name="FEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8212F0" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ADCFIFO" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCFIFO" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821300" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ADCBASE" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ADCBASE" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCBASE" edc:mask="0xffff" edc:name="ADCBASE" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821310" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="n------nr------rn------n-------r" edc:cname="ADCDMAST" edc:desc="" edc:impl="0x81818101" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0------00------00------0-------0" edc:name="ADCDMAST" edc:nzwidth="32" edc:por="0------00------00------0-------0" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RAF0" edc:mask="0x1" edc:name="RAF0" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="RAF0IEN" edc:mask="0x1" edc:name="RAF0IEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="DMACNTEN" edc:mask="0x1" edc:name="DMACNTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBF0" edc:mask="0x1" edc:name="RBF0" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="WROVRERR" edc:mask="0x1" edc:name="WROVRERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBF0IEN" edc:mask="0x1" edc:name="RBF0IEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="DMAEN" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821320" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCNTB" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCNTB" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCNTB" edc:mask="0xffffffff" edc:name="ADCCNTB" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821330" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDMAB" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDMAB" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADDMAB" edc:mask="0xffffffff" edc:name="ADDMAB" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821340" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="------------------------nnnnnnnn" edc:cname="ADCTRGSNS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="ADCTRGSNS" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LVL0" edc:mask="0x1" edc:name="LVL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL1" edc:mask="0x1" edc:name="LVL1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL2" edc:mask="0x1" edc:name="LVL2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL3" edc:mask="0x1" edc:name="LVL3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL4" edc:mask="0x1" edc:name="LVL4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL5" edc:mask="0x1" edc:name="LVL5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL6" edc:mask="0x1" edc:name="LVL6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVL7" edc:mask="0x1" edc:name="LVL7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F821350" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="------nnnnnnnnnn------nnnnnnnnnn" edc:cname="ADC0TIME" edc:desc="" edc:impl="0x3ff03ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00u0000000------0000000000" edc:name="ADC0TIME" edc:nzwidth="32" edc:por="------00x0000000------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SAMC" edc:mask="0x3ff" edc:name="SAMC" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="ADCDIV" edc:mask="0x7f" edc:name="ADCDIV" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="BCHEN0" edc:mask="0x1" edc:name="BCHEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821360" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0x60"/>
      <edc:AdjustPoint edc:_addr="0x1F8213C0" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0x30"/>
      <edc:AdjustPoint edc:_addr="0x1F8213F0" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x1F821400" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="----nnnnn------nr------rn------n" edc:cname="ADCANCON" edc:desc="" edc:impl="0xf818181" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----00000------00------00------0" edc:name="ADCANCON" edc:nzwidth="32" edc:por="----00000------00------00------0" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANEN0" edc:mask="0x1" edc:name="ANEN0" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="ANEN7" edc:mask="0x1" edc:name="ANEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY0" edc:mask="0x1" edc:name="WKRDY0" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="WKRDY7" edc:mask="0x1" edc:name="WKRDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN0" edc:mask="0x1" edc:name="WKIEN0" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="WKIEN7" edc:mask="0x1" edc:name="WKIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPCLKCNT" edc:mask="0xf" edc:name="WKUPCLKCNT" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821410" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0x1f0"/>
      <edc:SFRDef edc:_addr="0x1F821600" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC0CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC0CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821610" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0x60"/>
      <edc:SFRDef edc:_addr="0x1F821670" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADC7CFG" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADC7CFG" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ADCCFG" edc:mask="0xffffffff" edc:name="ADCCFG" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
