Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:AdjustPoint edc:_addr="0x1F821680" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F821684" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0x7C"/>
      <edc:SFRDef edc:_addr="0x1F821700" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="------------nnnnrrrrrrrrrrrrrrrr" edc:cname="ADCSYSCFG0" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------uuuu0000000000000000" edc:name="ADCSYSCFG0" edc:nzwidth="32" edc:por="------------xxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AN0" edc:mask="0x1" edc:name="AN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN1" edc:mask="0x1" edc:name="AN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN2" edc:mask="0x1" edc:name="AN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN3" edc:mask="0x1" edc:name="AN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN4" edc:mask="0x1" edc:name="AN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN5" edc:mask="0x1" edc:name="AN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN6" edc:mask="0x1" edc:name="AN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN7" edc:mask="0x1" edc:name="AN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN8" edc:mask="0x1" edc:name="AN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN9" edc:mask="0x1" edc:name="AN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN10" edc:mask="0x1" edc:name="AN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN11" edc:mask="0x1" edc:name="AN11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN12" edc:mask="0x1" edc:name="AN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN13" edc:mask="0x1" edc:name="AN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN14" edc:mask="0x1" edc:name="AN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN15" edc:mask="0x1" edc:name="AN15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN16" edc:mask="0x1" edc:name="AN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN17" edc:mask="0x1" edc:name="AN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN18" edc:mask="0x1" edc:name="AN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AN19" edc:mask="0x1" edc:name="AN19" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821710" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0x2f0"/>
      <edc:SFRDef edc:_addr="0x1F821A00" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821A04" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821A10" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821A14" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821A20" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821A24" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821A30" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA3" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821A34" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821A40" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA4" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821A44" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821A50" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA5" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
