Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:AdjustPoint edc:_addr="0x1F821A54" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821A60" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA6" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA6" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821A64" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821A70" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA7" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA7" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821A74" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821A80" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA8" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA8" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821A84" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821A90" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA9" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA9" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821A94" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821AA0" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA10" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA10" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821AA4" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821AB0" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA11" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA11" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821AB4" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821AC0" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA12" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA12" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821AC4" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821AD0" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA13" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA13" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821AD4" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821AE0" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA14" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA14" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F821AE4" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x1F821AF0" edc:_begin="0x200" edc:_end="0xb74" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_Rio.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA15" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA15" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
