Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F822060" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="C1RXOVF" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1RXOVF" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXOVF" edc:desc="" edc:mask="0xffffffff" edc:name="RXOVF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="RXOVF0" edc:desc="" edc:mask="0x1" edc:name="RXOVF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF1" edc:desc="" edc:mask="0x1" edc:name="RXOVF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF2" edc:desc="" edc:mask="0x1" edc:name="RXOVF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF3" edc:desc="" edc:mask="0x1" edc:name="RXOVF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF4" edc:desc="" edc:mask="0x1" edc:name="RXOVF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF5" edc:desc="" edc:mask="0x1" edc:name="RXOVF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF6" edc:desc="" edc:mask="0x1" edc:name="RXOVF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF7" edc:desc="" edc:mask="0x1" edc:name="RXOVF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF8" edc:desc="" edc:mask="0x1" edc:name="RXOVF8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF9" edc:desc="" edc:mask="0x1" edc:name="RXOVF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF10" edc:desc="" edc:mask="0x1" edc:name="RXOVF10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF11" edc:desc="" edc:mask="0x1" edc:name="RXOVF11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF12" edc:desc="" edc:mask="0x1" edc:name="RXOVF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF13" edc:desc="" edc:mask="0x1" edc:name="RXOVF13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF14" edc:desc="" edc:mask="0x1" edc:name="RXOVF14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF15" edc:desc="" edc:mask="0x1" edc:name="RXOVF15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF16" edc:desc="" edc:mask="0x1" edc:name="RXOVF16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF17" edc:desc="" edc:mask="0x1" edc:name="RXOVF17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF18" edc:desc="" edc:mask="0x1" edc:name="RXOVF18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF19" edc:desc="" edc:mask="0x1" edc:name="RXOVF19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF20" edc:desc="" edc:mask="0x1" edc:name="RXOVF20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF21" edc:desc="" edc:mask="0x1" edc:name="RXOVF21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF22" edc:desc="" edc:mask="0x1" edc:name="RXOVF22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF23" edc:desc="" edc:mask="0x1" edc:name="RXOVF23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF24" edc:desc="" edc:mask="0x1" edc:name="RXOVF24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF25" edc:desc="" edc:mask="0x1" edc:name="RXOVF25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF26" edc:desc="" edc:mask="0x1" edc:name="RXOVF26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF27" edc:desc="" edc:mask="0x1" edc:name="RXOVF27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF28" edc:desc="" edc:mask="0x1" edc:name="RXOVF28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF29" edc:desc="" edc:mask="0x1" edc:name="RXOVF29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF30" edc:desc="" edc:mask="0x1" edc:name="RXOVF30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF31" edc:desc="" edc:mask="0x1" edc:name="RXOVF31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822070" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1TMR" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1TMR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CANTSPRE" edc:desc="" edc:mask="0xffff" edc:name="CANTSPRE" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="CANTS" edc:desc="" edc:mask="0xffff" edc:name="CANTS" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822080" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXM0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1RXM0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822090" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXM1" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1RXM1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8220A0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXM2" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1RXM2" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8220B0" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F8220C0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1FLTCON0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FLTCON0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL0" edc:desc="" edc:mask="0x1f" edc:name="FSEL0" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL0" edc:desc="" edc:mask="0x3" edc:name="MSEL0" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN0" edc:desc="" edc:mask="0x1" edc:name="FLTEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL1" edc:desc="" edc:mask="0x1f" edc:name="FSEL1" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL1" edc:desc="" edc:mask="0x3" edc:name="MSEL1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN1" edc:desc="" edc:mask="0x1" edc:name="FLTEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL2" edc:desc="" edc:mask="0x1f" edc:name="FSEL2" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL2" edc:desc="" edc:mask="0x3" edc:name="MSEL2" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN2" edc:desc="" edc:mask="0x1" edc:name="FLTEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL3" edc:desc="" edc:mask="0x1f" edc:name="FSEL3" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL3" edc:desc="" edc:mask="0x3" edc:name="MSEL3" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN3" edc:desc="" edc:mask="0x1" edc:name="FLTEN3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8220D0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1FLTCON1" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FLTCON1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL4" edc:desc="" edc:mask="0x1f" edc:name="FSEL4" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL4" edc:desc="" edc:mask="0x3" edc:name="MSEL4" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN4" edc:desc="" edc:mask="0x1" edc:name="FLTEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL5" edc:desc="" edc:mask="0x1f" edc:name="FSEL5" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL5" edc:desc="" edc:mask="0x3" edc:name="MSEL5" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN5" edc:desc="" edc:mask="0x1" edc:name="FLTEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL6" edc:desc="" edc:mask="0x1f" edc:name="FSEL6" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL6" edc:desc="" edc:mask="0x3" edc:name="MSEL6" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN6" edc:desc="" edc:mask="0x1" edc:name="FLTEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL7" edc:desc="" edc:mask="0x1f" edc:name="FSEL7" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL7" edc:desc="" edc:mask="0x3" edc:name="MSEL7" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN7" edc:desc="" edc:mask="0x1" edc:name="FLTEN7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8220E0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1FLTCON2" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FLTCON2" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL8" edc:desc="" edc:mask="0x1f" edc:name="FSEL8" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL8" edc:desc="" edc:mask="0x3" edc:name="MSEL8" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN8" edc:desc="" edc:mask="0x1" edc:name="FLTEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL9" edc:desc="" edc:mask="0x1f" edc:name="FSEL9" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL9" edc:desc="" edc:mask="0x3" edc:name="MSEL9" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN9" edc:desc="" edc:mask="0x1" edc:name="FLTEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL10" edc:desc="" edc:mask="0x1f" edc:name="FSEL10" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL10" edc:desc="" edc:mask="0x3" edc:name="MSEL10" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN10" edc:desc="" edc:mask="0x1" edc:name="FLTEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL11" edc:desc="" edc:mask="0x1f" edc:name="FSEL11" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL11" edc:desc="" edc:mask="0x3" edc:name="MSEL11" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN11" edc:desc="" edc:mask="0x1" edc:name="FLTEN11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8220F0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1FLTCON3" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FLTCON3" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL12" edc:desc="" edc:mask="0x1f" edc:name="FSEL12" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL12" edc:desc="" edc:mask="0x3" edc:name="MSEL12" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN12" edc:desc="" edc:mask="0x1" edc:name="FLTEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL13" edc:desc="" edc:mask="0x1f" edc:name="FSEL13" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL13" edc:desc="" edc:mask="0x3" edc:name="MSEL13" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN13" edc:desc="" edc:mask="0x1" edc:name="FLTEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL14" edc:desc="" edc:mask="0x1f" edc:name="FSEL14" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL14" edc:desc="" edc:mask="0x3" edc:name="MSEL14" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN14" edc:desc="" edc:mask="0x1" edc:name="FLTEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL15" edc:desc="" edc:mask="0x1f" edc:name="FSEL15" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL15" edc:desc="" edc:mask="0x3" edc:name="MSEL15" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN15" edc:desc="" edc:mask="0x1" edc:name="FLTEN15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F822100" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822110" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822120" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822130" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F822140" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF0" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822150" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF1" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF1" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
