Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F822160" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF2" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF2" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822170" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF3" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF3" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822180" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF4" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF4" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822190" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF5" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF5" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8221A0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF6" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF6" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8221B0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF7" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF7" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
