Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8221C0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF8" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF8" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8221D0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF9" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF9" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8221E0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF10" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF10" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8221F0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF11" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF11" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822200" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF12" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF12" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822210" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF13" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF13" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822220" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF14" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF14" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822230" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF15" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
