Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F822700" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="---------------------------rrrrr" edc:cname="C1FIFOCI14" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FIFOCI14" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CFIFOCI" edc:desc="" edc:mask="0x1f" edc:name="CFIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822710" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="-----------nnnnn-nnn----nnnnnnnn" edc:cname="C1FIFOCON15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FIFOCON15" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXPRI" edc:desc="" edc:mask="0x3" edc:name="TXPRI" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="RTREN" edc:desc="" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABAT" edc:desc="" edc:mask="0x1" edc:name="TXABAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DONLY" edc:desc="" edc:mask="0x1" edc:name="DONLY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:desc="" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:desc="" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:desc="" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822720" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="-----nnn----nnnn-----rrr----nrrr" edc:cname="C1FIFOINT15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FIFOINT15" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXNEMPTYIF" edc:desc="" edc:mask="0x1" edc:name="RXNEMPTYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXHALFIF" edc:desc="" edc:mask="0x1" edc:name="RXHALFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFULLIF" edc:desc="" edc:mask="0x1" edc:name="RXFULLIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVFLIF" edc:desc="" edc:mask="0x1" edc:name="RXOVFLIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="TXEMPTYIF" edc:desc="" edc:mask="0x1" edc:name="TXEMPTYIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXHALFIF" edc:desc="" edc:mask="0x1" edc:name="TXHALFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXNFULLIF" edc:desc="" edc:mask="0x1" edc:name="TXNFULLIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RXNEMPTYIE" edc:desc="" edc:mask="0x1" edc:name="RXNEMPTYIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXHALFIE" edc:desc="" edc:mask="0x1" edc:name="RXHALFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXFULLIE" edc:desc="" edc:mask="0x1" edc:name="RXFULLIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVFLIE" edc:desc="" edc:mask="0x1" edc:name="RXOVFLIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="TXEMPTYIE" edc:desc="" edc:mask="0x1" edc:name="TXEMPTYIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXHALFIE" edc:desc="" edc:mask="0x1" edc:name="TXHALFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXNFULLIE" edc:desc="" edc:mask="0x1" edc:name="TXNFULLIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822730" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrr--" edc:cname="C1FIFOUA15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuu00" edc:name="C1FIFOUA15" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx00" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:desc="" edc:islanghidden="true" edc:mask="0x3fffffff" edc:name="FIFOUA" edc:nzwidth="0x1e"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F822740" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="---------------------------rrrrr" edc:cname="C1FIFOCI15" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FIFOCI15" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CFIFOCI" edc:desc="" edc:mask="0x1f" edc:name="CFIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F822750" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822760" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822770" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822780" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822790" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8227A0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8227B0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8227C0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8227D0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8227E0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8227F0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822800" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822810" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822820" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822830" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822840" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822850" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822860" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822870" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822880" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822890" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8228A0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8228B0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8228C0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8228D0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8228E0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8228F0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822900" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822910" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822920" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822930" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822940" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822950" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822960" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822970" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822980" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822990" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8229A0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8229B0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8229C0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8229D0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8229E0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8229F0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822A00" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822A10" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822A20" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822A30" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822A40" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822A50" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822A60" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822A70" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822A80" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822A90" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822AA0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822AB0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822AC0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822AD0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822AE0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822AF0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822B00" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822B10" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822B20" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822B30" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822B40" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F822B50" edc:offset="0x4B0"/>
      <edc:SFRDef edc:_addr="0x1F823000" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnsnnnrrrnnnnnn-nnrnnnnnnnnnnn" edc:cname="CFD2CON" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu01001000uuuu000u0uuuuuu00000" edc:name="CFD2CON" edc:nzwidth="0x20" edc:por="xxxx01001000xxxx000x0xxxxxx00000" ltx:baseofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DNCNT" edc:desc="" edc:mask="0x1f" edc:name="DNCNT" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="ISOCRCEN" edc:mask="0x1" edc:name="ISOCRCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PXEDIS" edc:mask="0x1" edc:name="PXEDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKSEL0" edc:mask="0x1" edc:name="CLKSEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKFIL" edc:mask="0x1" edc:name="WAKFIL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WFT" edc:mask="0x3" edc:name="WFT" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CANBUSY" edc:desc="" edc:mask="0x1" edc:name="CANBUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BRSDIS" edc:mask="0x1" edc:name="BRSDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RTXAT" edc:mask="0x1" edc:name="RTXAT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ESIGM" edc:mask="0x1" edc:name="ESIGM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERR2LOM" edc:mask="0x1" edc:name="SERR2LOM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STEF" edc:mask="0x1" edc:name="STEF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXQEN" edc:desc="" edc:mask="0x1" edc:name="TXQEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OPMOD" edc:desc="" edc:mask="0x7" edc:name="OPMOD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="REQOP" edc:desc="" edc:mask="0x7" edc:name="REQOP" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ABAT" edc:desc="" edc:mask="0x1" edc:name="ABAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXBWS" edc:mask="0xf" edc:name="TXBWS" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CANFD2" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823004" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnn-nnnnnnn-nnnnnnn" edc:cname="CFD2NBTCFG" edc:desc="" edc:impl="0xffff7f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu-uuuuuuu-uuuuuuu" edc:name="CFD2NBTCFG" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxx-xxxxxxx-xxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SJW" edc:mask="0x7f" edc:name="SJW" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TSEG2" edc:mask="0x7f" edc:name="TSEG2" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TSEG1" edc:mask="0xff" edc:name="TSEG1" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="BRP" edc:mask="0xff" edc:name="BRP" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823008" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnn---nnnnn----nnnn----nnnn" edc:cname="CFD2DBTCFG" edc:desc="" edc:impl="0xff1f0f0f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu---uuuuu----uuuu----uuuu" edc:name="CFD2DBTCFG" edc:nzwidth="32" edc:por="xxxxxxxx---xxxxx----xxxx----xxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SJW" edc:mask="0xf" edc:name="SJW" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TSEG2" edc:mask="0xf" edc:name="TSEG2" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TSEG1" edc:mask="0x1f" edc:name="TSEG1" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BRP" edc:mask="0xff" edc:name="BRP" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
