Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F823020" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-" edc:cname="CFD2RXIF" edc:desc="" edc:impl="0xfffffffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu-" edc:name="CFD2RXIF" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx-" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RFIF" edc:mask="0x7fffffff" edc:name="RFIF" edc:nzwidth="0x1f"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823024" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2TXIF" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2TXIF" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFIF" edc:mask="0xffffffff" edc:name="TFIF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823028" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-" edc:cname="CFD2RXOVIF" edc:desc="" edc:impl="0xfffffffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu-" edc:name="CFD2RXOVIF" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx-" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RFOVIF" edc:mask="0x7fffffff" edc:name="RFOVIF" edc:nzwidth="0x1f"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82302C" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2TXATIF" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2TXATIF" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFATIF" edc:mask="0xffffffff" edc:name="TFATIF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823030" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2TXREQ" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2TXREQ" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXREQ" edc:mask="0xffffffff" edc:name="TXREQ" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823034" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="----------rrrrrrrrrrrrrrrrrrrrrr" edc:cname="CFD2TREC" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CFD2TREC" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RERRCNT" edc:desc="" edc:mask="0xff" edc:name="RERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="TERRCNT" edc:desc="" edc:mask="0xff" edc:name="TERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="EWARN" edc:desc="" edc:mask="0x1" edc:name="EWARN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXWARN" edc:desc="" edc:mask="0x1" edc:name="RXWARN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXWARN" edc:desc="" edc:mask="0x1" edc:name="TXWARN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBP" edc:desc="" edc:mask="0x1" edc:name="RXBP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBP" edc:desc="" edc:mask="0x1" edc:name="TXBP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBO" edc:desc="" edc:mask="0x1" edc:name="TXBO" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823038" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2BDIAG0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2BDIAG0" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NRERRCNT" edc:mask="0xff" edc:name="NRERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="NTERRCNT" edc:mask="0xff" edc:name="NTERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DRERRCNT" edc:mask="0xff" edc:name="DRERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DTERRCNT" edc:mask="0xff" edc:name="DTERRCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82303C" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnn-nn--nnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2BDIAG1" edc:desc="" edc:impl="0xfb3fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu--uuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2BDIAG1" edc:nzwidth="32" edc:por="xxxxx-xx--xxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EFMSGCNT" edc:mask="0xffff" edc:name="EFMSGCNT" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="NBIT0ERR" edc:mask="0x1" edc:name="NBIT0ERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NBIT1ERR" edc:mask="0x1" edc:name="NBIT1ERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACKERR" edc:mask="0x1" edc:name="NACKERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NFORMERR" edc:mask="0x1" edc:name="NFORMERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NSTUFERR" edc:mask="0x1" edc:name="NSTUFERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NCRCERR" edc:mask="0x1" edc:name="NCRCERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DBIT0ERR" edc:mask="0x1" edc:name="DBIT0ERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBIT1ERR" edc:mask="0x1" edc:name="DBIT1ERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DFORMERR" edc:mask="0x1" edc:name="DFORMERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSTUFERR" edc:mask="0x1" edc:name="DSTUFERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCRCERR" edc:mask="0x1" edc:name="DCRCERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ESI" edc:mask="0x1" edc:name="ESI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLCMM" edc:mask="0x1" edc:name="DLCMM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
