Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F823040" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="---nnnnn-------------n-n--n-nnnn" edc:cname="CFD2TEFCON" edc:desc="" edc:impl="0x1f00052f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu-------------u-u--u-uuuu" edc:name="CFD2TEFCON" edc:nzwidth="32" edc:por="---xxxxx-------------x-x--x-xxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TEFNEIE" edc:mask="0x1" edc:name="TEFNEIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFHIE" edc:mask="0x1" edc:name="TEFHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFFIE" edc:mask="0x1" edc:name="TEFFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFOVIE" edc:mask="0x1" edc:name="TEFOVIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFTSEN" edc:mask="0x1" edc:name="TEFTSEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823044" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="----------------------------nnnn" edc:cname="CFD2TEFSTA" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="CFD2TEFSTA" edc:nzwidth="32" edc:por="----------------------------xxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TEFNEIF" edc:mask="0x1" edc:name="TEFNEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFHIF" edc:mask="0x1" edc:name="TEFHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFFIF" edc:mask="0x1" edc:name="TEFFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFOVIF" edc:mask="0x1" edc:name="TEFOVIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823048" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2TEFUA" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2TEFUA" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TEFUA" edc:mask="0xffffffff" edc:name="TEFUA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82304C" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FIFOBA" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FIFOBA" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIFOBA" edc:mask="0xffffffff" edc:name="FIFOBA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823050" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnn-nnnnnnn-----nnnn--n-n-n" edc:cname="CFD2TXQCON" edc:desc="" edc:impl="0xff7f0795" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu-uuuuuuu-----uuuu--u-u-u" edc:name="CFD2TXQCON" edc:nzwidth="32" edc:por="xxxxxxxx-xxxxxxx-----xxxx--x-x-x" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXQNIE" edc:mask="0x1" edc:name="TXQNIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXQEIE" edc:mask="0x1" edc:name="TXQEIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIE" edc:mask="0x1" edc:name="TXATIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TXPRI" edc:mask="0x1f" edc:name="TXPRI" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TXAT" edc:mask="0x3" edc:name="TXAT" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PLSIZE" edc:mask="0x7" edc:name="PLSIZE" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823054" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="-------------------nnnnnnnnn-n-n" edc:cname="CFD2TXQSTA" edc:desc="" edc:impl="0x1ff5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------uuuuuuuuu-u-u" edc:name="CFD2TXQSTA" edc:nzwidth="32" edc:por="-------------------xxxxxxxxx-x-x" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXQNIF" edc:mask="0x1" edc:name="TXQNIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXQEIF" edc:mask="0x1" edc:name="TXQEIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIF" edc:mask="0x1" edc:name="TXATIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERR" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXLARB" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABT" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXQCI" edc:mask="0x1f" edc:name="TXQCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823058" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2TXQUA" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2TXQUA" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXQUA" edc:mask="0xffffffff" edc:name="TXQUA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82305C" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnn-nnnnnnn-----nnnnnnnnnnn" edc:cname="CFD2FIFOCON1" edc:desc="" edc:impl="0xff7f07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu-uuuuuuu-----uuuuuuuuuuu" edc:name="CFD2FIFOCON1" edc:nzwidth="32" edc:por="xxxxxxxx-xxxxxxx-----xxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIE" edc:mask="0x1" edc:name="TFNRFNIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIE" edc:mask="0x1" edc:name="TFHRFHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIE" edc:mask="0x1" edc:name="TFERFFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIE" edc:mask="0x1" edc:name="RXOVIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIE" edc:mask="0x1" edc:name="TXATIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTSEN" edc:mask="0x1" edc:name="RXTSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTREN" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TXPRI" edc:mask="0x1f" edc:name="TXPRI" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TXAT" edc:mask="0x3" edc:name="TXAT" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PLSIZE" edc:mask="0x7" edc:name="PLSIZE" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823060" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="CFD2FIFOSTA1" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------uuuuuuuuuuuuu" edc:name="CFD2FIFOSTA1" edc:nzwidth="32" edc:por="-------------------xxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIF" edc:mask="0x1" edc:name="TFNRFNIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIF" edc:mask="0x1" edc:name="TFHRFHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIF" edc:mask="0x1" edc:name="TFERFFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIF" edc:mask="0x1" edc:name="RXOVIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIF" edc:mask="0x1" edc:name="TXATIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERR" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXLARB" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABT" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCI" edc:mask="0x1f" edc:name="FIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823064" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FIFOUA1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FIFOUA1" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:mask="0xffffffff" edc:name="FIFOUA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
