Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F82307C" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FIFOUA3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FIFOUA3" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:mask="0xffffffff" edc:name="FIFOUA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823080" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnn-nnnnnnn-----nnnnnnnnnnn" edc:cname="CFD2FIFOCON4" edc:desc="" edc:impl="0xff7f07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu-uuuuuuu-----uuuuuuuuuuu" edc:name="CFD2FIFOCON4" edc:nzwidth="32" edc:por="xxxxxxxx-xxxxxxx-----xxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIE" edc:mask="0x1" edc:name="TFNRFNIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIE" edc:mask="0x1" edc:name="TFHRFHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIE" edc:mask="0x1" edc:name="TFERFFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIE" edc:mask="0x1" edc:name="RXOVIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIE" edc:mask="0x1" edc:name="TXATIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTSEN" edc:mask="0x1" edc:name="RXTSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTREN" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TXPRI" edc:mask="0x1f" edc:name="TXPRI" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TXAT" edc:mask="0x3" edc:name="TXAT" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PLSIZE" edc:mask="0x7" edc:name="PLSIZE" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823084" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="CFD2FIFOSTA4" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------uuuuuuuuuuuuu" edc:name="CFD2FIFOSTA4" edc:nzwidth="32" edc:por="-------------------xxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIF" edc:mask="0x1" edc:name="TFNRFNIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIF" edc:mask="0x1" edc:name="TFHRFHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIF" edc:mask="0x1" edc:name="TFERFFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIF" edc:mask="0x1" edc:name="RXOVIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIF" edc:mask="0x1" edc:name="TXATIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERR" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXLARB" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABT" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCI" edc:mask="0x1f" edc:name="FIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823088" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FIFOUA4" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FIFOUA4" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:mask="0xffffffff" edc:name="FIFOUA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82308C" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnn-nnnnnnn-----nnnnnnnnnnn" edc:cname="CFD2FIFOCON5" edc:desc="" edc:impl="0xff7f07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu-uuuuuuu-----uuuuuuuuuuu" edc:name="CFD2FIFOCON5" edc:nzwidth="32" edc:por="xxxxxxxx-xxxxxxx-----xxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIE" edc:mask="0x1" edc:name="TFNRFNIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIE" edc:mask="0x1" edc:name="TFHRFHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIE" edc:mask="0x1" edc:name="TFERFFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIE" edc:mask="0x1" edc:name="RXOVIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIE" edc:mask="0x1" edc:name="TXATIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTSEN" edc:mask="0x1" edc:name="RXTSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTREN" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TXPRI" edc:mask="0x1f" edc:name="TXPRI" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TXAT" edc:mask="0x3" edc:name="TXAT" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PLSIZE" edc:mask="0x7" edc:name="PLSIZE" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823090" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="CFD2FIFOSTA5" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------uuuuuuuuuuuuu" edc:name="CFD2FIFOSTA5" edc:nzwidth="32" edc:por="-------------------xxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIF" edc:mask="0x1" edc:name="TFNRFNIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIF" edc:mask="0x1" edc:name="TFHRFHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIF" edc:mask="0x1" edc:name="TFERFFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIF" edc:mask="0x1" edc:name="RXOVIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIF" edc:mask="0x1" edc:name="TXATIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERR" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXLARB" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABT" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCI" edc:mask="0x1f" edc:name="FIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823094" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FIFOUA5" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FIFOUA5" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:mask="0xffffffff" edc:name="FIFOUA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823098" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnn-nnnnnnn-----nnnnnnnnnnn" edc:cname="CFD2FIFOCON6" edc:desc="" edc:impl="0xff7f07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu-uuuuuuu-----uuuuuuuuuuu" edc:name="CFD2FIFOCON6" edc:nzwidth="32" edc:por="xxxxxxxx-xxxxxxx-----xxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIE" edc:mask="0x1" edc:name="TFNRFNIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIE" edc:mask="0x1" edc:name="TFHRFHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIE" edc:mask="0x1" edc:name="TFERFFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIE" edc:mask="0x1" edc:name="RXOVIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIE" edc:mask="0x1" edc:name="TXATIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTSEN" edc:mask="0x1" edc:name="RXTSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTREN" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TXPRI" edc:mask="0x1f" edc:name="TXPRI" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TXAT" edc:mask="0x3" edc:name="TXAT" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PLSIZE" edc:mask="0x7" edc:name="PLSIZE" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82309C" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="CFD2FIFOSTA6" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------uuuuuuuuuuuuu" edc:name="CFD2FIFOSTA6" edc:nzwidth="32" edc:por="-------------------xxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIF" edc:mask="0x1" edc:name="TFNRFNIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIF" edc:mask="0x1" edc:name="TFHRFHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIF" edc:mask="0x1" edc:name="TFERFFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIF" edc:mask="0x1" edc:name="RXOVIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIF" edc:mask="0x1" edc:name="TXATIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERR" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXLARB" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABT" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCI" edc:mask="0x1f" edc:name="FIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8230A0" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FIFOUA6" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FIFOUA6" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:mask="0xffffffff" edc:name="FIFOUA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8230A4" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnn-nnnnnnn-----nnnnnnnnnnn" edc:cname="CFD2FIFOCON7" edc:desc="" edc:impl="0xff7f07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu-uuuuuuu-----uuuuuuuuuuu" edc:name="CFD2FIFOCON7" edc:nzwidth="32" edc:por="xxxxxxxx-xxxxxxx-----xxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIE" edc:mask="0x1" edc:name="TFNRFNIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIE" edc:mask="0x1" edc:name="TFHRFHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIE" edc:mask="0x1" edc:name="TFERFFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIE" edc:mask="0x1" edc:name="RXOVIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIE" edc:mask="0x1" edc:name="TXATIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTSEN" edc:mask="0x1" edc:name="RXTSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTREN" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TXPRI" edc:mask="0x1f" edc:name="TXPRI" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TXAT" edc:mask="0x3" edc:name="TXAT" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PLSIZE" edc:mask="0x7" edc:name="PLSIZE" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8230A8" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="-------------------nnnnnnnnnnnnn" edc:cname="CFD2FIFOSTA7" edc:desc="" edc:impl="0x1fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------uuuuuuuuuuuuu" edc:name="CFD2FIFOSTA7" edc:nzwidth="32" edc:por="-------------------xxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIF" edc:mask="0x1" edc:name="TFNRFNIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIF" edc:mask="0x1" edc:name="TFHRFHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIF" edc:mask="0x1" edc:name="TFERFFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIF" edc:mask="0x1" edc:name="RXOVIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIF" edc:mask="0x1" edc:name="TXATIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXERR" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXLARB" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABT" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCI" edc:mask="0x1f" edc:name="FIFOCI" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8230AC" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FIFOUA7" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FIFOUA7" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIFOUA" edc:mask="0xffffffff" edc:name="FIFOUA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8230B0" edc:_begin="0x0" edc:_end="0x110" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnn-nnnnnnn-----nnnnnnnnnnn" edc:cname="CFD2FIFOCON8" edc:desc="" edc:impl="0xff7f07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu-uuuuuuu-----uuuuuuuuuuu" edc:name="CFD2FIFOCON8" edc:nzwidth="32" edc:por="xxxxxxxx-xxxxxxx-----xxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TFNRFNIE" edc:mask="0x1" edc:name="TFNRFNIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFHRFHIE" edc:mask="0x1" edc:name="TFHRFHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFERFFIE" edc:mask="0x1" edc:name="TFERFFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVIE" edc:mask="0x1" edc:name="RXOVIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIE" edc:mask="0x1" edc:name="TXATIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXTSEN" edc:mask="0x1" edc:name="RXTSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTREN" edc:mask="0x1" edc:name="RTREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TXPRI" edc:mask="0x1f" edc:name="TXPRI" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TXAT" edc:mask="0x3" edc:name="TXAT" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PLSIZE" edc:mask="0x7" edc:name="PLSIZE" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
