Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F823118" edc:_begin="0x1d0" edc:_end="0x1e0" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="2" edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD2FLTCON2" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD2FLTCON2" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F8BP" edc:mask="0x1f" edc:name="F8BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN8" edc:mask="0x1" edc:name="FLTEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F9BP" edc:mask="0x1f" edc:name="F9BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN9" edc:mask="0x1" edc:name="FLTEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F10BP" edc:mask="0x1f" edc:name="F10BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN10" edc:mask="0x1" edc:name="FLTEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F11BP" edc:mask="0x1f" edc:name="F11BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN11" edc:mask="0x1" edc:name="FLTEN11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82311C" edc:_begin="0x1d0" edc:_end="0x1e0" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="2" edc:access="n--nnnnnn--nnnnnn--nnnnnn--nnnnn" edc:cname="CFD2FLTCON3" edc:desc="" edc:impl="0x9f9f9f9f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u--uuuuuu--uuuuuu--uuuuuu--uuuuu" edc:name="CFD2FLTCON3" edc:nzwidth="32" edc:por="x--xxxxxx--xxxxxx--xxxxxx--xxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="F12BP" edc:mask="0x1f" edc:name="F12BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN12" edc:mask="0x1" edc:name="FLTEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F13BP" edc:mask="0x1f" edc:name="F13BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN13" edc:mask="0x1" edc:name="FLTEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F14BP" edc:mask="0x1f" edc:name="F14BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN14" edc:mask="0x1" edc:name="FLTEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F15BP" edc:mask="0x1f" edc:name="F15BP" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN15" edc:mask="0x1" edc:name="FLTEN15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823120" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ0" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ0" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823124" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK0" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK0" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823128" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ1" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ1" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82312C" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK1" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK1" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823130" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ2" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ2" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823134" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK2" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK2" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823138" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ3" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ3" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82313C" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK3" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK3" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823140" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ4" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ4" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823144" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK4" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK4" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823148" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ5" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ5" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82314C" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK5" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK5" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823150" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ6" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ6" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823154" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK6" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK6" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823158" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ7" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ7" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82315C" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK7" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK7" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823160" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ8" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ8" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823164" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK8" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK8" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823168" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ9" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ9" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
