Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F82316C" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK9" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK9" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823170" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ10" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ10" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823174" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK10" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK10" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823178" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ11" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ11" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82317C" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK11" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK11" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823180" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ12" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ12" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823184" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK12" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK12" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
