Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F823188" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ13" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ13" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82318C" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK13" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK13" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823190" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ14" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ14" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823194" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK14" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK14" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F823198" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2FLTOBJ15" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2FLTOBJ15" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SID" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="EID" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="SID11" edc:mask="0x1" edc:name="SID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXIDE" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82319C" edc:_begin="0x1f0" edc:_end="0x270" edc:_modsrc="DOS-03247_can_fd_upb_v2.Module" edc:_refcount="3" edc:access="-nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD2MASK15" edc:desc="" edc:impl="0x7fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD2MASK15" edc:nzwidth="32" edc:por="-xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CANFD2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MSID" edc:mask="0x7ff" edc:name="MSID" edc:nzwidth="0xb"/>
            <edc:SFRFieldDef edc:cname="MEID" edc:mask="0x3ffff" edc:name="MEID" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="MSID11" edc:mask="0x1" edc:name="MSID11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8231A0" edc:offset="0xe60"/>
      <edc:SFRDef edc:_addr="0x1F824000" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="nnnnn-nnn---nnnnnnnnnnnn--nnnnnn" edc:cname="CVDCON" edc:desc="" edc:impl="0xfb8fff3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uuu---uuuuuuuuuuuu--uuuuuu" edc:name="CVDCON" edc:nzwidth="32" edc:por="xxxxx-xxx---xxxxxxxxxxxx--xxxxxx" ltx:baseofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRIGGER" edc:mask="0xf" edc:name="TRIGGER" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:mask="0x3" edc:name="CLKSEL" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FIFOTH" edc:mask="0x3ff" edc:name="FIFOTH" edc:nzwidth="0xa"/>
            <edc:SFRFieldDef edc:cname="FIFOIEN" edc:mask="0x1" edc:name="FIFOIEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDIEN" edc:mask="0x1" edc:name="CVDIEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="THSTR" edc:mask="0x1" edc:name="THSTR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG" edc:mask="0x1" edc:name="SWTRIG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ABORT" edc:mask="0x1" edc:name="ABORT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SDHOLD" edc:mask="0x1" edc:name="SDHOLD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ORDER" edc:mask="0x1" edc:name="ORDER" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F824004" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="----------------------------nnnn" edc:cname="CVDADC" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="CVDADC" edc:nzwidth="32" edc:por="----------------------------xxxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SELRES" edc:mask="0x3" edc:name="SELRES" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DIFFPEN" edc:mask="0x1" edc:name="DIFFPEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIGEN7" edc:mask="0x1" edc:name="DIGEN7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F824008" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="nnn---nnnnnnnnnn-----------n-nnn" edc:cname="CVDSTAT" edc:desc="" edc:impl="0xe3ff0017" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu---uuuuuuuuuu-----------u-uuu" edc:name="CVDSTAT" edc:nzwidth="32" edc:por="xxx---xxxxxxxxxx-----------x-xxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD1BUSY" edc:mask="0x1" edc:name="SD1BUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD1DONE" edc:mask="0x1" edc:name="SD1DONE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD1INT" edc:mask="0x1" edc:name="SD1INT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD2BUSY" edc:mask="0x1" edc:name="SD2BUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD2DONE" edc:mask="0x1" edc:name="SD2DONE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD2INT" edc:mask="0x1" edc:name="SD2INT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD3BUSY" edc:mask="0x1" edc:name="SD3BUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD3DONE" edc:mask="0x1" edc:name="SD3DONE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD3INT" edc:mask="0x1" edc:name="SD3INT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD4BUSY" edc:mask="0x1" edc:name="SD4BUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD4DONE" edc:mask="0x1" edc:name="SD4DONE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD4INT" edc:mask="0x1" edc:name="SD4INT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCNT" edc:mask="0x3ff" edc:name="FIFOCNT" edc:nzwidth="0xa"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FIFOMT" edc:mask="0x1" edc:name="FIFOMT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOWM" edc:mask="0x1" edc:name="FIFOWM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOFULL" edc:mask="0x1" edc:name="FIFOFULL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
