Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:AdjustPoint edc:_addr="0x1F82400C" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x1F824010" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVDRES0H" edc:desc="" edc:impl="0xffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------uuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CVDRES0H" edc:nzwidth="32" edc:por="--------xxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POS" edc:mask="0xffffff" edc:name="POS" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F824014" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVDRES0L" edc:desc="" edc:impl="0xffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------uuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CVDRES0L" edc:nzwidth="32" edc:por="--------xxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NEG" edc:mask="0xffffff" edc:name="NEG" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F824018" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="nnnnn-nnnnnnn-nnnnnnnnnnnnnnnnnn" edc:cname="CVDRES0D" edc:desc="" edc:impl="0xfbfbffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uuuuuuu-uuuuuuuuuuuuuuuuuu" edc:name="CVDRES0D" edc:nzwidth="32" edc:por="xxxxx-xxxxxxx-xxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DELTA" edc:mask="0x3ffff" edc:name="DELTA" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXINDEX" edc:mask="0x1f" edc:name="RXINDEX" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="SDNUM" edc:mask="0x3" edc:name="SDNUM" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXINDEX" edc:mask="0x1f" edc:name="TXINDEX" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F82401C" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F824020" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F824024" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F824028" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F82402C" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F824030" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F824034" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F824038" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F82403C" edc:offset="4"/>
      <edc:AdjustPoint edc:_addr="0x1F824040" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x1F824080" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:cname="CVDRX0" edc:desc="" edc:impl="0x3f3f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu--uuuuuu--uuuuuu--uuuuuu" edc:name="CVDRX0" edc:nzwidth="32" edc:por="--xxxxxx--xxxxxx--xxxxxx--xxxxxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXAN0" edc:mask="0x3f" edc:name="RXAN0" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN1" edc:mask="0x3f" edc:name="RXAN1" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN2" edc:mask="0x3f" edc:name="RXAN2" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN3" edc:mask="0x3f" edc:name="RXAN3" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F824084" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:cname="CVDRX1" edc:desc="" edc:impl="0x3f3f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu--uuuuuu--uuuuuu--uuuuuu" edc:name="CVDRX1" edc:nzwidth="32" edc:por="--xxxxxx--xxxxxx--xxxxxx--xxxxxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXAN4" edc:mask="0x3f" edc:name="RXAN4" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN5" edc:mask="0x3f" edc:name="RXAN5" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN6" edc:mask="0x3f" edc:name="RXAN6" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN7" edc:mask="0x3f" edc:name="RXAN7" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F824088" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="--nnnnnn--nnnnnn--nnnnnn--nnnnnn" edc:cname="CVDRX2" edc:desc="" edc:impl="0x3f3f3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu--uuuuuu--uuuuuu--uuuuuu" edc:name="CVDRX2" edc:nzwidth="32" edc:por="--xxxxxx--xxxxxx--xxxxxx--xxxxxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXAN8" edc:mask="0x3f" edc:name="RXAN8" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN9" edc:mask="0x3f" edc:name="RXAN9" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN10" edc:mask="0x3f" edc:name="RXAN10" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXAN11" edc:mask="0x3f" edc:name="RXAN11" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
