Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F82412C" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="CVDSD2T2" edc:desc="" edc:impl="0x7f7f7f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu-uuuuuuu-uuuuuuu-uuuuuuu" edc:name="CVDSD2T2" edc:nzwidth="32" edc:por="-xxxxxxx-xxxxxxx-xxxxxxx-xxxxxxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD2CONTIME" edc:mask="0x7f" edc:name="SD2CONTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD2POLTIME" edc:mask="0x7f" edc:name="SD2POLTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SD2OVRTIME" edc:mask="0x7f" edc:name="SD2OVRTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD2CHNTIME" edc:mask="0x7f" edc:name="SD2CHNTIME" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F824130" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVDSD3C1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CVDSD3C1" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD3OVRSAMP" edc:mask="0xff" edc:name="SD3OVRSAMP" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="SD3THRESH" edc:mask="0xffffff" edc:name="SD3THRESH" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F824134" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CVDSD3C2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CVDSD3C2" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD3RXBEG" edc:mask="0x3f" edc:name="SD3RXBEG" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD3RXSTRIDE1" edc:mask="0x3" edc:name="SD3RXSTRIDE1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD3RXEND" edc:mask="0x3f" edc:name="SD3RXEND" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD3RXSTRIDE2" edc:mask="0x3" edc:name="SD3RXSTRIDE2" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD3TXBEG" edc:mask="0x3f" edc:name="SD3TXBEG" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD3TXSTRIDE1" edc:mask="0x3" edc:name="SD3TXSTRIDE1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="SD3TXEND" edc:mask="0x3f" edc:name="SD3TXEND" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="SD3TXSTRIDE2" edc:mask="0x3" edc:name="SD3TXSTRIDE2" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F824138" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="nn--nnnn----nnnn-nnnnnnn-nnnnnnn" edc:cname="CVDSD3C3" edc:desc="" edc:impl="0xcf0f7f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu--uuuu----uuuu-uuuuuuu-uuuuuuu" edc:name="CVDSD3C3" edc:nzwidth="32" edc:por="xx--xxxx----xxxx-xxxxxxx-xxxxxxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD3CHGTIME" edc:mask="0x7f" edc:name="SD3CHGTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD3ACQTIME" edc:mask="0x7f" edc:name="SD3ACQTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CVDCPL" edc:mask="0x7" edc:name="CVDCPL" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="CVDEN" edc:mask="0x1" edc:name="CVDEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SD3MUT" edc:mask="0x1" edc:name="SD3MUT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD3SELF" edc:mask="0x1" edc:name="SD3SELF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD3IEN" edc:mask="0x1" edc:name="SD3IEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SD3BUF" edc:mask="0x1" edc:name="SD3BUF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SD3EN" edc:mask="0x3" edc:name="SD3EN" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82413C" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:access="-nnnnnnn-nnnnnnn-nnnnnnn-nnnnnnn" edc:cname="CVDSD3T2" edc:desc="" edc:impl="0x7f7f7f7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu-uuuuuuu-uuuuuuu-uuuuuuu" edc:name="CVDSD3T2" edc:nzwidth="32" edc:por="-xxxxxxx-xxxxxxx-xxxxxxx-xxxxxxx" ltx:memberofperipheral="CVD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SD3CONTIME" edc:mask="0x7f" edc:name="SD3CONTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD3POLTIME" edc:mask="0x7f" edc:name="SD3POLTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SD3OVRTIME" edc:mask="0x7f" edc:name="SD3OVRTIME" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SD3CHNTIME" edc:mask="0x7f" edc:name="SD3CHNTIME" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F824140" edc:_begin="0x0" edc:_end="0x204" edc:_modsrc="DOS-03367_adc_cvd_ctrl_upb_v1.Module" edc:_refcount="1" edc:offset="0xc4"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1F840000" edc:endaddr="0x1F860000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb3">
      <edc:AdjustPoint edc:_addr="0x1F840000" edc:offset="0x400"/>
      <edc:SFRDef edc:_addr="0x1F840400" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="2" edc:access="---------nnnnnnnnnnnnnnnnnnnnnnn" edc:cname="I2C2CON" edc:desc="" edc:impl="0x7fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------00000000x01000000000000" edc:name="I2C2CON" edc:nzwidth="32" edc:por="---------00000000x01000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="I2C2">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEN" edc:desc="" edc:mask="0x1" edc:name="SEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RSEN" edc:desc="" edc:mask="0x1" edc:name="RSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PEN" edc:desc="" edc:mask="0x1" edc:name="PEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RCEN" edc:desc="" edc:mask="0x1" edc:name="RCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACKEN" edc:desc="" edc:mask="0x1" edc:name="ACKEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACKDT" edc:desc="" edc:mask="0x1" edc:name="ACKDT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="STREN" edc:desc="" edc:mask="0x1" edc:name="STREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GCEN" edc:desc="" edc:mask="0x1" edc:name="GCEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SMEN" edc:desc="" edc:mask="0x1" edc:name="SMEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DISSLW" edc:desc="" edc:mask="0x1" edc:name="DISSLW" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="A10M" edc:desc="" edc:mask="0x1" edc:name="A10M" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="STRICT" edc:desc="" edc:mask="0x1" edc:name="STRICT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCLREL" edc:desc="" edc:mask="0x1" edc:name="SCLREL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DHEN" edc:desc="" edc:mask="0x1" edc:name="DHEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AHEN" edc:desc="" edc:mask="0x1" edc:name="AHEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SBCDE" edc:desc="" edc:mask="0x1" edc:name="SBCDE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SDAHT" edc:desc="" edc:mask="0x1" edc:name="SDAHT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BOEN" edc:desc="" edc:mask="0x1" edc:name="BOEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCIE" edc:desc="" edc:mask="0x1" edc:name="SCIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PCIE" edc:desc="" edc:mask="0x1" edc:name="PCIE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="11"/>
            <edc:SFRFieldDef edc:cname="IPMIEN" edc:desc="" edc:mask="0x1" edc:name="IPMIEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="I2CSIDL" edc:desc="" edc:mask="0x1" edc:name="I2CSIDL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="I2CEN" edc:desc="" edc:mask="0x1" edc:name="I2CEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="I2C 2" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F840410" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="2" edc:access="----------------rrr--crrccrccrrr" edc:cname="I2C2STAT" edc:desc="" edc:impl="0xe7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000--00000000000" edc:name="I2C2STAT" edc:nzwidth="32" edc:por="----------------000--00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C2">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TBF" edc:desc="" edc:mask="0x1" edc:name="TBF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RBF" edc:desc="" edc:mask="0x1" edc:name="RBF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="R_W" edc:desc="" edc:mask="0x1" edc:name="R_W" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="P" edc:desc="" edc:mask="0x1" edc:name="P" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="D_A" edc:desc="" edc:mask="0x1" edc:name="D_A" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2COV" edc:desc="" edc:mask="0x1" edc:name="I2COV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IWCOL" edc:desc="" edc:mask="0x1" edc:name="IWCOL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADD10" edc:desc="" edc:mask="0x1" edc:name="ADD10" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GCSTAT" edc:desc="" edc:mask="0x1" edc:name="GCSTAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BCL" edc:desc="" edc:mask="0x1" edc:name="BCL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ACKTIM" edc:desc="" edc:mask="0x1" edc:name="ACKTIM" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRSTAT" edc:desc="" edc:mask="0x1" edc:name="TRSTAT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ACKSTAT" edc:desc="" edc:mask="0x1" edc:name="ACKSTAT" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="I2CPOV" edc:desc="" edc:mask="0x1" edc:name="I2CPOV" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
