Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F840420" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="2" edc:access="----------------------nnnnnnnnnn" edc:cname="I2C2ADD" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="I2C2ADD" edc:nzwidth="32" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C2">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CADD" edc:desc="" edc:mask="0x3ff" edc:name="I2CADD" edc:nzwidth="10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F840430" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="2" edc:access="----------------------nnnnnnnnnn" edc:cname="I2C2MSK" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="I2C2MSK" edc:nzwidth="32" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C2">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CMSK" edc:desc="" edc:mask="0x3ff" edc:name="I2CMSK" edc:nzwidth="10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="AMSK" edc:desc="" edc:mask="0x3ff" edc:name="AMSK" edc:nzwidth="10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F840440" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="I2C2BRG" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="I2C2BRG" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C2">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CBRG" edc:desc="" edc:mask="0xffff" edc:name="I2CBRG" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F840450" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="2" edc:access="------------------------wwwwwwww" edc:cname="I2C2TRN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------11111111" edc:name="I2C2TRN" edc:nzwidth="32" edc:por="------------------------11111111" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C2">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CTRN" edc:desc="" edc:mask="0xff" edc:name="I2CTRN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F840460" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-01441_i2c_upb_v1_32bit.Module" edc:_refcount="2" edc:access="------------------------rrrrrrrr" edc:cname="I2C2RCV" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="I2C2RCV" edc:nzwidth="32" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C2">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CRCV" edc:desc="" edc:mask="0xff" edc:name="I2CRCV" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F840470" edc:offset="0x190"/>
      <edc:SFRDef edc:_addr="0x1F840600" edc:_begin="0x0" edc:_end="0x50" edc:_modsrc="DOS-02478_uart_irda_upb_v1_32bit.Module" edc:_refcount="2" edc:access="--------nn---nnnn-nnnnnnnnnnnnnn" edc:cname="U1MODE" edc:desc="" edc:grp="UART1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00---0000000000000000000" edc:name="U1MODE" edc:nzwidth="0x20" edc:por="--------00---0000000000000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="UART1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STSEL" edc:desc="" edc:mask="0x1" edc:name="STSEL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDSEL" edc:desc="" edc:mask="0x3" edc:name="PDSEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXINV" edc:desc="" edc:mask="0x1" edc:name="RXINV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ABAUD" edc:desc="" edc:mask="0x1" edc:name="ABAUD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPBACK" edc:desc="" edc:mask="0x1" edc:name="LPBACK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAKE" edc:desc="" edc:mask="0x1" edc:name="WAKE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UEN" edc:desc="" edc:mask="0x3" edc:name="UEN" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RTSMD" edc:desc="" edc:mask="0x1" edc:name="RTSMD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IREN" edc:desc="" edc:mask="0x1" edc:name="IREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVFDIS" edc:desc="" edc:mask="0x1" edc:name="OVFDIS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="" edc:mask="0x3" edc:name="CLKSEL" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SLPEN" edc:desc="" edc:mask="0x1" edc:name="SLPEN" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="RUNOVF" edc:mask="0x1" edc:name="RUNOVF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDSEL0" edc:desc="" edc:mask="0x1" edc:name="PDSEL0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDSEL1" edc:desc="" edc:mask="0x1" edc:name="PDSEL1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="UEN0" edc:desc="" edc:mask="0x1" edc:name="UEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UEN1" edc:desc="" edc:mask="0x1" edc:name="UEN1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="USIDL" edc:desc="" edc:mask="0x1" edc:name="USIDL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="UARTEN" edc:desc="" edc:mask="0x1" edc:name="UARTEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        <edc:FreezeBit edc:freezeval="1" edc:name="UART1" edc:pos="14"/>
      </edc:SFRDef>
