Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:AdjustPoint edc:_addr="0x1F840E50" edc:offset="0x1B0"/>
      <edc:SFRDef edc:_addr="0x1F841000" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-00740_icap_pb_v1.Module" edc:_refcount="1" edc:access="----------------n-n---nnnnnrrnnn" edc:cname="IC1CON" edc:desc="" edc:grp="ICAP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000---0000000000" edc:name="IC1CON" edc:nzwidth="0x20" edc:por="----------------000---0000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="ICAP1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICM" edc:desc="" edc:mask="0x7" edc:name="ICM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ICBNE" edc:desc="" edc:mask="0x1" edc:name="ICBNE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICOV" edc:desc="" edc:mask="0x1" edc:name="ICOV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICI" edc:desc="" edc:mask="0x3" edc:name="ICI" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ICTMR" edc:desc="" edc:mask="0x1" edc:name="ICTMR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C32" edc:desc="" edc:mask="0x1" edc:name="C32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FEDGE" edc:desc="" edc:mask="0x1" edc:name="FEDGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="ICM0" edc:desc="" edc:mask="0x1" edc:name="ICM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICM1" edc:desc="" edc:mask="0x1" edc:name="ICM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICM2" edc:desc="" edc:mask="0x1" edc:name="ICM2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ICI0" edc:desc="" edc:mask="0x1" edc:name="ICI0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICI1" edc:desc="" edc:mask="0x1" edc:name="ICI1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="ICSIDL" edc:desc="" edc:mask="0x1" edc:name="ICSIDL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="INPUT CAPTURE 1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F841010" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-00740_icap_pb_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="IC1BUF" edc:desc="" edc:grp="ICAP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="IC1BUF" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="ICAP1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC1BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="IC1BUF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F841020" edc:offset="0x1E0"/>
      <edc:SFRDef edc:_addr="0x1F841200" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-00740_icap_pb_v1.Module" edc:_refcount="2" edc:access="----------------n-n---nnnnnrrnnn" edc:cname="IC2CON" edc:desc="" edc:grp="ICAP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000---0000000000" edc:name="IC2CON" edc:nzwidth="0x20" edc:por="----------------000---0000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="ICAP2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICM" edc:desc="" edc:mask="0x7" edc:name="ICM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ICBNE" edc:desc="" edc:mask="0x1" edc:name="ICBNE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICOV" edc:desc="" edc:mask="0x1" edc:name="ICOV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICI" edc:desc="" edc:mask="0x3" edc:name="ICI" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ICTMR" edc:desc="" edc:mask="0x1" edc:name="ICTMR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C32" edc:desc="" edc:mask="0x1" edc:name="C32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FEDGE" edc:desc="" edc:mask="0x1" edc:name="FEDGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="ICM0" edc:desc="" edc:mask="0x1" edc:name="ICM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICM1" edc:desc="" edc:mask="0x1" edc:name="ICM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICM2" edc:desc="" edc:mask="0x1" edc:name="ICM2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ICI0" edc:desc="" edc:mask="0x1" edc:name="ICI0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICI1" edc:desc="" edc:mask="0x1" edc:name="ICI1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="ICSIDL" edc:desc="" edc:mask="0x1" edc:name="ICSIDL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="INPUT CAPTURE 2" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F841210" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-00740_icap_pb_v1.Module" edc:_refcount="2" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="IC2BUF" edc:desc="" edc:grp="ICAP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="IC2BUF" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="ICAP2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC2BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="IC2BUF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F841220" edc:offset="0x1E0"/>
      <edc:SFRDef edc:_addr="0x1F841400" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-00740_icap_pb_v1.Module" edc:_refcount="3" edc:access="----------------n-n---nnnnnrrnnn" edc:cname="IC3CON" edc:desc="" edc:grp="ICAP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000---0000000000" edc:name="IC3CON" edc:nzwidth="0x20" edc:por="----------------000---0000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="ICAP3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICM" edc:desc="" edc:mask="0x7" edc:name="ICM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ICBNE" edc:desc="" edc:mask="0x1" edc:name="ICBNE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICOV" edc:desc="" edc:mask="0x1" edc:name="ICOV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICI" edc:desc="" edc:mask="0x3" edc:name="ICI" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ICTMR" edc:desc="" edc:mask="0x1" edc:name="ICTMR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C32" edc:desc="" edc:mask="0x1" edc:name="C32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FEDGE" edc:desc="" edc:mask="0x1" edc:name="FEDGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="ICM0" edc:desc="" edc:mask="0x1" edc:name="ICM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICM1" edc:desc="" edc:mask="0x1" edc:name="ICM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICM2" edc:desc="" edc:mask="0x1" edc:name="ICM2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ICI0" edc:desc="" edc:mask="0x1" edc:name="ICI0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICI1" edc:desc="" edc:mask="0x1" edc:name="ICI1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="ICSIDL" edc:desc="" edc:mask="0x1" edc:name="ICSIDL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="INPUT CAPTURE 3" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F841410" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-00740_icap_pb_v1.Module" edc:_refcount="3" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="IC3BUF" edc:desc="" edc:grp="ICAP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="IC3BUF" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="ICAP3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC3BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="IC3BUF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F841420" edc:offset="0x1E0"/>
      <edc:SFRDef edc:_addr="0x1F841600" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-00740_icap_pb_v1.Module" edc:_refcount="4" edc:access="----------------n-n---nnnnnrrnnn" edc:cname="IC4CON" edc:desc="" edc:grp="ICAP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000---0000000000" edc:name="IC4CON" edc:nzwidth="0x20" edc:por="----------------000---0000000000" edc:portals="CLR SET INV" ltx:baseofperipheral="ICAP4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICM" edc:desc="" edc:mask="0x7" edc:name="ICM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="ICBNE" edc:desc="" edc:mask="0x1" edc:name="ICBNE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICOV" edc:desc="" edc:mask="0x1" edc:name="ICOV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICI" edc:desc="" edc:mask="0x3" edc:name="ICI" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="ICTMR" edc:desc="" edc:mask="0x1" edc:name="ICTMR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C32" edc:desc="" edc:mask="0x1" edc:name="C32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FEDGE" edc:desc="" edc:mask="0x1" edc:name="FEDGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="ICM0" edc:desc="" edc:mask="0x1" edc:name="ICM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICM1" edc:desc="" edc:mask="0x1" edc:name="ICM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICM2" edc:desc="" edc:mask="0x1" edc:name="ICM2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ICI0" edc:desc="" edc:mask="0x1" edc:name="ICI0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ICI1" edc:desc="" edc:mask="0x1" edc:name="ICI1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="ICSIDL" edc:desc="" edc:mask="0x1" edc:name="ICSIDL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="INPUT CAPTURE 4" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F841610" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-00740_icap_pb_v1.Module" edc:_refcount="4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="IC4BUF" edc:desc="" edc:grp="ICAP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="IC4BUF" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="ICAP4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC4BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="IC4BUF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F841620" edc:offset="0x9E0"/>
      <edc:SFRDef edc:_addr="0x1F842000" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00749_ocmp_pb_v1.Module" edc:_refcount="1" edc:access="----------------n-n-------nrnnnn" edc:cname="OC1CON" edc:desc="" edc:grp="OCMP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000-------000000" edc:name="OC1CON" edc:nzwidth="0x20" edc:por="----------------000-------000000" edc:portals="CLR SET INV" ltx:baseofperipheral="OCMP1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OCM" edc:desc="" edc:mask="0x7" edc:name="OCM" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="OCTSEL" edc:desc="" edc:mask="0x1" edc:name="OCTSEL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCFLT" edc:desc="" edc:mask="0x1" edc:name="OCFLT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC32" edc:desc="" edc:mask="0x1" edc:name="OC32" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="OCM0" edc:desc="" edc:mask="0x1" edc:name="OCM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCM1" edc:desc="" edc:mask="0x1" edc:name="OCM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OCM2" edc:desc="" edc:mask="0x1" edc:name="OCM2" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="OCSIDL" edc:desc="" edc:mask="0x1" edc:name="OCSIDL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="OUTPUT COMPARE 1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F842010" edc:_begin="0x0" edc:_end="0x30" edc:_modsrc="DOS-00749_ocmp_pb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="OC1R" edc:desc="" edc:grp="OCMP1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="OC1R" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="OCMP1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OC1R" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="OC1R" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
