Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F843060" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ETHPMM0" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ETHPMM0" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PMM" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="PMM" edc:nzwidth="0x20"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="PMMLOWER" edc:desc="" edc:mask="0xffffffff" edc:name="PMMLOWER" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F843070" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ETHPMM1" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ETHPMM1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PMM" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="PMM" edc:nzwidth="0x20"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="PMMUPPER" edc:desc="" edc:mask="0xffffffff" edc:name="PMMUPPER" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F843080" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ETHPMCS" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="ETHPMCS" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PMCS" edc:desc="" edc:mask="0xffff" edc:name="PMCS" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F843090" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ETHPMO" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="ETHPMO" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PMO" edc:desc="" edc:mask="0xffff" edc:name="PMO" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8430A0" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------nn-nnnnnnnnnnnnn" edc:cname="ETHRXFC" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ETHRXFC" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BCEN" edc:desc="" edc:mask="0x1" edc:name="BCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCEN" edc:desc="" edc:mask="0x1" edc:name="MCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOTMEEN" edc:desc="" edc:mask="0x1" edc:name="NOTMEEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UCEN" edc:desc="" edc:mask="0x1" edc:name="UCEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNTEN" edc:desc="" edc:mask="0x1" edc:name="RUNTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNTERREN" edc:desc="" edc:mask="0x1" edc:name="RUNTERREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCOKEN" edc:desc="" edc:mask="0x1" edc:name="CRCOKEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CRCERREN" edc:desc="" edc:mask="0x1" edc:name="CRCERREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMMODE" edc:desc="" edc:mask="0xf" edc:name="PMMODE" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="NOTPM" edc:desc="" edc:mask="0x1" edc:name="NOTPM" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MPEN" edc:desc="" edc:mask="0x1" edc:name="MPEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HTEN" edc:desc="" edc:mask="0x1" edc:name="HTEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8430B0" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:cname="ETHRXWM" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx00000000xxxxxxxx00000000" edc:name="ETHRXWM" edc:nzwidth="0x20" edc:por="xxxxxxxx00000000xxxxxxxx00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXEWM" edc:desc="" edc:mask="0xff" edc:name="RXEWM" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="RXFWM" edc:desc="" edc:mask="0xff" edc:name="RXFWM" edc:nzwidth="0x8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8430C0" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="-----------------nn---nnnnn-nnnn" edc:cname="ETHIEN" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxx00xxx00000x0000" edc:name="ETHIEN" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxx00xxx00000x0000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXOVFLWIE" edc:desc="" edc:mask="0x1" edc:name="RXOVFLWIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFNAIE" edc:desc="" edc:mask="0x1" edc:name="RXBUFNAIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABORTIE" edc:desc="" edc:mask="0x1" edc:name="TXABORTIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDONEIE" edc:desc="" edc:mask="0x1" edc:name="TXDONEIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RXACTIE" edc:desc="" edc:mask="0x1" edc:name="RXACTIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PKTPENDIE" edc:desc="" edc:mask="0x1" edc:name="PKTPENDIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDONEIE" edc:desc="" edc:mask="0x1" edc:name="RXDONEIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FWMARKIE" edc:desc="" edc:mask="0x1" edc:name="FWMARKIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWMARKIE" edc:desc="" edc:mask="0x1" edc:name="EWMARKIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RXBUSEIE" edc:desc="" edc:mask="0x1" edc:name="RXBUSEIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUSEIE" edc:desc="" edc:mask="0x1" edc:name="TXBUSEIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
