Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8430D0" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="-----------------nn---rrnrn-nnnn" edc:cname="ETHIRQ" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxx00xxx00000x0000" edc:name="ETHIRQ" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxx00xxx00000x0000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXOVFLW" edc:desc="" edc:mask="0x1" edc:name="RXOVFLW" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBUFNA" edc:desc="" edc:mask="0x1" edc:name="RXBUFNA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXABORT" edc:desc="" edc:mask="0x1" edc:name="TXABORT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDONE" edc:desc="" edc:mask="0x1" edc:name="TXDONE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RXACT" edc:desc="" edc:mask="0x1" edc:name="RXACT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PKTPEND" edc:desc="" edc:mask="0x1" edc:name="PKTPEND" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDONE" edc:desc="" edc:mask="0x1" edc:name="RXDONE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FWMARK" edc:desc="" edc:mask="0x1" edc:name="FWMARK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWMARK" edc:desc="" edc:mask="0x1" edc:name="EWMARK" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RXBUSE" edc:desc="" edc:mask="0x1" edc:name="RXBUSE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUSE" edc:desc="" edc:mask="0x1" edc:name="TXBUSE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8430E0" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="--------nnnnnnnn--------nnn-----" edc:cname="ETHSTAT" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx00000000xxxxxxxx000xxxxx" edc:name="ETHSTAT" edc:nzwidth="0x20" edc:por="xxxxxxxx00000000xxxxxxxx000xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RXBUSY" edc:desc="" edc:mask="0x1" edc:name="RXBUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUSY" edc:desc="" edc:mask="0x1" edc:name="TXBUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="BUFCNT" edc:desc="" edc:mask="0xff" edc:name="BUFCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="ETHBUSY" edc:desc="" edc:mask="0x1" edc:name="ETHBUSY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8430F0" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F843100" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ETHRXOVFLOW" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="RXOVFLOW" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXOVFLWCNT" edc:desc="" edc:mask="0xffff" edc:name="RXOVFLWCNT" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F843110" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ETHFRMTXOK" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="ETHFRMTXOK" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FRMTXOKCNT" edc:desc="" edc:mask="0x1" edc:name="FRMTXOKCNT" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F843120" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ETHSCOLFRM" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="ETHSCOLFRM" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCOLFRMCNT" edc:desc="" edc:mask="0xffff" edc:name="SCOLFRMCNT" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F843130" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ETHMCOLFRM" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="ETHMCOLFRM" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MCOLFRMCNT" edc:desc="" edc:mask="0xffff" edc:name="MCOLFRMCNT" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="MCOLFRM_CNT" edc:desc="" edc:mask="0xffff" edc:name="MCOLFRM_CNT" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F843140" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ETHFRMRXOK" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="ETHFRMRXOK" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FRMRXOKCNT" edc:desc="" edc:mask="0xffff" edc:name="FRMRXOKCNT" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F843150" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ETHFCSERR" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="ETHFCSERR" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FCSERRCNT" edc:desc="" edc:mask="0xffff" edc:name="FCSERRCNT" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
