Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F843290" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="------------------------------nn" edc:cname="EMAC1MCMD" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx00" edc:name="EMAC1MCMD" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx00" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMCMD"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="READ" edc:desc="" edc:mask="0x1" edc:name="READ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCAN" edc:desc="" edc:mask="0x1" edc:name="SCAN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8432A0" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="-------------------nnnnn---nnnnn" edc:cname="EMAC1MADR" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxx00001xxx00000" edc:name="EMAC1MADR" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxx00001xxx00000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMADR"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REGADDR" edc:desc="" edc:mask="0x1" edc:name="REGADDR" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PHYADDR" edc:desc="" edc:mask="0x1" edc:name="PHYADDR" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8432B0" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="EMAC1MWTD" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="EMAC1MWTD" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMWTD"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MWTD" edc:desc="" edc:mask="0xffff" edc:name="PEMACMWTD" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8432C0" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="EMAC1MRDD" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx0000000000000000" edc:name="EMAC1MRDD" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxx0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMRDD"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MRDD" edc:desc="" edc:mask="0x1" edc:name="MRDD" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8432D0" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------------------nnnn" edc:cname="EMAC1MIND" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxx0000" edc:name="EMAC1MIND" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxx0000" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxMIND"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MIIMBUSY" edc:desc="" edc:mask="0x1" edc:name="MIIMBUSY" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SCAN" edc:desc="" edc:mask="0x1" edc:name="SCAN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOTVALID" edc:desc="" edc:mask="0x1" edc:name="NOTVALID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINKFAIL" edc:desc="" edc:mask="0x1" edc:name="LINKFAIL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8432E0" edc:offset="16"/>
      <edc:AdjustPoint edc:_addr="0x1F8432F0" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F843300" edc:_begin="0x0" edc:_end="0x330" edc:_modsrc="DOS-01114_eth_bvci_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="EMAC1SA0" edc:desc="" edc:grp="ETH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="EMAC1SA0" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="ETH">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="EMACxSA0"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STNADDR5" edc:desc="" edc:mask="0x1" edc:name="STNADDR5" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="STNADDR6" edc:desc="" edc:mask="0x1" edc:name="STNADDR6" edc:nzwidth="0x8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
