Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8442C0" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="U1BDTP2" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="U1BDTP2" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BDTPTRH" edc:desc="" edc:mask="0xff" edc:name="BDTPTRH" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8442D0" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="U1BDTP3" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="U1BDTP3" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BDTPTRU" edc:desc="" edc:mask="0xff" edc:name="BDTPTRU" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8442E0" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="------------------------nnnn---n" edc:cname="U1CNFG1" edc:desc="" edc:grp="USB" edc:impl="0xfffffff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------0000---1" edc:name="U1CNFG1" edc:nzwidth="0x20" edc:por="------------------------xxxx-00x" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UASUSPND" edc:desc="" edc:mask="0x1" edc:name="UASUSPND" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="USBSIDL" edc:desc="" edc:mask="0x1" edc:name="USBSIDL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="USBFRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="USBFRZ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UOEMON" edc:desc="" edc:mask="0x1" edc:name="UOEMON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UTEYE" edc:desc="" edc:mask="0x1" edc:name="UTEYE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8442F0" edc:offset="16"/>
      <edc:SFRDef edc:_addr="0x1F844300" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="------------------------nn-nnnnn" edc:cname="U1EP0" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00-00000" edc:name="U1EP0" edc:nzwidth="0x20" edc:por="------------------------00-00000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTXEN" edc:desc="" edc:mask="0x1" edc:name="EPTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPRXEN" edc:desc="" edc:mask="0x1" edc:name="EPRXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RETRYDIS" edc:desc="" edc:mask="0x1" edc:name="RETRYDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSPD" edc:desc="" edc:mask="0x1" edc:name="LSPD" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F844310" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="U1EP1" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="U1EP1" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTXEN" edc:desc="" edc:mask="0x1" edc:name="EPTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPRXEN" edc:desc="" edc:mask="0x1" edc:name="EPRXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F844320" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="U1EP2" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="U1EP2" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTXEN" edc:desc="" edc:mask="0x1" edc:name="EPTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPRXEN" edc:desc="" edc:mask="0x1" edc:name="EPRXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F844330" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="U1EP3" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="U1EP3" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTXEN" edc:desc="" edc:mask="0x1" edc:name="EPTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPRXEN" edc:desc="" edc:mask="0x1" edc:name="EPRXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
