Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8443A0" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="U1EP10" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="U1EP10" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTXEN" edc:desc="" edc:mask="0x1" edc:name="EPTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPRXEN" edc:desc="" edc:mask="0x1" edc:name="EPRXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8443B0" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="U1EP11" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="U1EP11" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTXEN" edc:desc="" edc:mask="0x1" edc:name="EPTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPRXEN" edc:desc="" edc:mask="0x1" edc:name="EPRXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8443C0" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="U1EP12" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="U1EP12" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTXEN" edc:desc="" edc:mask="0x1" edc:name="EPTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPRXEN" edc:desc="" edc:mask="0x1" edc:name="EPRXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8443D0" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="U1EP13" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="U1EP13" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTXEN" edc:desc="" edc:mask="0x1" edc:name="EPTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPRXEN" edc:desc="" edc:mask="0x1" edc:name="EPRXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8443E0" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="U1EP14" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="U1EP14" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTXEN" edc:desc="" edc:mask="0x1" edc:name="EPTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPRXEN" edc:desc="" edc:mask="0x1" edc:name="EPRXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8443F0" edc:_begin="0x0" edc:_end="0x400" edc:_modsrc="DOS-02813a-usb-otgcore-pb-v3.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="U1EP15" edc:desc="" edc:grp="USB" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="U1EP15" edc:nzwidth="0x20" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="USB1 USB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTXEN" edc:desc="" edc:mask="0x1" edc:name="EPTXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPRXEN" edc:desc="" edc:mask="0x1" edc:name="EPRXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F844400" edc:offset="0x1"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1F870000" edc:endaddr="0x1F880000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_pb4">
      <edc:SFRDef edc:_addr="0x1F870000" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-01261_tmr_rtcc_pb_v2.Module" edc:_refcount="1" edc:access="------nnnnnnnnnnnnn--nnnnn--nrrn" edc:cname="RTCCON" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000000000000--00000--0000" edc:name="RTCCON" edc:nzwidth="0x20" edc:por="------0000000000000--00000--0000" edc:portals="CLR SET INV" ltx:baseofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RTCOE" edc:desc="" edc:mask="0x1" edc:name="RTCOE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HALFSEC" edc:desc="" edc:mask="0x1" edc:name="HALFSEC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCSYNC" edc:desc="" edc:mask="0x1" edc:name="RTCSYNC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCWREN" edc:desc="" edc:mask="0x1" edc:name="RTCWREN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RTCCLKON" edc:desc="" edc:mask="0x1" edc:name="RTCCLKON" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RTCOUTSEL" edc:desc="" edc:mask="0x3" edc:name="RTCOUTSEL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="RTCCLKSEL" edc:desc="" edc:mask="0x3" edc:name="RTCCLKSEL" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAL" edc:desc="" edc:mask="0x3ff" edc:name="CAL" edc:nzwidth="0xa"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="REAL TIME CLOCK" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F870010" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-01261_tmr_rtcc_pb_v2.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="RTCALRM" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="RTCALRM" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ARPT" edc:desc="" edc:mask="0xff" edc:name="ARPT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="AMASK" edc:desc="" edc:mask="0xf" edc:name="AMASK" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ALRMSYNC" edc:desc="" edc:mask="0x1" edc:name="ALRMSYNC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PIV" edc:desc="" edc:mask="0x1" edc:name="PIV" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHIME" edc:desc="" edc:mask="0x1" edc:name="CHIME" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ALRMEN" edc:desc="" edc:mask="0x1" edc:name="ALRMEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
