Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F870020" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-01261_tmr_rtcc_pb_v2.Module" edc:_refcount="1" edc:access="rrrnnnnnnnnnnnnnrnnnnnnn--------" edc:cname="RTCTIME" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000xxxxxxxxxxxxx0xxxxxxx--------" edc:name="RTCTIME" edc:nzwidth="0x20" edc:por="000xxxxxxxxxxxxx0xxxxxxx--------" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="SEC01" edc:desc="" edc:mask="0xf" edc:name="SEC01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SEC10" edc:desc="" edc:mask="0xf" edc:name="SEC10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN01" edc:desc="" edc:mask="0xf" edc:name="MIN01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN10" edc:desc="" edc:mask="0xf" edc:name="MIN10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR01" edc:desc="" edc:mask="0xf" edc:name="HR01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR10" edc:desc="" edc:mask="0xf" edc:name="HR10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F870030" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-01261_tmr_rtcc_pb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnrrrnnnnnrrnnnnnn----rnnn" edc:cname="RTCDATE" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx000xxxxx00xxxxxx----0xxx" edc:name="RTCDATE" edc:nzwidth="0x20" edc:por="xxxxxxxx000xxxxx00xxxxxx----0xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDAY01" edc:desc="" edc:mask="0xf" edc:name="WDAY01" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DAY01" edc:desc="" edc:mask="0xf" edc:name="DAY01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DAY10" edc:desc="" edc:mask="0xf" edc:name="DAY10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH01" edc:desc="" edc:mask="0xf" edc:name="MONTH01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH10" edc:desc="" edc:mask="0xf" edc:name="MONTH10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="YEAR01" edc:desc="" edc:mask="0xf" edc:name="YEAR01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="YEAR10" edc:desc="" edc:mask="0xf" edc:name="YEAR10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F870040" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-01261_tmr_rtcc_pb_v2.Module" edc:_refcount="1" edc:access="rrrnnnnnrnnnnnnnrnnnnnnn--------" edc:cname="ALRMTIME" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000xxxxx0xxxxxxx0xxxxxxx--------" edc:name="ALRMTIME" edc:nzwidth="0x20" edc:por="000xxxxx0xxxxxxx0xxxxxxx--------" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="SEC01" edc:desc="" edc:mask="0xf" edc:name="SEC01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SEC10" edc:desc="" edc:mask="0xf" edc:name="SEC10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN01" edc:desc="" edc:mask="0xf" edc:name="MIN01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MIN10" edc:desc="" edc:mask="0xf" edc:name="MIN10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR01" edc:desc="" edc:mask="0xf" edc:name="HR01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="HR10" edc:desc="" edc:mask="0xf" edc:name="HR10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F870050" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-01261_tmr_rtcc_pb_v2.Module" edc:_refcount="1" edc:access="--------rrrnnnnnrrnnnnnn----rnnn" edc:cname="ALRMDATE" edc:desc="" edc:grp="RTCC" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000xxxxx00xxxxxx----0xxx" edc:name="ALRMDATE" edc:nzwidth="0x20" edc:por="--------000xxxxx00xxxxxx----0xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="RTCC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDAY01" edc:desc="" edc:mask="0xf" edc:name="WDAY01" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="DAY01" edc:desc="" edc:mask="0xf" edc:name="DAY01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DAY10" edc:desc="" edc:mask="0xf" edc:name="DAY10" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH01" edc:desc="" edc:mask="0xf" edc:name="MONTH01" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="MONTH10" edc:desc="" edc:mask="0xf" edc:name="MONTH10" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F870060" edc:offset="0xfa0"/>
      <edc:SFRDef edc:_addr="0x1F871000" edc:access="----------------n-nn---n------nn" edc:cname="DSCON" edc:desc="" edc:impl="0xb103" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------u-uu---u------uu" edc:name="DSCON" edc:nzwidth="32" edc:por="----------------x-xx---x------xx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RELEASE" edc:mask="0x1" edc:name="RELEASE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSBOR" edc:mask="0x1" edc:name="DSBOR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RTCCWDIS" edc:mask="0x1" edc:name="RTCCWDIS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RTCDIS" edc:mask="0x1" edc:name="RTCDIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSGPREN" edc:mask="0x1" edc:name="DSGPREN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSEN" edc:mask="0x1" edc:name="DSEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F871004" edc:access="-----------------------nn-nnnnn-" edc:cname="DSWAKE" edc:desc="" edc:impl="0x1be" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------uu-uuuuu-" edc:name="DSWAKE" edc:nzwidth="32" edc:por="-----------------------xx-xxxxx-">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ICD" edc:mask="0x1" edc:name="ICD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSMCLR" edc:mask="0x1" edc:name="DSMCLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSRTC" edc:mask="0x1" edc:name="DSRTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSWDT" edc:mask="0x1" edc:name="DSWDT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXT" edc:mask="0x1" edc:name="EXT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSFLT" edc:mask="0x1" edc:name="DSFLT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSINT0" edc:mask="0x1" edc:name="DSINT0" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
