Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F871064" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR22" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR22" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F871068" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR23" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR23" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F87106C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR24" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR24" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F871070" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR25" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR25" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F871074" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR26" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR26" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F871078" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR27" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR27" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F87107C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR28" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR28" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F871080" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR29" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR29" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F871084" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR30" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR30" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F871088" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR31" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR31" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F87108C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR32" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="DSGPR32" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F871090" edc:offset="0xff70"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1F8C0000" edc:endaddr="0x1F8E6000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph_indep_a">
      <edc:AdjustPoint edc:_addr="0x1F8C0000" edc:offset="0x21000"/>
      <edc:SFRDef edc:_addr="0x1F8E1000" edc:_begin="0x0" edc:_end="0x6c" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1XCON1" edc:desc="SQI XIP Control Register 1" edc:impl="0x3fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u00000001011000000110000000000" edc:name="SQI1XCON1" edc:nzwidth="32" edc:por="--x00000001011000000110000000000" ltx:baseofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TYPECMD" edc:desc="The boot controller will send the command in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPECMD" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode command is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode command is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode command is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEADDR" edc:desc="The boot controller will send the address in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPEADDR" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode address is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode address is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode address is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEMODE" edc:desc="The boot controller will send the mode in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPEMODE" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEDUMMY" edc:desc="The boot controller will send the dummy in Single Lange, Dual Lane, or Quad Lane" edc:mask="0x3" edc:name="TYPEDUMMY" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode dummy is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode dummy is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lange mode dummy is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEDATA" edc:desc="The boot controller will receive the data in Single Lane, Dual Lane, or Quad Lane." edc:mask="0x3" edc:name="TYPEDATA" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Quad Lane mode data is enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Dual Lane mode data is enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Single Lane mode data is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="READOPCODE" edc:desc="These bits contain the 8-bit op code value for read operation." edc:mask="0xff" edc:name="READOPCODE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="ADDRBYTES" edc:desc="" edc:mask="0x7" edc:name="ADDRBYTES" edc:nzwidth="3">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="Four address bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="Three address bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Two address bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="One address bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Zero address bytes" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DUMMYBYTES" edc:desc="Transmit Dummy Bytes bits" edc:mask="0x7" edc:name="DUMMYBYTES" edc:nzwidth="3">
              <edc:SFRFieldSemantic edc:desc="Transmit seven dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="Transmit six dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="Transmit five dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="Transmit four dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="Transmit three dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Transmit two dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Transmit one dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Transmit zero dummy bytes after the address bytes" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRCMD" edc:desc="SQI DDR Command Mode bit" edc:mask="0x1" edc:name="DDRCMD" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI command bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI command bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRADDR" edc:desc="SQI Address Mode bit" edc:mask="0x1" edc:name="DDRADDR" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI address bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI address bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRMODE" edc:desc="SQI DDR Mode bit" edc:mask="0x1" edc:name="DDRMODE" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI mode bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI mode bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRDUMMY" edc:desc="SQI Dummy DDR Mode bit" edc:mask="0x1" edc:name="DDRDUMMY" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI dummy bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI dummy bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DDRDATA" edc:desc="SQI Data DDR Mode bit" edc:mask="0x1" edc:name="DDRDATA" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI data bytes are transferred in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI data bytes are transferred in SDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SDRCMD" edc:desc="SQI Command in SDR Mode bit" edc:mask="0x1" edc:name="SDRCMD" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI command is in SDR mode and SQI data is in DDR mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI command is in DDR mode and SQI data is in DDR mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E1004" edc:_begin="0x0" edc:_end="0x6c" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:access="--------------------nnnnnnnnnnnn" edc:cname="SQI1XCON2" edc:desc="SQI XIP Control Register 2" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000010100000" edc:name="SQI1XCON2" edc:nzwidth="32" edc:por="--------------------000010100000" ltx:memberofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MODECODE" edc:desc="These bits contain the 8-bit code value for the mode bits." edc:mask="0xff" edc:name="MODECODE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="MODEBYTES" edc:desc="Mode Byte Cycle Enable bits" edc:mask="0x3" edc:name="MODEBYTES" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Three cycles" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Two cycles" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="One cycle" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Zero cycles" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DEVSEL" edc:desc="Device Select bits" edc:mask="0x3" edc:name="DEVSEL" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Device 1 is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Device 0 is selected" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
