Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8E1008" edc:_begin="0x0" edc:_end="0x6c" edc:_modsrc="DOS-EIP-00307r6-sqi-v3.Module" edc:_refcount="1" edc:access="------nnn-nnnnnnn--n-nn---nnnnnn" edc:cname="SQI1CFG" edc:desc="SQI Configuration Register" edc:impl="0x3bf977f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------000-0000001--0-00---000000" edc:name="SQI1CFG" edc:nzwidth="32" edc:por="------000-0000001--0-00---000000" ltx:memberofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Mode Select bits" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:desc="XIP mode is selected (when this mode is entered, the module behaves as if executing in place (XIP),but uses the register data to control timing)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="DMA mode is selected" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="CPU mode is selected (the module is controlled by the CPU in PIO mode. This mode is entered whenleaving Boot or XIP mode)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPHA" edc:desc="Clock Phase Select bit" edc:mask="0x1" edc:name="CPHA" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="SQICLK starts toggling at the start of the first data bit" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQICLK starts toggling at the middle of the first data bit" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock Polarity Select bit" edc:mask="0x1" edc:name="CPOL" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Active-low SQICLK (SQICLK high is the Idle state)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Active-high SQICLK (SQICLK low is the Idle state)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LSBF" edc:desc="Data Format Select bit" edc:mask="0x1" edc:name="LSBF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="LSB is send or received first" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="MSB is sent or received first" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="WP" edc:desc="In Single Lane or Dual Lane mode, this bit is used to drive the SQID2 pin, which can be used with deviceswith a write-protect pin. The meaning of the values for this bit will depend on the device to which SQID2 isconnected." edc:mask="0x1" edc:name="WP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HOLD" edc:desc="Hold bit. In Single Lane or Dual Lane mode, this bit is used to drive the SQID3 pin, which can be used for devices with a HOLD input pin. The meaning of the values for this bit will depend on the device to which SQID3 is connected." edc:mask="0x1" edc:name="HOLD" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="BURSTEN" edc:desc="Burst Configuration bit" edc:mask="0x1" edc:name="BURSTEN" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Burst is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Burst is not enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="RESET" edc:desc="Software Reset Select bit" edc:mask="0x1" edc:name="RESET" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="A reset pulse is generated" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="A reset pulse is not generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXBUFRST" edc:desc="Transmit Buffer Reset bit" edc:mask="0x1" edc:name="TXBUFRST" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="A reset pulse is generated clearing the transmit buffer" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="A reset pulse is not generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXBUFRST" edc:desc="Receive Buffer Reset bit" edc:mask="0x1" edc:name="RXBUFRST" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="A reset pulse is generated clearing the receive buffer" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="A reset pulse is not generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONBUFRST" edc:desc="Control Buffer Reset bit" edc:mask="0x1" edc:name="CONBUFRST" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="A reset pulse is generated, clearing the control buffer" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="A reset pulse is not generated" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DATAEN" edc:desc="Data Output Enable bits" edc:mask="0x3" edc:name="DATAEN" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="SQID3-SQID0 outputs are enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="SQID1 and SQID0 data outputs are enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQID0 data output is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SQIEN" edc:desc="SQI Enable bit" edc:mask="0x1" edc:name="SQIEN" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="SQI module is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="SQI module is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSEN" edc:desc="Chip Select Output Enable bits" edc:mask="0x3" edc:name="CSEN" edc:nzwidth="2">
              <edc:SFRFieldSemantic edc:desc="Chip Select 0 and Chip Select 1 are used" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:SFRFieldSemantic edc:desc="Chip Select 1 is used (Chip Select 0 is not used)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:desc="Chip Select 0 is used (Chip Select 1 is not used)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Chip Select 0 and Chip Select 1 are not used" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
