Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8E4004" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="------------------------nnn--nnn" edc:cname="CECON" edc:desc="" edc:impl="0xe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------000--000" edc:name="CECON" edc:nzwidth="32" edc:por="------------------------000--000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMAEN" edc:desc="" edc:mask="0x1" edc:name="DMAEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BDPPLEN" edc:desc="" edc:mask="0x1" edc:name="BDPPLEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BDPCHST" edc:desc="" edc:mask="0x1" edc:name="BDPCHST" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SWAPEN" edc:desc="" edc:mask="0x1" edc:name="SWAPEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="" edc:mask="0x1" edc:name="SWRST" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWAPOEN" edc:mask="0x1" edc:name="SWAPOEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4008" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEBDADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CEBDADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BDPADDR" edc:desc="" edc:mask="0xffffffff" edc:name="BDPADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E400C" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEBDPADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CEBDPADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BASEADDR" edc:desc="" edc:mask="0xffffffff" edc:name="BASEADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4010" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="rrrrrrrr--rrrrrrrrrrrrrrrrrrrrrr" edc:cname="CESTAT" edc:desc="" edc:impl="0xff3fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000--0000000000000000000000" edc:name="CESTAT" edc:nzwidth="32" edc:por="00000000--0000000000000000000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BDCTRL" edc:desc="" edc:mask="0xffff" edc:name="BDCTRL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="ACTIVE" edc:desc="" edc:mask="0x1" edc:name="ACTIVE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="START" edc:desc="" edc:mask="0x1" edc:name="START" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BDSTATE" edc:desc="" edc:mask="0xf" edc:name="BDSTATE" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ERRPHASE" edc:desc="" edc:mask="0x3" edc:name="ERRPHASE" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ERROP" edc:desc="" edc:mask="0x7" edc:name="ERROP" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="ERRMODE" edc:desc="" edc:mask="0x7" edc:name="ERRMODE" edc:nzwidth="3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4014" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="----------------------------rrrr" edc:cname="CEINTSRC" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CEINTSRC" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PENDIF" edc:desc="" edc:mask="0x1" edc:name="PENDIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CBDIF" edc:desc="" edc:mask="0x1" edc:name="CBDIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PKTIF" edc:desc="" edc:mask="0x1" edc:name="PKTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AREIF" edc:desc="" edc:mask="0x1" edc:name="AREIF" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4018" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="----------------------------nnnn" edc:cname="CEINTEN" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CEINTEN" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PENDIE" edc:desc="" edc:mask="0x1" edc:name="PENDIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CBDIE" edc:desc="" edc:mask="0x1" edc:name="CBDIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PKTIE" edc:desc="" edc:mask="0x1" edc:name="PKTIE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AREIE" edc:desc="" edc:mask="0x1" edc:name="AREIE" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E401C" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CEPOLLCON" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CEPOLLCON" edc:nzwidth="32" edc:por="----------------0000000000000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BDPPLCON" edc:desc="" edc:mask="0xffff" edc:name="BDPPLCON" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
