Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8E4020" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="CEHDLEN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CEHDLEN" edc:nzwidth="32" edc:por="------------------------00000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HDRLEN" edc:desc="" edc:mask="0xff" edc:name="HDRLEN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4024" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="CETRLLEN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="CETRLLEN" edc:nzwidth="32" edc:por="------------------------00000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRLRLEN" edc:desc="" edc:mask="0xff" edc:name="TRLRLEN" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4028" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="CEDTXSTAT" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="CEDTXSTAT" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DTXSTATE" edc:desc="" edc:mask="0xf" edc:name="DTXSTATE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DTXBLEN" edc:desc="" edc:mask="0xffff" edc:name="DTXBLEN" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E402C" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="CEDRXSTAT" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="CEDRXSTAT" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DRXSTATE" edc:desc="" edc:mask="0xf" edc:name="DRXSTATE" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DRXBLEN" edc:desc="" edc:mask="0xffff" edc:name="DRXBLEN" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4030" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="----------------------------rrrr" edc:cname="CEDCRYPTOADDR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CEDCRYPTOADDR" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CRYPTOADDR" edc:desc="" edc:mask="0xf" edc:name="CRYPTOADDR" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4034" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="----------------------------rrrr" edc:cname="CEDHASHADDR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CEDHASHADDR" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="HASHADDR" edc:desc="" edc:mask="0xf" edc:name="HASHADDR" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4038" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="------------------------------rr" edc:cname="CEDTXADDR" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="CEDTXADDR" edc:nzwidth="32" edc:por="------------------------------00" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXDADDR" edc:desc="" edc:mask="0x3" edc:name="TXDADDR" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E403C" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEDML0ADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CEDML0ADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ML0ADDR" edc:desc="" edc:mask="0xffffffff" edc:name="ML0ADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4040" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEDML1ADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CEDML1ADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ML1ADDR" edc:desc="" edc:mask="0xffffffff" edc:name="ML1ADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
