Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8E4044" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEDOL0ADDR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CEDOL0ADDR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OL0ADDR" edc:desc="" edc:mask="0xffffffff" edc:name="OL0ADDR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4048" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="----------------------------rrrr" edc:cname="CEDCSTADDDR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CEDCSTADDDR" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSTATEADDR" edc:desc="" edc:mask="0xf" edc:name="CSTATEADDR" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E404C" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="------------------------------rr" edc:cname="CEDMTSKADDR" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------xx" edc:name="CEDMTSKADDR" edc:nzwidth="32" edc:por="------------------------------xx" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MTASKADDR" edc:desc="" edc:mask="0x3" edc:name="MTASKADDR" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4050" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CEDSACON" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CEDSACON" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SACON" edc:desc="" edc:mask="0xffffffff" edc:name="SACON" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4054" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="----------------------------rrrr" edc:cname="CEDCSTATE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="CEDCSTATE" edc:nzwidth="32" edc:por="----------------------------0000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSTATE" edc:desc="" edc:mask="0xf" edc:name="CSTATE" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4058" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="---------------------------rrrrr" edc:cname="CEDTXBCNT" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="CEDTXBCNT" edc:nzwidth="32" edc:por="---------------------------00000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTXBCNT" edc:desc="" edc:mask="0x1f" edc:name="CTXBCNT" edc:nzwidth="5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E405C" edc:_begin="0x0" edc:_end="0x60" edc:_modsrc="DOS-EIP-00158_crypto_v1.Module" edc:_refcount="1" edc:access="-------------------------rrrrrrr" edc:cname="CEDRXBCNT" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------0000000" edc:name="CEDRXBCNT" edc:nzwidth="32" edc:por="-------------------------0000000" ltx:memberofperipheral="CRYPTO">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DRXBCNT" edc:desc="" edc:mask="0x7f" edc:name="DRXBCNT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E4060" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CEREV" edc:desc="" edc:impl="0xffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------uuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CEREV" edc:nzwidth="32" edc:por="--------xxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MAJOR" edc:mask="0xff" edc:name="MAJOR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="MINOR" edc:mask="0xff" edc:name="MINOR" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="MAINTENANCE" edc:mask="0xff" edc:name="MAINTENANCE" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E4064" edc:offset="0xF9C"/>
      <edc:SFRDef edc:_addr="0x1F8E5000" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGVER" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGVER" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:baseofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="" edc:mask="0x7f" edc:name="REVISION" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="VERSION" edc:desc="" edc:mask="0x1ff" edc:name="VERSION" edc:nzwidth="9"/>
            <edc:SFRFieldDef edc:cname="ID" edc:desc="" edc:mask="0xffff" edc:name="ID" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
