Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.5.203/edc/PIC32MZ1025W104132.PIC
      <edc:SFRDef edc:_addr="0x1F8E5004" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="-------------------n-nnnnnnnnnnn" edc:cname="RNGCON" edc:desc="" edc:impl="0x17ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------0-00001000000" edc:name="RNGCON" edc:nzwidth="32" edc:por="-------------------0-00001000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0xff" edc:name="PLEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="TRNGEN" edc:desc="" edc:mask="0x1" edc:name="TRNGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PRNGEN" edc:desc="" edc:mask="0x1" edc:name="PRNGEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CONT" edc:desc="" edc:mask="0x1" edc:name="CONT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRNGMODE" edc:desc="" edc:mask="0x1" edc:name="TRNGMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LOAD" edc:desc="" edc:mask="0x1" edc:name="LOAD" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E5008" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGPOLY1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111110000000000000000" edc:name="RNGPOLY1" edc:nzwidth="32" edc:por="11111111111111110000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POLY" edc:desc="" edc:mask="0xffffffff" edc:name="POLY" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E500C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGPOLY2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111110000000000000000" edc:name="RNGPOLY2" edc:nzwidth="32" edc:por="11111111111111110000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="POLY" edc:desc="" edc:mask="0xffffffff" edc:name="POLY" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E5010" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGNUMGEN1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111111111111111111111" edc:name="RNGNUMGEN1" edc:nzwidth="32" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RNG" edc:desc="" edc:mask="0xffffffff" edc:name="RNG" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E5014" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RNGNUMGEN2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111111111111111111111111111" edc:name="RNGNUMGEN2" edc:nzwidth="32" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RNG" edc:desc="" edc:mask="0xffffffff" edc:name="RNG" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E5018" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGSEED1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGSEED1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEED" edc:desc="" edc:mask="0xffffffff" edc:name="SEED" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E501C" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RNGSEED2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="RNGSEED2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SEED" edc:desc="" edc:mask="0xffffffff" edc:name="SEED" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E5020" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="DOS-EIP-00350_math_rng_ahbs_v2.Module" edc:_refcount="1" edc:access="-------------------------nnnnnnn" edc:cname="RNGCNT" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------0000000" edc:name="RNGCNT" edc:nzwidth="32" edc:por="-------------------------0000000" ltx:memberofperipheral="RNG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RCNT" edc:desc="" edc:mask="0x7f" edc:name="RCNT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:GPRDataSector edc:beginaddr="0x1F900000" edc:endaddr="0x1F902000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="1" edc:regionid="crypto1SCM"/>
    <edc:GPRDataSector edc:beginaddr="0x1F902000" edc:endaddr="0x1F904000" edc:kseg0="0x80000000" edc:kseg1="0x80000000" edc:ksegdef="1" edc:regionid="crypto1UCM"/>
    <edc:SFRDataSector edc:beginaddr="0x1F920000" edc:endaddr="0x1F940000" edc:kseg0="0x80000000" edc:kseg1="0x80000000" edc:ksegdef="2" edc:regionid="periph_indep_b">
      <edc:SFRDef edc:_addr="0x1F920000" edc:access="-----------nnnnn---nnnnn---nnnnn" edc:cname="PKCONFIG" edc:desc="" edc:impl="0x1f1f1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------uuuuu---uuuuu---uuuuu" edc:name="PKCONFIG" edc:nzwidth="32" edc:por="-----------xxxxx---xxxxx---xxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OPPTRA" edc:mask="0x1f" edc:name="OPPTRA" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OPPTRB" edc:mask="0x1f" edc:name="OPPTRB" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OPPTRC" edc:mask="0x1f" edc:name="OPPTRC" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
